/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>);
impl <T> __IncompleteArrayField<T> {
    #[inline]
    pub fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T { ::std::mem::transmute(self) }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl <T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl <T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self { Self::new() }
}
impl <T> ::std::marker::Copy for __IncompleteArrayField<T> { }
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl <T> __BindgenUnionField<T> {
    #[inline]
    pub fn new() -> Self { __BindgenUnionField(::std::marker::PhantomData) }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T { ::std::mem::transmute(self) }
    #[inline]

pub type __intfptr_t = __int64_t;
pub type __intptr_t = __int64_t;
pub type __intmax_t = __int64_t;
pub type __int_fast8_t = __int32_t;
pub type __int_fast16_t = __int32_t;
pub type __int_fast32_t = __int32_t;
pub type __int_fast64_t = __int64_t;
pub type __int_least8_t = __int8_t;
pub type __int_least16_t = __int16_t;
pub type __int_least32_t = __int32_t;
pub type __int_least64_t = __int64_t;
pub type __ptrdiff_t = __int64_t;
pub type __register_t = __int64_t;
pub type __segsz_t = __int64_t;
pub type __size_t = __uint64_t;
pub type __ssize_t = __int64_t;
pub type __time_t = __int64_t;
pub type __uintfptr_t = __uint64_t;
pub type __uintptr_t = __uint64_t;
pub type __uintmax_t = __uint64_t;
pub type __uint_fast8_t = __uint32_t;
pub type __uint_fast16_t = __uint32_t;
pub type __uint_fast32_t = __uint32_t;
pub type __uint_fast64_t = __uint64_t;
pub type __uint_least8_t = __uint8_t;
pub type __uint_least16_t = __uint16_t;
pub type __uint_least32_t = __uint32_t;
pub type __uint_least64_t = __uint64_t;
pub type __u_register_t = __uint64_t;
pub type __vm_offset_t = __uint64_t;
pub type __vm_paddr_t = __uint64_t;
pub type __vm_size_t = __uint64_t;
pub type ___wchar_t = ::std::os::raw::c_int;
pub type __va_list = __builtin_va_list;
pub type __gnuc_va_list = __va_list;
pub type __blksize_t = __int32_t;
pub type __blkcnt_t = __int64_t;
pub type __clockid_t = __int32_t;
pub type __fflags_t = __uint32_t;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint64_t;
pub type __gid_t = __uint32_t;
pub type __id_t = __int64_t;
pub type __ino_t = __uint64_t;
pub type __key_t = ::std::os::raw::c_long;
pub type __lwpid_t = __int32_t;
pub type __mode_t = __uint16_t;
pub type __accmode_t = ::std::os::raw::c_int;
pub type __nl_item = ::std::os::raw::c_int;
pub type __nlink_t = __uint64_t;
pub type __off_t = __int64_t;
pub type __off64_t = __int64_t;
pub type __pid_t = __int32_t;
pub type __rlim_t = __int64_t;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __suseconds_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __timer {
    _unused: [u8; 0],
}
pub type __timer_t = *mut __timer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __mq {
    _unused: [u8; 0],
}
pub type __mqd_t = *mut __mq;
pub type __uid_t = __uint32_t;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __cpuwhich_t = ::std::os::raw::c_int;
pub type __cpulevel_t = ::std::os::raw::c_int;
pub type __cpusetid_t = ::std::os::raw::c_int;
pub type __ct_rune_t = ::std::os::raw::c_int;
pub type __rune_t = __ct_rune_t;
pub type __wint_t = __ct_rune_t;
pub type __char16_t = __uint_least16_t;
pub type __char32_t = __uint_least32_t;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct __max_align_t {
    pub __max_align1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __max_align2: f64,
}
#[test]
fn bindgen_test_layout___max_align_t() {
    assert_eq!(::std::mem::size_of::<__max_align_t>() , 32usize , concat ! (
               "Size of: " , stringify ! ( __max_align_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __max_align_t ) ) . __max_align1 as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __max_align_t ) , "::"
                , stringify ! ( __max_align1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __max_align_t ) ) . __max_align2 as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( __max_align_t ) , "::"
                , stringify ! ( __max_align2 ) ));
}
impl Clone for __max_align_t {
    fn clone(&self) -> Self { *self }
}
pub type __dev_t = __uint64_t;
pub type __fixpt_t = __uint32_t;
#[repr(C)]
#[derive(Copy)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: __int64_t,
    _bindgen_union_align: [u64; 16usize],
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(::std::mem::size_of::<__mbstate_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( __mbstate_t ) ));
    assert_eq! (::std::mem::align_of::<__mbstate_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __mbstate_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __mbstate8 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __mbstate8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . _mbstateL as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( _mbstateL ) ));
}
impl Clone for __mbstate_t {
    fn clone(&self) -> Self { *self }
}
impl Default for __mbstate_t {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for __mbstate_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "__mbstate_t {{ union }}")
    }
}
pub type __rman_res_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_once {
    pub state: ::std::os::raw::c_int,
    pub mutex: pthread_mutex_t,
}
#[test]
fn bindgen_test_layout_pthread_once() {
    assert_eq!(::std::mem::size_of::<pthread_once>() , 16usize , concat ! (
               "Size of: " , stringify ! ( pthread_once ) ));
    assert_eq! (::std::mem::align_of::<pthread_once>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_once ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_once ) ) . state as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_once ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_once ) ) . mutex as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_once ) , "::" ,
                stringify ! ( mutex ) ));
}
impl Clone for pthread_once {
    fn clone(&self) -> Self { *self }
}
impl Default for pthread_once {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlock {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlockattr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrier {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrier_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_spinlock {
    _unused: [u8; 0],
}
pub type pthread_t = *mut pthread;
pub type pthread_attr_t = *mut pthread_attr;
pub type pthread_mutex_t = *mut pthread_mutex;
pub type pthread_mutexattr_t = *mut pthread_mutex_attr;
pub type pthread_cond_t = *mut pthread_cond;
pub type pthread_condattr_t = *mut pthread_cond_attr;
pub type pthread_key_t = ::std::os::raw::c_int;
pub type pthread_once_t = pthread_once;
pub type pthread_rwlock_t = *mut pthread_rwlock;
pub type pthread_rwlockattr_t = *mut pthread_rwlockattr;
pub type pthread_barrier_t = *mut pthread_barrier;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrierattr {
    _unused: [u8; 0],
}
pub type pthread_barrierattr_t = *mut pthread_barrierattr;
pub type pthread_spinlock_t = *mut pthread_spinlock;
pub type pthread_addr_t = *mut ::std::os::raw::c_void;
pub type pthread_startroutine_t =
    ::std::option::Option<unsafe extern "C" fn(arg1:
                                                   *mut ::std::os::raw::c_void)
                              -> *mut ::std::os::raw::c_void>;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type u_quad_t = __uint64_t;
pub type quad_t = __int64_t;
pub type qaddr_t = *mut quad_t;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type c_caddr_t = *const ::std::os::raw::c_char;
pub type blksize_t = __blksize_t;
pub type cpuwhich_t = __cpuwhich_t;
pub type cpulevel_t = __cpulevel_t;
pub type cpusetid_t = __cpusetid_t;
pub type blkcnt_t = __blkcnt_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type critical_t = __critical_t;
pub type daddr_t = __int64_t;
pub type dev_t = __dev_t;
pub type fflags_t = __fflags_t;
pub type fixpt_t = __fixpt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type gid_t = __gid_t;
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type id_t = __id_t;
pub type ino_t = __ino_t;
pub type key_t = __key_t;
pub type lwpid_t = __lwpid_t;
pub type mode_t = __mode_t;
pub type accmode_t = __accmode_t;
pub type nlink_t = __nlink_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type register_t = __register_t;
pub type rlim_t = __rlim_t;
pub type sbintime_t = __int64_t;
pub type segsz_t = __segsz_t;
pub type suseconds_t = __suseconds_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type mqd_t = __mqd_t;
pub type u_register_t = __u_register_t;
pub type uid_t = __uid_t;
pub type useconds_t = __useconds_t;
pub type cap_ioctl_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cap_rights {
    _unused: [u8; 0],
}
pub type cap_rights_t = cap_rights;
pub type vm_offset_t = __vm_offset_t;
pub type vm_ooffset_t = __int64_t;
pub type vm_paddr_t = __vm_paddr_t;
pub type vm_pindex_t = __uint64_t;
pub type vm_size_t = __vm_size_t;
pub type rman_res_t = __rman_res_t;
pub type boolean_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct device {
    _unused: [u8; 0],
}
pub type device_t = *mut device;
pub type intfptr_t = __intfptr_t;
pub type intrmask_t = __uint32_t;
pub type uintfptr_t = __uintfptr_t;
pub type uoff_t = __uint64_t;
pub type vm_memattr_t = ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_page {
    _unused: [u8; 0],
}
pub type vm_page_t = *mut vm_page;
pub type bool_ = bool;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct __sigset {
    pub __bits: [__uint32_t; 4usize],
}
#[test]
fn bindgen_test_layout___sigset() {
    assert_eq!(::std::mem::size_of::<__sigset>() , 16usize , concat ! (
               "Size of: " , stringify ! ( __sigset ) ));
    assert_eq! (::std::mem::align_of::<__sigset>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __sigset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sigset ) ) . __bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sigset ) , "::" ,
                stringify ! ( __bits ) ));
}
impl Clone for __sigset {
    fn clone(&self) -> Self { *self }
}
pub type __sigset_t = __sigset;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(::std::mem::size_of::<timeval>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timeval ) ));
    assert_eq! (::std::mem::align_of::<timeval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timeval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_usec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_usec ) ));
}
impl Clone for timeval {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::std::mem::size_of::<timespec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timespec ) ));
    assert_eq! (::std::mem::align_of::<timespec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timespec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_nsec ) ));
}
impl Clone for timespec {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(::std::mem::size_of::<itimerspec>() , 32usize , concat ! (
               "Size of: " , stringify ! ( itimerspec ) ));
    assert_eq! (::std::mem::align_of::<itimerspec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( itimerspec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_interval as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_interval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_value as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_value ) ));
}
impl Clone for itimerspec {
    fn clone(&self) -> Self { *self }
}
pub type __fd_mask = ::std::os::raw::c_ulong;
pub type fd_mask = __fd_mask;
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(::std::mem::size_of::<fd_set>() , 128usize , concat ! (
               "Size of: " , stringify ! ( fd_set ) ));
    assert_eq! (::std::mem::align_of::<fd_set>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( fd_set ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fd_set ) ) . __fds_bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fd_set ) , "::" ,
                stringify ! ( __fds_bits ) ));
}
impl Clone for fd_set {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    assert_eq!(::std::mem::size_of::<iovec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( iovec ) ));
    assert_eq! (::std::mem::align_of::<iovec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( iovec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const iovec ) ) . iov_base as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( iovec ) , "::" ,
                stringify ! ( iov_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const iovec ) ) . iov_len as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( iovec ) , "::" ,
                stringify ! ( iov_len ) ));
}
impl Clone for iovec {
    fn clone(&self) -> Self { *self }
}
impl Default for iovec {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type sa_family_t = __sa_family_t;
pub type socklen_t = __socklen_t;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    assert_eq!(::std::mem::size_of::<linger>() , 8usize , concat ! (
               "Size of: " , stringify ! ( linger ) ));
    assert_eq! (::std::mem::align_of::<linger>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( linger ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const linger ) ) . l_onoff as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( linger ) , "::" ,
                stringify ! ( l_onoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const linger ) ) . l_linger as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( linger ) , "::" ,
                stringify ! ( l_linger ) ));
}
impl Clone for linger {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct accept_filter_arg {
    pub af_name: [::std::os::raw::c_char; 16usize],
    pub af_arg: [::std::os::raw::c_char; 240usize],
}
#[test]
fn bindgen_test_layout_accept_filter_arg() {
    assert_eq!(::std::mem::size_of::<accept_filter_arg>() , 256usize , concat
               ! ( "Size of: " , stringify ! ( accept_filter_arg ) ));
    assert_eq! (::std::mem::align_of::<accept_filter_arg>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( accept_filter_arg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const accept_filter_arg ) ) . af_name as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( accept_filter_arg ) ,
                "::" , stringify ! ( af_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const accept_filter_arg ) ) . af_arg as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( accept_filter_arg ) ,
                "::" , stringify ! ( af_arg ) ));
}
impl Clone for accept_filter_arg {
    fn clone(&self) -> Self { *self }
}
impl Default for accept_filter_arg {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for accept_filter_arg {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "accept_filter_arg {{ af_name: {:?}, af_arg: [{}] }}" ,
               self . af_name , self . af_arg . iter (  ) . enumerate (  ) .
               map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ))
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct sockaddr {
    pub sa_len: ::std::os::raw::c_uchar,
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    assert_eq!(::std::mem::size_of::<sockaddr>() , 16usize , concat ! (
               "Size of: " , stringify ! ( sockaddr ) ));
    assert_eq! (::std::mem::align_of::<sockaddr>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( sockaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr ) ) . sa_len as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr ) , "::" ,
                stringify ! ( sa_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr ) ) . sa_family as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr ) , "::" ,
                stringify ! ( sa_family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr ) ) . sa_data as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr ) , "::" ,
                stringify ! ( sa_data ) ));
}
impl Clone for sockaddr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct sockproto {
    pub sp_family: ::std::os::raw::c_ushort,
    pub sp_protocol: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_sockproto() {
    assert_eq!(::std::mem::size_of::<sockproto>() , 4usize , concat ! (
               "Size of: " , stringify ! ( sockproto ) ));
    assert_eq! (::std::mem::align_of::<sockproto>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( sockproto ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockproto ) ) . sp_family as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sockproto ) , "::" ,
                stringify ! ( sp_family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockproto ) ) . sp_protocol as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( sockproto ) , "::" ,
                stringify ! ( sp_protocol ) ));
}
impl Clone for sockproto {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct sockaddr_storage {
    pub ss_len: ::std::os::raw::c_uchar,
    pub ss_family: sa_family_t,
    pub __ss_pad1: [::std::os::raw::c_char; 6usize],
    pub __ss_align: __int64_t,
    pub __ss_pad2: [::std::os::raw::c_char; 112usize],
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    assert_eq!(::std::mem::size_of::<sockaddr_storage>() , 128usize , concat !
               ( "Size of: " , stringify ! ( sockaddr_storage ) ));
    assert_eq! (::std::mem::align_of::<sockaddr_storage>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( sockaddr_storage ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_storage ) ) . ss_len as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_storage ) ,
                "::" , stringify ! ( ss_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_storage ) ) . ss_family as *
                const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_storage ) ,
                "::" , stringify ! ( ss_family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_storage ) ) . __ss_pad1 as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_storage ) ,
                "::" , stringify ! ( __ss_pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_storage ) ) . __ss_align as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_storage ) ,
                "::" , stringify ! ( __ss_align ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockaddr_storage ) ) . __ss_pad2 as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( sockaddr_storage ) ,
                "::" , stringify ! ( __ss_pad2 ) ));
}
impl Clone for sockaddr_storage {
    fn clone(&self) -> Self { *self }
}
impl Default for sockaddr_storage {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for sockaddr_storage {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "sockaddr_storage {{ ss_len: {:?}, ss_family: {:?}, __ss_pad1: {:?}, __ss_align: {:?}, __ss_pad2: [{}] }}"
               , self . ss_len , self . ss_family , self . __ss_pad1 , self .
               __ss_align , self . __ss_pad2 . iter (  ) . enumerate (  ) .
               map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: ::std::os::raw::c_int,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: socklen_t,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    assert_eq!(::std::mem::size_of::<msghdr>() , 48usize , concat ! (
               "Size of: " , stringify ! ( msghdr ) ));
    assert_eq! (::std::mem::align_of::<msghdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( msghdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_namelen as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_namelen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_iov as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_iov ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_iovlen as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_iovlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_control as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_control ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_controllen as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_controllen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const msghdr ) ) . msg_flags as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( msghdr ) , "::" ,
                stringify ! ( msg_flags ) ));
}
impl Clone for msghdr {
    fn clone(&self) -> Self { *self }
}
impl Default for msghdr {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct cmsghdr {
    pub cmsg_len: socklen_t,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    assert_eq!(::std::mem::size_of::<cmsghdr>() , 12usize , concat ! (
               "Size of: " , stringify ! ( cmsghdr ) ));
    assert_eq! (::std::mem::align_of::<cmsghdr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( cmsghdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmsghdr ) ) . cmsg_len as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmsghdr ) , "::" ,
                stringify ! ( cmsg_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmsghdr ) ) . cmsg_level as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( cmsghdr ) , "::" ,
                stringify ! ( cmsg_level ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmsghdr ) ) . cmsg_type as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( cmsghdr ) , "::" ,
                stringify ! ( cmsg_type ) ));
}
impl Clone for cmsghdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct cmsgcred {
    pub cmcred_pid: pid_t,
    pub cmcred_uid: uid_t,
    pub cmcred_euid: uid_t,
    pub cmcred_gid: gid_t,
    pub cmcred_ngroups: ::std::os::raw::c_short,
    pub cmcred_groups: [gid_t; 16usize],
}
#[test]
fn bindgen_test_layout_cmsgcred() {
    assert_eq!(::std::mem::size_of::<cmsgcred>() , 84usize , concat ! (
               "Size of: " , stringify ! ( cmsgcred ) ));
    assert_eq! (::std::mem::align_of::<cmsgcred>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( cmsgcred ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmsgcred ) ) . cmcred_pid as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cmsgcred ) , "::" ,
                stringify ! ( cmcred_pid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmsgcred ) ) . cmcred_uid as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( cmsgcred ) , "::" ,
                stringify ! ( cmcred_uid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmsgcred ) ) . cmcred_euid as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( cmsgcred ) , "::" ,
                stringify ! ( cmcred_euid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmsgcred ) ) . cmcred_gid as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( cmsgcred ) , "::" ,
                stringify ! ( cmcred_gid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmsgcred ) ) . cmcred_ngroups as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( cmsgcred ) , "::" ,
                stringify ! ( cmcred_ngroups ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cmsgcred ) ) . cmcred_groups as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( cmsgcred ) , "::" ,
                stringify ! ( cmcred_groups ) ));
}
impl Clone for cmsgcred {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct sockcred {
    pub sc_uid: uid_t,
    pub sc_euid: uid_t,
    pub sc_gid: gid_t,
    pub sc_egid: gid_t,
    pub sc_ngroups: ::std::os::raw::c_int,
    pub sc_groups: [gid_t; 1usize],
}
#[test]
fn bindgen_test_layout_sockcred() {
    assert_eq!(::std::mem::size_of::<sockcred>() , 24usize , concat ! (
               "Size of: " , stringify ! ( sockcred ) ));
    assert_eq! (::std::mem::align_of::<sockcred>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( sockcred ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockcred ) ) . sc_uid as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sockcred ) , "::" ,
                stringify ! ( sc_uid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockcred ) ) . sc_euid as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( sockcred ) , "::" ,
                stringify ! ( sc_euid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockcred ) ) . sc_gid as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sockcred ) , "::" ,
                stringify ! ( sc_gid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockcred ) ) . sc_egid as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( sockcred ) , "::" ,
                stringify ! ( sc_egid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockcred ) ) . sc_ngroups as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( sockcred ) , "::" ,
                stringify ! ( sc_ngroups ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sockcred ) ) . sc_groups as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( sockcred ) , "::" ,
                stringify ! ( sc_groups ) ));
}
impl Clone for sockcred {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct sock_timestamp_info {
    pub st_info_flags: __uint32_t,
    pub st_info_pad0: __uint32_t,
    pub st_info_rsv: [__uint64_t; 7usize],
}
#[test]
fn bindgen_test_layout_sock_timestamp_info() {
    assert_eq!(::std::mem::size_of::<sock_timestamp_info>() , 64usize , concat
               ! ( "Size of: " , stringify ! ( sock_timestamp_info ) ));
    assert_eq! (::std::mem::align_of::<sock_timestamp_info>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( sock_timestamp_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sock_timestamp_info ) ) . st_info_flags
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sock_timestamp_info ) ,
                "::" , stringify ! ( st_info_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sock_timestamp_info ) ) . st_info_pad0 as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( sock_timestamp_info ) ,
                "::" , stringify ! ( st_info_pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sock_timestamp_info ) ) . st_info_rsv as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sock_timestamp_info ) ,
                "::" , stringify ! ( st_info_rsv ) ));
}
impl Clone for sock_timestamp_info {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    assert_eq!(::std::mem::size_of::<osockaddr>() , 16usize , concat ! (
               "Size of: " , stringify ! ( osockaddr ) ));
    assert_eq! (::std::mem::align_of::<osockaddr>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( osockaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const osockaddr ) ) . sa_family as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( osockaddr ) , "::" ,
                stringify ! ( sa_family ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const osockaddr ) ) . sa_data as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( osockaddr ) , "::" ,
                stringify ! ( sa_data ) ));
}
impl Clone for osockaddr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct omsghdr {
    pub msg_name: *mut ::std::os::raw::c_char,
    pub msg_namelen: ::std::os::raw::c_int,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: ::std::os::raw::c_int,
    pub msg_accrights: *mut ::std::os::raw::c_char,
    pub msg_accrightslen: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_omsghdr() {
    assert_eq!(::std::mem::size_of::<omsghdr>() , 48usize , concat ! (
               "Size of: " , stringify ! ( omsghdr ) ));
    assert_eq! (::std::mem::align_of::<omsghdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( omsghdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const omsghdr ) ) . msg_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( omsghdr ) , "::" ,
                stringify ! ( msg_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const omsghdr ) ) . msg_namelen as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( omsghdr ) , "::" ,
                stringify ! ( msg_namelen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const omsghdr ) ) . msg_iov as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( omsghdr ) , "::" ,
                stringify ! ( msg_iov ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const omsghdr ) ) . msg_iovlen as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( omsghdr ) , "::" ,
                stringify ! ( msg_iovlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const omsghdr ) ) . msg_accrights as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( omsghdr ) , "::" ,
                stringify ! ( msg_accrights ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const omsghdr ) ) . msg_accrightslen as * const
                _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( omsghdr ) , "::" ,
                stringify ! ( msg_accrightslen ) ));
}
impl Clone for omsghdr {
    fn clone(&self) -> Self { *self }
}
impl Default for omsghdr {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sf_hdtr {
    pub headers: *mut iovec,
    pub hdr_cnt: ::std::os::raw::c_int,
    pub trailers: *mut iovec,
    pub trl_cnt: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sf_hdtr() {
    assert_eq!(::std::mem::size_of::<sf_hdtr>() , 32usize , concat ! (
               "Size of: " , stringify ! ( sf_hdtr ) ));
    assert_eq! (::std::mem::align_of::<sf_hdtr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sf_hdtr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sf_hdtr ) ) . headers as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sf_hdtr ) , "::" ,
                stringify ! ( headers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sf_hdtr ) ) . hdr_cnt as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sf_hdtr ) , "::" ,
                stringify ! ( hdr_cnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sf_hdtr ) ) . trailers as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( sf_hdtr ) , "::" ,
                stringify ! ( trailers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sf_hdtr ) ) . trl_cnt as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( sf_hdtr ) , "::" ,
                stringify ! ( trl_cnt ) ));
}
impl Clone for sf_hdtr {
    fn clone(&self) -> Self { *self }
}
impl Default for sf_hdtr {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mmsghdr {
    pub msg_hdr: msghdr,
    pub msg_len: isize,
}
#[test]
fn bindgen_test_layout_mmsghdr() {
    assert_eq!(::std::mem::size_of::<mmsghdr>() , 56usize , concat ! (
               "Size of: " , stringify ! ( mmsghdr ) ));
    assert_eq! (::std::mem::align_of::<mmsghdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( mmsghdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mmsghdr ) ) . msg_hdr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mmsghdr ) , "::" ,
                stringify ! ( msg_hdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mmsghdr ) ) . msg_len as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( mmsghdr ) , "::" ,
                stringify ! ( msg_len ) ));
}
impl Clone for mmsghdr {
    fn clone(&self) -> Self { *self }
}
impl Default for mmsghdr {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct socket {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tcpcb {
    _unused: [u8; 0],
}
extern "C" {
    pub fn so_sototcpcb(so: *mut socket) -> *mut tcpcb;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct inpcb {
    _unused: [u8; 0],
}
extern "C" {
    pub fn so_sotoinpcb(so: *mut socket) -> *mut inpcb;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockbuf {
    _unused: [u8; 0],
}
extern "C" {
    pub fn so_sockbuf_snd(arg1: *mut socket) -> *mut sockbuf;
}
extern "C" {
    pub fn so_sockbuf_rcv(arg1: *mut socket) -> *mut sockbuf;
}
extern "C" {
    pub fn so_state_get(arg1: *const socket) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn so_state_set(arg1: *mut socket, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn so_options_get(arg1: *const socket) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn so_options_set(arg1: *mut socket, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn so_error_get(arg1: *const socket) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn so_error_set(arg1: *mut socket, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn so_linger_get(arg1: *const socket) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn so_linger_set(arg1: *mut socket, arg2: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct protosw {
    _unused: [u8; 0],
}
extern "C" {
    pub fn so_protosw_get(arg1: *const socket) -> *mut protosw;
}
extern "C" {
    pub fn so_protosw_set(arg1: *mut socket, arg2: *mut protosw);
}
extern "C" {
    pub fn so_sorwakeup_locked(so: *mut socket);
}
extern "C" {
    pub fn so_sowwakeup_locked(so: *mut socket);
}
extern "C" {
    pub fn so_sorwakeup(so: *mut socket);
}
extern "C" {
    pub fn so_sowwakeup(so: *mut socket);
}
extern "C" {
    pub fn so_lock(so: *mut socket);
}
extern "C" {
    pub fn so_unlock(so: *mut socket);
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct if_clonereq {
    pub ifcr_total: ::std::os::raw::c_int,
    pub ifcr_count: ::std::os::raw::c_int,
    pub ifcr_buffer: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_if_clonereq() {
    assert_eq!(::std::mem::size_of::<if_clonereq>() , 16usize , concat ! (
               "Size of: " , stringify ! ( if_clonereq ) ));
    assert_eq! (::std::mem::align_of::<if_clonereq>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( if_clonereq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_clonereq ) ) . ifcr_total as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( if_clonereq ) , "::" ,
                stringify ! ( ifcr_total ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_clonereq ) ) . ifcr_count as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( if_clonereq ) , "::" ,
                stringify ! ( ifcr_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_clonereq ) ) . ifcr_buffer as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( if_clonereq ) , "::" ,
                stringify ! ( ifcr_buffer ) ));
}
impl Clone for if_clonereq {
    fn clone(&self) -> Self { *self }
}
impl Default for if_clonereq {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct if_data {
    pub ifi_type: u8,
    pub ifi_physical: u8,
    pub ifi_addrlen: u8,
    pub ifi_hdrlen: u8,
    pub ifi_link_state: u8,
    pub ifi_vhid: u8,
    pub ifi_datalen: u16,
    pub ifi_mtu: u32,
    pub ifi_metric: u32,
    pub ifi_baudrate: u64,
    pub ifi_ipackets: u64,
    pub ifi_ierrors: u64,
    pub ifi_opackets: u64,
    pub ifi_oerrors: u64,
    pub ifi_collisions: u64,
    pub ifi_ibytes: u64,
    pub ifi_obytes: u64,
    pub ifi_imcasts: u64,
    pub ifi_omcasts: u64,
    pub ifi_iqdrops: u64,
    pub ifi_oqdrops: u64,
    pub ifi_noproto: u64,
    pub ifi_hwassist: u64,
    pub __ifi_epoch: if_data__bindgen_ty_1,
    pub __ifi_lastchange: if_data__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy)]
pub union if_data__bindgen_ty_1 {
    pub tt: time_t,
    pub ph: u64,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_if_data__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<if_data__bindgen_ty_1>() , 8usize ,
               concat ! ( "Size of: " , stringify ! ( if_data__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<if_data__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( if_data__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data__bindgen_ty_1 ) ) . tt as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data__bindgen_ty_1 )
                , "::" , stringify ! ( tt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data__bindgen_ty_1 ) ) . ph as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data__bindgen_ty_1 )
                , "::" , stringify ! ( ph ) ));
}
impl Clone for if_data__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for if_data__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for if_data__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "if_data__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy)]
pub union if_data__bindgen_ty_2 {
    pub tv: timeval,
    pub ph: if_data__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct if_data__bindgen_ty_2__bindgen_ty_1 {
    pub ph1: u64,
    pub ph2: u64,
}
#[test]
fn bindgen_test_layout_if_data__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<if_data__bindgen_ty_2__bindgen_ty_1>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( if_data__bindgen_ty_2__bindgen_ty_1
               ) ));
    assert_eq! (::std::mem::align_of::<if_data__bindgen_ty_2__bindgen_ty_1>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                if_data__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data__bindgen_ty_2__bindgen_ty_1 ) ) .
                ph1 as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                if_data__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                ph1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data__bindgen_ty_2__bindgen_ty_1 ) ) .
                ph2 as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                if_data__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                ph2 ) ));
}
impl Clone for if_data__bindgen_ty_2__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_if_data__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<if_data__bindgen_ty_2>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( if_data__bindgen_ty_2 )
               ));
    assert_eq! (::std::mem::align_of::<if_data__bindgen_ty_2>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( if_data__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data__bindgen_ty_2 ) ) . tv as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data__bindgen_ty_2 )
                , "::" , stringify ! ( tv ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data__bindgen_ty_2 ) ) . ph as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data__bindgen_ty_2 )
                , "::" , stringify ! ( ph ) ));
}
impl Clone for if_data__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for if_data__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for if_data__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "if_data__bindgen_ty_2 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_if_data() {
    assert_eq!(::std::mem::size_of::<if_data>() , 152usize , concat ! (
               "Size of: " , stringify ! ( if_data ) ));
    assert_eq! (::std::mem::align_of::<if_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( if_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_type as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_physical as * const _
                as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_physical ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_addrlen as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_addrlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_hdrlen as * const _ as
                usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_hdrlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_link_state as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_link_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_vhid as * const _ as
                usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_vhid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_datalen as * const _ as
                usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_datalen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_mtu as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_mtu ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_metric as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_metric ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_baudrate as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_baudrate ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_ipackets as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_ipackets ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_ierrors as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_ierrors ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_opackets as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_opackets ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_oerrors as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_oerrors ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_collisions as * const _
                as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_collisions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_ibytes as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_ibytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_obytes as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_obytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_imcasts as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_imcasts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_omcasts as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_omcasts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_iqdrops as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_iqdrops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_oqdrops as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_oqdrops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_noproto as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_noproto ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . ifi_hwassist as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( ifi_hwassist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . __ifi_epoch as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( __ifi_epoch ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_data ) ) . __ifi_lastchange as * const
                _ as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( if_data ) , "::" ,
                stringify ! ( __ifi_lastchange ) ));
}
impl Clone for if_data {
    fn clone(&self) -> Self { *self }
}
impl Default for if_data {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for if_data {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "if_data {{ ifi_type: {:?}, ifi_physical: {:?}, ifi_addrlen: {:?}, ifi_hdrlen: {:?}, ifi_link_state: {:?}, ifi_vhid: {:?}, ifi_datalen: {:?}, ifi_mtu: {:?}, ifi_metric: {:?}, ifi_baudrate: {:?}, ifi_ipackets: {:?}, ifi_ierrors: {:?}, ifi_opackets: {:?}, ifi_oerrors: {:?}, ifi_collisions: {:?}, ifi_ibytes: {:?}, ifi_obytes: {:?}, ifi_imcasts: {:?}, ifi_omcasts: {:?}, ifi_iqdrops: {:?}, ifi_oqdrops: {:?}, ifi_noproto: {:?}, ifi_hwassist: {:?}, __ifi_epoch: {:?}, __ifi_lastchange: {:?} }}"
               , self . ifi_type , self . ifi_physical , self . ifi_addrlen ,
               self . ifi_hdrlen , self . ifi_link_state , self . ifi_vhid ,
               self . ifi_datalen , self . ifi_mtu , self . ifi_metric , self
               . ifi_baudrate , self . ifi_ipackets , self . ifi_ierrors ,
               self . ifi_opackets , self . ifi_oerrors , self .
               ifi_collisions , self . ifi_ibytes , self . ifi_obytes , self .
               ifi_imcasts , self . ifi_omcasts , self . ifi_iqdrops , self .
               ifi_oqdrops , self . ifi_noproto , self . ifi_hwassist , self .
               __ifi_epoch , self . __ifi_lastchange)
    }
}
#[repr(C)]
#[derive(Copy)]
pub struct if_msghdr {
    pub ifm_msglen: u_short,
    pub ifm_version: u_char,
    pub ifm_type: u_char,
    pub ifm_addrs: ::std::os::raw::c_int,
    pub ifm_flags: ::std::os::raw::c_int,
    pub ifm_index: u_short,
    pub ifm_data: if_data,
}
#[test]
fn bindgen_test_layout_if_msghdr() {
    assert_eq!(::std::mem::size_of::<if_msghdr>() , 168usize , concat ! (
               "Size of: " , stringify ! ( if_msghdr ) ));
    assert_eq! (::std::mem::align_of::<if_msghdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( if_msghdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdr ) ) . ifm_msglen as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdr ) , "::" ,
                stringify ! ( ifm_msglen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdr ) ) . ifm_version as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdr ) , "::" ,
                stringify ! ( ifm_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdr ) ) . ifm_type as * const _ as
                usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdr ) , "::" ,
                stringify ! ( ifm_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdr ) ) . ifm_addrs as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdr ) , "::" ,
                stringify ! ( ifm_addrs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdr ) ) . ifm_flags as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdr ) , "::" ,
                stringify ! ( ifm_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdr ) ) . ifm_index as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdr ) , "::" ,
                stringify ! ( ifm_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdr ) ) . ifm_data as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdr ) , "::" ,
                stringify ! ( ifm_data ) ));
}
impl Clone for if_msghdr {
    fn clone(&self) -> Self { *self }
}
impl Default for if_msghdr {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for if_msghdr {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "if_msghdr {{ ifm_msglen: {:?}, ifm_version: {:?}, ifm_type: {:?}, ifm_addrs: {:?}, ifm_flags: {:?}, ifm_index: {:?}, ifm_data: {:?} }}"
               , self . ifm_msglen , self . ifm_version , self . ifm_type ,
               self . ifm_addrs , self . ifm_flags , self . ifm_index , self .
               ifm_data)
    }
}
#[repr(C)]
#[derive(Copy)]
pub struct if_msghdrl {
    pub ifm_msglen: u_short,
    pub ifm_version: u_char,
    pub ifm_type: u_char,
    pub ifm_addrs: ::std::os::raw::c_int,
    pub ifm_flags: ::std::os::raw::c_int,
    pub ifm_index: u_short,
    pub _ifm_spare1: u_short,
    pub ifm_len: u_short,
    pub ifm_data_off: u_short,
    pub ifm_data: if_data,
}
#[test]
fn bindgen_test_layout_if_msghdrl() {
    assert_eq!(::std::mem::size_of::<if_msghdrl>() , 176usize , concat ! (
               "Size of: " , stringify ! ( if_msghdrl ) ));
    assert_eq! (::std::mem::align_of::<if_msghdrl>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( if_msghdrl ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . ifm_msglen as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( ifm_msglen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . ifm_version as * const _
                as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( ifm_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . ifm_type as * const _ as
                usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( ifm_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . ifm_addrs as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( ifm_addrs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . ifm_flags as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( ifm_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . ifm_index as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( ifm_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . _ifm_spare1 as * const _
                as usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( _ifm_spare1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . ifm_len as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( ifm_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . ifm_data_off as * const
                _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( ifm_data_off ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_msghdrl ) ) . ifm_data as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( if_msghdrl ) , "::" ,
                stringify ! ( ifm_data ) ));
}
impl Clone for if_msghdrl {
    fn clone(&self) -> Self { *self }
}
impl Default for if_msghdrl {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for if_msghdrl {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "if_msghdrl {{ ifm_msglen: {:?}, ifm_version: {:?}, ifm_type: {:?}, ifm_addrs: {:?}, ifm_flags: {:?}, ifm_index: {:?}, _ifm_spare1: {:?}, ifm_len: {:?}, ifm_data_off: {:?}, ifm_data: {:?} }}"
               , self . ifm_msglen , self . ifm_version , self . ifm_type ,
               self . ifm_addrs , self . ifm_flags , self . ifm_index , self .
               _ifm_spare1 , self . ifm_len , self . ifm_data_off , self .
               ifm_data)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct ifa_msghdr {
    pub ifam_msglen: u_short,
    pub ifam_version: u_char,
    pub ifam_type: u_char,
    pub ifam_addrs: ::std::os::raw::c_int,
    pub ifam_flags: ::std::os::raw::c_int,
    pub ifam_index: u_short,
    pub ifam_metric: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifa_msghdr() {
    assert_eq!(::std::mem::size_of::<ifa_msghdr>() , 20usize , concat ! (
               "Size of: " , stringify ! ( ifa_msghdr ) ));
    assert_eq! (::std::mem::align_of::<ifa_msghdr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ifa_msghdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdr ) ) . ifam_msglen as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdr ) , "::" ,
                stringify ! ( ifam_msglen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdr ) ) . ifam_version as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdr ) , "::" ,
                stringify ! ( ifam_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdr ) ) . ifam_type as * const _
                as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdr ) , "::" ,
                stringify ! ( ifam_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdr ) ) . ifam_addrs as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdr ) , "::" ,
                stringify ! ( ifam_addrs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdr ) ) . ifam_flags as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdr ) , "::" ,
                stringify ! ( ifam_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdr ) ) . ifam_index as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdr ) , "::" ,
                stringify ! ( ifam_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdr ) ) . ifam_metric as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdr ) , "::" ,
                stringify ! ( ifam_metric ) ));
}
impl Clone for ifa_msghdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct ifa_msghdrl {
    pub ifam_msglen: u_short,
    pub ifam_version: u_char,
    pub ifam_type: u_char,
    pub ifam_addrs: ::std::os::raw::c_int,
    pub ifam_flags: ::std::os::raw::c_int,
    pub ifam_index: u_short,
    pub _ifam_spare1: u_short,
    pub ifam_len: u_short,
    pub ifam_data_off: u_short,
    pub ifam_metric: ::std::os::raw::c_int,
    pub ifam_data: if_data,
}
#[test]
fn bindgen_test_layout_ifa_msghdrl() {
    assert_eq!(::std::mem::size_of::<ifa_msghdrl>() , 176usize , concat ! (
               "Size of: " , stringify ! ( ifa_msghdrl ) ));
    assert_eq! (::std::mem::align_of::<ifa_msghdrl>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ifa_msghdrl ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_msglen as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_msglen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_version as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_type as * const _
                as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_addrs as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_addrs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_flags as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_index as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . _ifam_spare1 as * const
                _ as usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( _ifam_spare1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_len as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_data_off as *
                const _ as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_data_off ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_metric as * const
                _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_metric ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifa_msghdrl ) ) . ifam_data as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( ifa_msghdrl ) , "::" ,
                stringify ! ( ifam_data ) ));
}
impl Clone for ifa_msghdrl {
    fn clone(&self) -> Self { *self }
}
impl Default for ifa_msghdrl {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifa_msghdrl {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "ifa_msghdrl {{ ifam_msglen: {:?}, ifam_version: {:?}, ifam_type: {:?}, ifam_addrs: {:?}, ifam_flags: {:?}, ifam_index: {:?}, _ifam_spare1: {:?}, ifam_len: {:?}, ifam_data_off: {:?}, ifam_metric: {:?}, ifam_data: {:?} }}"
               , self . ifam_msglen , self . ifam_version , self . ifam_type ,
               self . ifam_addrs , self . ifam_flags , self . ifam_index ,
               self . _ifam_spare1 , self . ifam_len , self . ifam_data_off ,
               self . ifam_metric , self . ifam_data)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct ifma_msghdr {
    pub ifmam_msglen: u_short,
    pub ifmam_version: u_char,
    pub ifmam_type: u_char,
    pub ifmam_addrs: ::std::os::raw::c_int,
    pub ifmam_flags: ::std::os::raw::c_int,
    pub ifmam_index: u_short,
}
#[test]
fn bindgen_test_layout_ifma_msghdr() {
    assert_eq!(::std::mem::size_of::<ifma_msghdr>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ifma_msghdr ) ));
    assert_eq! (::std::mem::align_of::<ifma_msghdr>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ifma_msghdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifma_msghdr ) ) . ifmam_msglen as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifma_msghdr ) , "::" ,
                stringify ! ( ifmam_msglen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifma_msghdr ) ) . ifmam_version as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( ifma_msghdr ) , "::" ,
                stringify ! ( ifmam_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifma_msghdr ) ) . ifmam_type as * const _
                as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( ifma_msghdr ) , "::" ,
                stringify ! ( ifmam_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifma_msghdr ) ) . ifmam_addrs as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ifma_msghdr ) , "::" ,
                stringify ! ( ifmam_addrs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifma_msghdr ) ) . ifmam_flags as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ifma_msghdr ) , "::" ,
                stringify ! ( ifmam_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifma_msghdr ) ) . ifmam_index as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( ifma_msghdr ) , "::" ,
                stringify ! ( ifmam_index ) ));
}
impl Clone for ifma_msghdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct if_announcemsghdr {
    pub ifan_msglen: u_short,
    pub ifan_version: u_char,
    pub ifan_type: u_char,
    pub ifan_index: u_short,
    pub ifan_name: [::std::os::raw::c_char; 16usize],
    pub ifan_what: u_short,
}
#[test]
fn bindgen_test_layout_if_announcemsghdr() {
    assert_eq!(::std::mem::size_of::<if_announcemsghdr>() , 24usize , concat !
               ( "Size of: " , stringify ! ( if_announcemsghdr ) ));
    assert_eq! (::std::mem::align_of::<if_announcemsghdr>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( if_announcemsghdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_announcemsghdr ) ) . ifan_msglen as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( if_announcemsghdr ) ,
                "::" , stringify ! ( ifan_msglen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_announcemsghdr ) ) . ifan_version as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( if_announcemsghdr ) ,
                "::" , stringify ! ( ifan_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_announcemsghdr ) ) . ifan_type as *
                const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( if_announcemsghdr ) ,
                "::" , stringify ! ( ifan_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_announcemsghdr ) ) . ifan_index as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( if_announcemsghdr ) ,
                "::" , stringify ! ( ifan_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_announcemsghdr ) ) . ifan_name as *
                const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( if_announcemsghdr ) ,
                "::" , stringify ! ( ifan_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const if_announcemsghdr ) ) . ifan_what as *
                const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! ( if_announcemsghdr ) ,
                "::" , stringify ! ( ifan_what ) ));
}
impl Clone for if_announcemsghdr {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ifreq_buffer {
    pub length: usize,
    pub buffer: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ifreq_buffer() {
    assert_eq!(::std::mem::size_of::<ifreq_buffer>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ifreq_buffer ) ));
    assert_eq! (::std::mem::align_of::<ifreq_buffer>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ifreq_buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq_buffer ) ) . length as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq_buffer ) , "::" ,
                stringify ! ( length ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq_buffer ) ) . buffer as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq_buffer ) , "::" ,
                stringify ! ( buffer ) ));
}
impl Clone for ifreq_buffer {
    fn clone(&self) -> Self { *self }
}
impl Default for ifreq_buffer {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct ifreq {
    pub ifr_name: [::std::os::raw::c_char; 16usize],
    pub ifr_ifru: ifreq__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union ifreq__bindgen_ty_1 {
    pub ifru_addr: sockaddr,
    pub ifru_dstaddr: sockaddr,
    pub ifru_broadaddr: sockaddr,
    pub ifru_buffer: ifreq_buffer,
    pub ifru_flags: [::std::os::raw::c_short; 2usize],
    pub ifru_index: ::std::os::raw::c_short,
    pub ifru_jid: ::std::os::raw::c_int,
    pub ifru_metric: ::std::os::raw::c_int,
    pub ifru_mtu: ::std::os::raw::c_int,
    pub ifru_phys: ::std::os::raw::c_int,
    pub ifru_media: ::std::os::raw::c_int,
    pub ifru_data: caddr_t,
    pub ifru_cap: [::std::os::raw::c_int; 2usize],
    pub ifru_fib: u_int,
    pub ifru_vlan_pcp: u_char,
    _bindgen_union_align: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_ifreq__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<ifreq__bindgen_ty_1>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( ifreq__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<ifreq__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( ifreq__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_addr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_dstaddr as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_dstaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_broadaddr
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_broadaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_buffer as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_flags as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_index as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_jid as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_jid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_metric as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_metric ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_mtu as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_mtu ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_phys as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_phys ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_media as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_media ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_cap as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_cap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_fib as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_fib ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq__bindgen_ty_1 ) ) . ifru_vlan_pcp
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq__bindgen_ty_1 ) ,
                "::" , stringify ! ( ifru_vlan_pcp ) ));
}
impl Clone for ifreq__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for ifreq__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifreq__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "ifreq__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ifreq() {
    assert_eq!(::std::mem::size_of::<ifreq>() , 32usize , concat ! (
               "Size of: " , stringify ! ( ifreq ) ));
    assert_eq! (::std::mem::align_of::<ifreq>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ifreq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq ) ) . ifr_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq ) , "::" ,
                stringify ! ( ifr_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifreq ) ) . ifr_ifru as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifreq ) , "::" ,
                stringify ! ( ifr_ifru ) ));
}
impl Clone for ifreq {
    fn clone(&self) -> Self { *self }
}
impl Default for ifreq {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifreq {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "ifreq {{ ifr_name: {:?}, ifr_ifru: {:?} }}" , self .
               ifr_name , self . ifr_ifru)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct ifaliasreq {
    pub ifra_name: [::std::os::raw::c_char; 16usize],
    pub ifra_addr: sockaddr,
    pub ifra_broadaddr: sockaddr,
    pub ifra_mask: sockaddr,
    pub ifra_vhid: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifaliasreq() {
    assert_eq!(::std::mem::size_of::<ifaliasreq>() , 68usize , concat ! (
               "Size of: " , stringify ! ( ifaliasreq ) ));
    assert_eq! (::std::mem::align_of::<ifaliasreq>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ifaliasreq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifaliasreq ) ) . ifra_name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifaliasreq ) , "::" ,
                stringify ! ( ifra_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifaliasreq ) ) . ifra_addr as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifaliasreq ) , "::" ,
                stringify ! ( ifra_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifaliasreq ) ) . ifra_broadaddr as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( ifaliasreq ) , "::" ,
                stringify ! ( ifra_broadaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifaliasreq ) ) . ifra_mask as * const _
                as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( ifaliasreq ) , "::" ,
                stringify ! ( ifra_mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifaliasreq ) ) . ifra_vhid as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( ifaliasreq ) , "::" ,
                stringify ! ( ifra_vhid ) ));
}
impl Clone for ifaliasreq {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct oifaliasreq {
    pub ifra_name: [::std::os::raw::c_char; 16usize],
    pub ifra_addr: sockaddr,
    pub ifra_broadaddr: sockaddr,
    pub ifra_mask: sockaddr,
}
#[test]
fn bindgen_test_layout_oifaliasreq() {
    assert_eq!(::std::mem::size_of::<oifaliasreq>() , 64usize , concat ! (
               "Size of: " , stringify ! ( oifaliasreq ) ));
    assert_eq! (::std::mem::align_of::<oifaliasreq>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( oifaliasreq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const oifaliasreq ) ) . ifra_name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( oifaliasreq ) , "::" ,
                stringify ! ( ifra_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const oifaliasreq ) ) . ifra_addr as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( oifaliasreq ) , "::" ,
                stringify ! ( ifra_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const oifaliasreq ) ) . ifra_broadaddr as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( oifaliasreq ) , "::" ,
                stringify ! ( ifra_broadaddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const oifaliasreq ) ) . ifra_mask as * const _
                as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( oifaliasreq ) , "::" ,
                stringify ! ( ifra_mask ) ));
}
impl Clone for oifaliasreq {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ifmediareq {
    pub ifm_name: [::std::os::raw::c_char; 16usize],
    pub ifm_current: ::std::os::raw::c_int,
    pub ifm_mask: ::std::os::raw::c_int,
    pub ifm_status: ::std::os::raw::c_int,
    pub ifm_active: ::std::os::raw::c_int,
    pub ifm_count: ::std::os::raw::c_int,
    pub ifm_ulist: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifmediareq() {
    assert_eq!(::std::mem::size_of::<ifmediareq>() , 48usize , concat ! (
               "Size of: " , stringify ! ( ifmediareq ) ));
    assert_eq! (::std::mem::align_of::<ifmediareq>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ifmediareq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifmediareq ) ) . ifm_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifmediareq ) , "::" ,
                stringify ! ( ifm_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifmediareq ) ) . ifm_current as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifmediareq ) , "::" ,
                stringify ! ( ifm_current ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifmediareq ) ) . ifm_mask as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( ifmediareq ) , "::" ,
                stringify ! ( ifm_mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifmediareq ) ) . ifm_status as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( ifmediareq ) , "::" ,
                stringify ! ( ifm_status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifmediareq ) ) . ifm_active as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( ifmediareq ) , "::" ,
                stringify ! ( ifm_active ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifmediareq ) ) . ifm_count as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( ifmediareq ) , "::" ,
                stringify ! ( ifm_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifmediareq ) ) . ifm_ulist as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( ifmediareq ) , "::" ,
                stringify ! ( ifm_ulist ) ));
}
impl Clone for ifmediareq {
    fn clone(&self) -> Self { *self }
}
impl Default for ifmediareq {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ifdrv {
    pub ifd_name: [::std::os::raw::c_char; 16usize],
    pub ifd_cmd: ::std::os::raw::c_ulong,
    pub ifd_len: usize,
    pub ifd_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ifdrv() {
    assert_eq!(::std::mem::size_of::<ifdrv>() , 40usize , concat ! (
               "Size of: " , stringify ! ( ifdrv ) ));
    assert_eq! (::std::mem::align_of::<ifdrv>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ifdrv ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifdrv ) ) . ifd_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifdrv ) , "::" ,
                stringify ! ( ifd_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifdrv ) ) . ifd_cmd as * const _ as usize
                } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifdrv ) , "::" ,
                stringify ! ( ifd_cmd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifdrv ) ) . ifd_len as * const _ as usize
                } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( ifdrv ) , "::" ,
                stringify ! ( ifd_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifdrv ) ) . ifd_data as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( ifdrv ) , "::" ,
                stringify ! ( ifd_data ) ));
}
impl Clone for ifdrv {
    fn clone(&self) -> Self { *self }
}
impl Default for ifdrv {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct ifstat {
    pub ifs_name: [::std::os::raw::c_char; 16usize],
    pub ascii: [::std::os::raw::c_char; 801usize],
}
#[test]
fn bindgen_test_layout_ifstat() {
    assert_eq!(::std::mem::size_of::<ifstat>() , 817usize , concat ! (
               "Size of: " , stringify ! ( ifstat ) ));
    assert_eq! (::std::mem::align_of::<ifstat>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( ifstat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifstat ) ) . ifs_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifstat ) , "::" ,
                stringify ! ( ifs_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifstat ) ) . ascii as * const _ as usize
                } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifstat ) , "::" ,
                stringify ! ( ascii ) ));
}
impl Clone for ifstat {
    fn clone(&self) -> Self { *self }
}
impl Default for ifstat {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifstat {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "ifstat {{ ifs_name: {:?}, ascii: [{}] }}" , self .
               ifs_name , self . ascii . iter (  ) . enumerate (  ) . map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ))
    }
}
#[repr(C)]
#[derive(Copy)]
pub struct ifconf {
    pub ifc_len: ::std::os::raw::c_int,
    pub ifc_ifcu: ifconf__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union ifconf__bindgen_ty_1 {
    pub ifcu_buf: caddr_t,
    pub ifcu_req: *mut ifreq,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_ifconf__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<ifconf__bindgen_ty_1>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( ifconf__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<ifconf__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( ifconf__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifconf__bindgen_ty_1 ) ) . ifcu_buf as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifconf__bindgen_ty_1 )
                , "::" , stringify ! ( ifcu_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifconf__bindgen_ty_1 ) ) . ifcu_req as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifconf__bindgen_ty_1 )
                , "::" , stringify ! ( ifcu_req ) ));
}
impl Clone for ifconf__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for ifconf__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifconf__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "ifconf__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ifconf() {
    assert_eq!(::std::mem::size_of::<ifconf>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ifconf ) ));
    assert_eq! (::std::mem::align_of::<ifconf>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ifconf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifconf ) ) . ifc_len as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifconf ) , "::" ,
                stringify ! ( ifc_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifconf ) ) . ifc_ifcu as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ifconf ) , "::" ,
                stringify ! ( ifc_ifcu ) ));
}
impl Clone for ifconf {
    fn clone(&self) -> Self { *self }
}
impl Default for ifconf {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifconf {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "ifconf {{ ifc_len: {:?}, ifc_ifcu: {:?} }}" , self .
               ifc_len , self . ifc_ifcu)
    }
}
#[repr(C)]
#[derive(Copy)]
pub struct ifg_req {
    pub ifgrq_ifgrqu: ifg_req__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union ifg_req__bindgen_ty_1 {
    pub ifgrqu_group: [::std::os::raw::c_char; 16usize],
    pub ifgrqu_member: [::std::os::raw::c_char; 16usize],
    _bindgen_union_align: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_ifg_req__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<ifg_req__bindgen_ty_1>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( ifg_req__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<ifg_req__bindgen_ty_1>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( ifg_req__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifg_req__bindgen_ty_1 ) ) . ifgrqu_group
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifg_req__bindgen_ty_1 )
                , "::" , stringify ! ( ifgrqu_group ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifg_req__bindgen_ty_1 ) ) . ifgrqu_member
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifg_req__bindgen_ty_1 )
                , "::" , stringify ! ( ifgrqu_member ) ));
}
impl Clone for ifg_req__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for ifg_req__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifg_req__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "ifg_req__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ifg_req() {
    assert_eq!(::std::mem::size_of::<ifg_req>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ifg_req ) ));
    assert_eq! (::std::mem::align_of::<ifg_req>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( ifg_req ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifg_req ) ) . ifgrq_ifgrqu as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifg_req ) , "::" ,
                stringify ! ( ifgrq_ifgrqu ) ));
}
impl Clone for ifg_req {
    fn clone(&self) -> Self { *self }
}
impl Default for ifg_req {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifg_req {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "ifg_req {{ ifgrq_ifgrqu: {:?} }}" , self . ifgrq_ifgrqu)
    }
}
#[repr(C)]
#[derive(Copy)]
pub struct ifgroupreq {
    pub ifgr_name: [::std::os::raw::c_char; 16usize],
    pub ifgr_len: u_int,
    pub ifgr_ifgru: ifgroupreq__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union ifgroupreq__bindgen_ty_1 {
    pub ifgru_group: [::std::os::raw::c_char; 16usize],
    pub ifgru_groups: *mut ifg_req,
    _bindgen_union_align: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_ifgroupreq__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<ifgroupreq__bindgen_ty_1>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( ifgroupreq__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<ifgroupreq__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( ifgroupreq__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifgroupreq__bindgen_ty_1 ) ) .
                ifgru_group as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                ifgroupreq__bindgen_ty_1 ) , "::" , stringify ! ( ifgru_group
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifgroupreq__bindgen_ty_1 ) ) .
                ifgru_groups as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                ifgroupreq__bindgen_ty_1 ) , "::" , stringify ! ( ifgru_groups
                ) ));
}
impl Clone for ifgroupreq__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for ifgroupreq__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifgroupreq__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "ifgroupreq__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_ifgroupreq() {
    assert_eq!(::std::mem::size_of::<ifgroupreq>() , 40usize , concat ! (
               "Size of: " , stringify ! ( ifgroupreq ) ));
    assert_eq! (::std::mem::align_of::<ifgroupreq>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ifgroupreq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifgroupreq ) ) . ifgr_name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifgroupreq ) , "::" ,
                stringify ! ( ifgr_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifgroupreq ) ) . ifgr_len as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifgroupreq ) , "::" ,
                stringify ! ( ifgr_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifgroupreq ) ) . ifgr_ifgru as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( ifgroupreq ) , "::" ,
                stringify ! ( ifgr_ifgru ) ));
}
impl Clone for ifgroupreq {
    fn clone(&self) -> Self { *self }
}
impl Default for ifgroupreq {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifgroupreq {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "ifgroupreq {{ ifgr_name: {:?}, ifgr_len: {:?}, ifgr_ifgru: {:?} }}"
               , self . ifgr_name , self . ifgr_len , self . ifgr_ifgru)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct ifi2creq {
    pub dev_addr: u8,
    pub offset: u8,
    pub len: u8,
    pub spare0: u8,
    pub spare1: u32,
    pub data: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_ifi2creq() {
    assert_eq!(::std::mem::size_of::<ifi2creq>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ifi2creq ) ));
    assert_eq! (::std::mem::align_of::<ifi2creq>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ifi2creq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifi2creq ) ) . dev_addr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifi2creq ) , "::" ,
                stringify ! ( dev_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifi2creq ) ) . offset as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( ifi2creq ) , "::" ,
                stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifi2creq ) ) . len as * const _ as usize
                } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( ifi2creq ) , "::" ,
                stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifi2creq ) ) . spare0 as * const _ as
                usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( ifi2creq ) , "::" ,
                stringify ! ( spare0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifi2creq ) ) . spare1 as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ifi2creq ) , "::" ,
                stringify ! ( spare1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifi2creq ) ) . data as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ifi2creq ) , "::" ,
                stringify ! ( data ) ));
}
impl Clone for ifi2creq {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct ifrsskey {
    pub ifrk_name: [::std::os::raw::c_char; 16usize],
    pub ifrk_func: u8,
    pub ifrk_spare0: u8,
    pub ifrk_keylen: u16,
    pub ifrk_key: [u8; 128usize],
}
#[test]
fn bindgen_test_layout_ifrsskey() {
    assert_eq!(::std::mem::size_of::<ifrsskey>() , 148usize , concat ! (
               "Size of: " , stringify ! ( ifrsskey ) ));
    assert_eq! (::std::mem::align_of::<ifrsskey>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( ifrsskey ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsskey ) ) . ifrk_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsskey ) , "::" ,
                stringify ! ( ifrk_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsskey ) ) . ifrk_func as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsskey ) , "::" ,
                stringify ! ( ifrk_func ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsskey ) ) . ifrk_spare0 as * const _
                as usize } , 17usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsskey ) , "::" ,
                stringify ! ( ifrk_spare0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsskey ) ) . ifrk_keylen as * const _
                as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsskey ) , "::" ,
                stringify ! ( ifrk_keylen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsskey ) ) . ifrk_key as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsskey ) , "::" ,
                stringify ! ( ifrk_key ) ));
}
impl Clone for ifrsskey {
    fn clone(&self) -> Self { *self }
}
impl Default for ifrsskey {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for ifrsskey {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "ifrsskey {{ ifrk_name: {:?}, ifrk_func: {:?}, ifrk_spare0: {:?}, ifrk_keylen: {:?}, ifrk_key: [{}] }}"
               , self . ifrk_name , self . ifrk_func , self . ifrk_spare0 ,
               self . ifrk_keylen , self . ifrk_key . iter (  ) . enumerate (
               ) . map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ))
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct ifrsshash {
    pub ifrh_name: [::std::os::raw::c_char; 16usize],
    pub ifrh_func: u8,
    pub ifrh_spare0: u8,
    pub ifrh_spare1: u16,
    pub ifrh_types: u32,
}
#[test]
fn bindgen_test_layout_ifrsshash() {
    assert_eq!(::std::mem::size_of::<ifrsshash>() , 24usize , concat ! (
               "Size of: " , stringify ! ( ifrsshash ) ));
    assert_eq! (::std::mem::align_of::<ifrsshash>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ifrsshash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsshash ) ) . ifrh_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsshash ) , "::" ,
                stringify ! ( ifrh_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsshash ) ) . ifrh_func as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsshash ) , "::" ,
                stringify ! ( ifrh_func ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsshash ) ) . ifrh_spare0 as * const _
                as usize } , 17usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsshash ) , "::" ,
                stringify ! ( ifrh_spare0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsshash ) ) . ifrh_spare1 as * const _
                as usize } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsshash ) , "::" ,
                stringify ! ( ifrh_spare1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ifrsshash ) ) . ifrh_types as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( ifrsshash ) , "::" ,
                stringify ! ( ifrh_types ) ));
}
impl Clone for ifrsshash {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rtentry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rt_addrinfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct carp_if {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct carp_softc {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifvlantrunk {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct route {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct vnet {
    pub vnet_le: vnet__bindgen_ty_1,
    pub vnet_magic_n: u_int,
    pub vnet_ifcnt: u_int,
    pub vnet_sockcnt: u_int,
    pub vnet_state: u_int,
    pub vnet_data_mem: *mut ::std::os::raw::c_void,
    pub vnet_data_base: usize,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct vnet__bindgen_ty_1 {
    pub le_next: *mut vnet,
    pub le_prev: *mut *mut vnet,
}
#[test]
fn bindgen_test_layout_vnet__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<vnet__bindgen_ty_1>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( vnet__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<vnet__bindgen_ty_1>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( vnet__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const vnet__bindgen_ty_1 ) ) . le_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( vnet__bindgen_ty_1 ) ,
                "::" , stringify ! ( le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const vnet__bindgen_ty_1 ) ) . le_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( vnet__bindgen_ty_1 ) ,
                "::" , stringify ! ( le_prev ) ));
}
impl Clone for vnet__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for vnet__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_vnet() {
    assert_eq!(::std::mem::size_of::<vnet>() , 48usize , concat ! (
               "Size of: " , stringify ! ( vnet ) ));
    assert_eq! (::std::mem::align_of::<vnet>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( vnet ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const vnet ) ) . vnet_le as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( vnet ) , "::" ,
                stringify ! ( vnet_le ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const vnet ) ) . vnet_magic_n as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( vnet ) , "::" ,
                stringify ! ( vnet_magic_n ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const vnet ) ) . vnet_ifcnt as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( vnet ) , "::" ,
                stringify ! ( vnet_ifcnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const vnet ) ) . vnet_sockcnt as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( vnet ) , "::" ,
                stringify ! ( vnet_sockcnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const vnet ) ) . vnet_state as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( vnet ) , "::" ,
                stringify ! ( vnet_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const vnet ) ) . vnet_data_mem as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( vnet ) , "::" ,
                stringify ! ( vnet_data_mem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const vnet ) ) . vnet_data_base as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( vnet ) , "::" ,
                stringify ! ( vnet_data_base ) ));
}
impl Clone for vnet {
    fn clone(&self) -> Self { *self }
}
impl Default for vnet {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifmedia {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netmap_adapter {
    _unused: [u8; 0],
}
extern "C" {
    pub fn atomic_cmpset_char(dst: *mut u_char, expect: u_char, src: u_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_cmpset_short(dst: *mut u_short, expect: u_short,
                               src: u_short) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_cmpset_int(dst: *mut u_int, expect: u_int, src: u_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_cmpset_long(dst: *mut u_long, expect: u_long, src: u_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_fcmpset_char(dst: *mut u_char, expect: *mut u_char,
                               src: u_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_fcmpset_short(dst: *mut u_short, expect: *mut u_short,
                                src: u_short) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_fcmpset_int(dst: *mut u_int, expect: *mut u_int, src: u_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_fcmpset_long(dst: *mut u_long, expect: *mut u_long,
                               src: u_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_fetchadd_int(p: *mut u_int, v: u_int) -> u_int;
}
extern "C" {
    pub fn atomic_fetchadd_long(p: *mut u_long, v: u_long) -> u_long;
}
extern "C" {
    pub fn atomic_testandset_int(p: *mut u_int, v: u_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_testandset_long(p: *mut u_long, v: u_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_testandclear_int(p: *mut u_int, v: u_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_testandclear_long(p: *mut u_long, v: u_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atomic_thread_fence_acq();
}
extern "C" {
    pub fn atomic_thread_fence_acq_rel();
}
extern "C" {
    pub fn atomic_thread_fence_rel();
}
extern "C" {
    pub fn atomic_thread_fence_seq_cst();
}
extern "C" {
    pub fn atomic_set_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_set_barr_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_clear_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_clear_barr_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_add_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_add_barr_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_subtract_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_subtract_barr_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_set_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_set_barr_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_clear_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_clear_barr_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_add_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_add_barr_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_subtract_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_subtract_barr_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_set_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_set_barr_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_clear_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_clear_barr_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_add_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_add_barr_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_subtract_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_subtract_barr_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_set_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_set_barr_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_clear_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_clear_barr_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_add_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_add_barr_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_subtract_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_subtract_barr_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_load_acq_char(p: *mut u_char) -> u_char;
}
extern "C" {
    pub fn atomic_store_rel_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_load_acq_short(p: *mut u_short) -> u_short;
}
extern "C" {
    pub fn atomic_store_rel_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_load_acq_int(p: *mut u_int) -> u_int;
}
extern "C" {
    pub fn atomic_store_rel_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_load_acq_long(p: *mut u_long) -> u_long;
}
extern "C" {
    pub fn atomic_store_rel_long(p: *mut u_long, v: u_long);
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct region_descriptor {
    pub _bitfield_1: [u64; 2usize],
    pub __bindgen_align: [u8; 0usize],
}
#[test]
fn bindgen_test_layout_region_descriptor() {
    assert_eq!(::std::mem::size_of::<region_descriptor>() , 10usize , concat !
               ( "Size of: " , stringify ! ( region_descriptor ) ));
    assert_eq! (::std::mem::align_of::<region_descriptor>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( region_descriptor ) ));
}
impl Clone for region_descriptor {
    fn clone(&self) -> Self { *self }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct invpcid_descr {
    pub _bitfield_1: u64,
    pub addr: u64,
}
#[test]
fn bindgen_test_layout_invpcid_descr() {
    assert_eq!(::std::mem::size_of::<invpcid_descr>() , 16usize , concat ! (
               "Size of: " , stringify ! ( invpcid_descr ) ));
    assert_eq! (::std::mem::align_of::<invpcid_descr>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( invpcid_descr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const invpcid_descr ) ) . addr as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( invpcid_descr ) , "::"
                , stringify ! ( addr ) ));
}
impl Clone for invpcid_descr {
    fn clone(&self) -> Self { *self }
}
impl invpcid_descr {
    #[inline]
    pub fn pcid(&self) -> u64 {
        let mut unit_field_val: u64 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u64 as
                                                *mut u8,
                                            ::std::mem::size_of::<u64>())
        };
        let mask = 4095u64 as u64;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_pcid(&mut self, val: u64) {
        let mask = 4095u64 as u64;
        let val = val as u64 as u64;
        let mut unit_field_val: u64 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u64 as
                                                *mut u8,
                                            ::std::mem::size_of::<u64>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u64>());
        }
    }
    #[inline]
    pub fn pad(&self) -> u64 {
        let mut unit_field_val: u64 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u64 as
                                                *mut u8,
                                            ::std::mem::size_of::<u64>())
        };
        let mask = 18446744073709547520u64 as u64;
        let val = (unit_field_val & mask) >> 12usize;
        unsafe { ::std::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_pad(&mut self, val: u64) {
        let mask = 18446744073709547520u64 as u64;
        let val = val as u64 as u64;
        let mut unit_field_val: u64 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u64 as
                                                *mut u8,
                                            ::std::mem::size_of::<u64>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 12usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u64>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(pcid: u64, pad: u64) -> u64 {
        ({ ({ 0 } | ((pcid as u64 as u64) << 0usize) & (4095u64 as u64)) } |
             ((pad as u64 as u64) << 12usize) &
                 (18446744073709547520u64 as u64))
    }
}
pub const SGX_ECREATE: _bindgen_ty_1 = _bindgen_ty_1::SGX_ECREATE;
pub const SGX_EADD: _bindgen_ty_1 = _bindgen_ty_1::SGX_EADD;
pub const SGX_EINIT: _bindgen_ty_1 = _bindgen_ty_1::SGX_EINIT;
pub const SGX_EREMOVE: _bindgen_ty_1 = _bindgen_ty_1::SGX_EREMOVE;
pub const SGX_EDGBRD: _bindgen_ty_1 = _bindgen_ty_1::SGX_EDGBRD;
pub const SGX_EDGBWR: _bindgen_ty_1 = _bindgen_ty_1::SGX_EDGBWR;
pub const SGX_EEXTEND: _bindgen_ty_1 = _bindgen_ty_1::SGX_EEXTEND;
pub const SGX_ELDU: _bindgen_ty_1 = _bindgen_ty_1::SGX_ELDU;
pub const SGX_EBLOCK: _bindgen_ty_1 = _bindgen_ty_1::SGX_EBLOCK;
pub const SGX_EPA: _bindgen_ty_1 = _bindgen_ty_1::SGX_EPA;
pub const SGX_EWB: _bindgen_ty_1 = _bindgen_ty_1::SGX_EWB;
pub const SGX_ETRACK: _bindgen_ty_1 = _bindgen_ty_1::SGX_ETRACK;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    SGX_ECREATE = 0,
    SGX_EADD = 1,
    SGX_EINIT = 2,
    SGX_EREMOVE = 3,
    SGX_EDGBRD = 4,
    SGX_EDGBWR = 5,
    SGX_EEXTEND = 6,
    SGX_ELDU = 8,
    SGX_EBLOCK = 9,
    SGX_EPA = 10,
    SGX_EWB = 11,
    SGX_ETRACK = 12,
}
pub const SGX_PT_SECS: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_SECS;
pub const SGX_PT_TCS: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_TCS;
pub const SGX_PT_REG: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_REG;
pub const SGX_PT_VA: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_VA;
pub const SGX_PT_TRIM: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_TRIM;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 {
    SGX_PT_SECS = 0,
    SGX_PT_TCS = 1,
    SGX_PT_REG = 2,
    SGX_PT_VA = 3,
    SGX_PT_TRIM = 4,
}
extern "C" {
    pub fn sgx_encls(eax: u32, rbx: u64, rcx: u64, rdx: u64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn reset_dbregs();
}
extern "C" {
    pub fn rdmsr_safe(msr: u_int, val: *mut u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wrmsr_safe(msr: u_int, newval: u64) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct lock_object {
    pub lo_name: *const ::std::os::raw::c_char,
    pub lo_flags: u_int,
    pub lo_data: u_int,
    pub lo_witness: *mut witness,
}
#[test]
fn bindgen_test_layout_lock_object() {
    assert_eq!(::std::mem::size_of::<lock_object>() , 24usize , concat ! (
               "Size of: " , stringify ! ( lock_object ) ));
    assert_eq! (::std::mem::align_of::<lock_object>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( lock_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_object ) ) . lo_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_object ) , "::" ,
                stringify ! ( lo_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_object ) ) . lo_flags as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_object ) , "::" ,
                stringify ! ( lo_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_object ) ) . lo_data as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_object ) , "::" ,
                stringify ! ( lo_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_object ) ) . lo_witness as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_object ) , "::" ,
                stringify ! ( lo_witness ) ));
}
impl Clone for lock_object {
    fn clone(&self) -> Self { *self }
}
impl Default for lock_object {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout_list {
    pub lh_first: *mut callout,
}
#[test]
fn bindgen_test_layout_callout_list() {
    assert_eq!(::std::mem::size_of::<callout_list>() , 8usize , concat ! (
               "Size of: " , stringify ! ( callout_list ) ));
    assert_eq! (::std::mem::align_of::<callout_list>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( callout_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_list ) ) . lh_first as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_list ) , "::" ,
                stringify ! ( lh_first ) ));
}
impl Clone for callout_list {
    fn clone(&self) -> Self { *self }
}
impl Default for callout_list {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout_slist {
    pub slh_first: *mut callout,
}
#[test]
fn bindgen_test_layout_callout_slist() {
    assert_eq!(::std::mem::size_of::<callout_slist>() , 8usize , concat ! (
               "Size of: " , stringify ! ( callout_slist ) ));
    assert_eq! (::std::mem::align_of::<callout_slist>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( callout_slist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_slist ) ) . slh_first as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_slist ) , "::"
                , stringify ! ( slh_first ) ));
}
impl Clone for callout_slist {
    fn clone(&self) -> Self { *self }
}
impl Default for callout_slist {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout_tailq {
    pub tqh_first: *mut callout,
    pub tqh_last: *mut *mut callout,
}
#[test]
fn bindgen_test_layout_callout_tailq() {
    assert_eq!(::std::mem::size_of::<callout_tailq>() , 16usize , concat ! (
               "Size of: " , stringify ! ( callout_tailq ) ));
    assert_eq! (::std::mem::align_of::<callout_tailq>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( callout_tailq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_tailq ) ) . tqh_first as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_tailq ) , "::"
                , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_tailq ) ) . tqh_last as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_tailq ) , "::"
                , stringify ! ( tqh_last ) ));
}
impl Clone for callout_tailq {
    fn clone(&self) -> Self { *self }
}
impl Default for callout_tailq {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct callout {
    pub c_links: callout__bindgen_ty_1,
    pub c_time: sbintime_t,
    pub c_precision: sbintime_t,
    pub c_arg: *mut ::std::os::raw::c_void,
    pub c_func: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                               *mut ::std::os::raw::c_void)>,
    pub c_lock: *mut lock_object,
    pub c_flags: ::std::os::raw::c_short,
    pub c_iflags: ::std::os::raw::c_short,
    pub c_cpu: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Copy)]
pub union callout__bindgen_ty_1 {
    pub le: callout__bindgen_ty_1__bindgen_ty_1,
    pub sle: callout__bindgen_ty_1__bindgen_ty_2,
    pub tqe: callout__bindgen_ty_1__bindgen_ty_3,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout__bindgen_ty_1__bindgen_ty_1 {
    pub le_next: *mut callout,
    pub le_prev: *mut *mut callout,
}
#[test]
fn bindgen_test_layout_callout__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<callout__bindgen_ty_1__bindgen_ty_1>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( callout__bindgen_ty_1__bindgen_ty_1
               ) ));
    assert_eq! (::std::mem::align_of::<callout__bindgen_ty_1__bindgen_ty_1>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_1 ) ) .
                le_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! (
                le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_1 ) ) .
                le_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! (
                le_prev ) ));
}
impl Clone for callout__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for callout__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout__bindgen_ty_1__bindgen_ty_2 {
    pub sle_next: *mut callout,
}
#[test]
fn bindgen_test_layout_callout__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<callout__bindgen_ty_1__bindgen_ty_2>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( callout__bindgen_ty_1__bindgen_ty_2
               ) ));
    assert_eq! (::std::mem::align_of::<callout__bindgen_ty_1__bindgen_ty_2>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_2 ) ) .
                sle_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! (
                sle_next ) ));
}
impl Clone for callout__bindgen_ty_1__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for callout__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout__bindgen_ty_1__bindgen_ty_3 {
    pub tqe_next: *mut callout,
    pub tqe_prev: *mut *mut callout,
}
#[test]
fn bindgen_test_layout_callout__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(::std::mem::size_of::<callout__bindgen_ty_1__bindgen_ty_3>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( callout__bindgen_ty_1__bindgen_ty_3
               ) ));
    assert_eq! (::std::mem::align_of::<callout__bindgen_ty_1__bindgen_ty_3>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_3 ) ) .
                tqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_3 ) , "::" , stringify ! (
                tqe_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_3 ) ) .
                tqe_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_3 ) , "::" , stringify ! (
                tqe_prev ) ));
}
impl Clone for callout__bindgen_ty_1__bindgen_ty_3 {
    fn clone(&self) -> Self { *self }
}
impl Default for callout__bindgen_ty_1__bindgen_ty_3 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_callout__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<callout__bindgen_ty_1>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( callout__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<callout__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( callout__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1 ) ) . le as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout__bindgen_ty_1 )
                , "::" , stringify ! ( le ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1 ) ) . sle as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout__bindgen_ty_1 )
                , "::" , stringify ! ( sle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1 ) ) . tqe as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout__bindgen_ty_1 )
                , "::" , stringify ! ( tqe ) ));
}
impl Clone for callout__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for callout__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for callout__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "callout__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_callout() {
    assert_eq!(::std::mem::size_of::<callout>() , 64usize , concat ! (
               "Size of: " , stringify ! ( callout ) ));
    assert_eq! (::std::mem::align_of::<callout>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( callout ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_links as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_links ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_time as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_precision as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_precision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_arg as * const _ as usize
                } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_arg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_func as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_func ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_lock as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_flags as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_iflags as * const _ as
                usize } , 58usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_iflags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_cpu as * const _ as usize
                } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_cpu ) ));
}
impl Clone for callout {
    fn clone(&self) -> Self { *self }
}
impl Default for callout {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for callout {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "callout {{ c_links: {:?}, c_time: {:?}, c_precision: {:?}, c_arg: {:?}, c_func: {:?}, c_lock: {:?}, c_flags: {:?}, c_iflags: {:?}, c_cpu: {:?} }}"
               , self . c_links , self . c_time , self . c_precision , self .
               c_arg , self . c_func , self . c_lock , self . c_flags , self .
               c_iflags , self . c_cpu)
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout_handle {
    pub callout: *mut callout,
}
#[test]
fn bindgen_test_layout_callout_handle() {
    assert_eq!(::std::mem::size_of::<callout_handle>() , 8usize , concat ! (
               "Size of: " , stringify ! ( callout_handle ) ));
    assert_eq! (::std::mem::align_of::<callout_handle>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( callout_handle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_handle ) ) . callout as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_handle ) , "::"
                , stringify ! ( callout ) ));
}
impl Clone for callout_handle {
    fn clone(&self) -> Self { *self }
}
impl Default for callout_handle {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    pub fn callout_init(arg1: *mut callout, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _callout_init_lock(arg1: *mut callout, arg2: *mut lock_object,
                              arg3: ::std::os::raw::c_int);
}
extern "C" {
    pub fn callout_reset_sbt_on(arg1: *mut callout, arg2: sbintime_t,
                                arg3: sbintime_t,
                                arg4:
                                    ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                                   *mut ::std::os::raw::c_void)>,
                                arg5: *mut ::std::os::raw::c_void,
                                arg6: ::std::os::raw::c_int,
                                arg7: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn callout_schedule(arg1: *mut callout, arg2: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn callout_schedule_on(arg1: *mut callout,
                               arg2: ::std::os::raw::c_int,
                               arg3: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _callout_stop_safe(arg1: *mut callout, arg2: ::std::os::raw::c_int,
                              arg3:
                                  ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                                 *mut ::std::os::raw::c_void)>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn callout_process(now: sbintime_t);
}
extern "C" {
    pub fn callout_when(sbt: sbintime_t, precision: sbintime_t,
                        flags: ::std::os::raw::c_int,
                        sbt_res: *mut sbintime_t, prec_res: *mut sbintime_t);
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = __int_fast8_t;
pub type int_fast16_t = __int_fast16_t;
pub type int_fast32_t = __int_fast32_t;
pub type int_fast64_t = __int_fast64_t;
pub type uint_fast8_t = __uint_fast8_t;
pub type uint_fast16_t = __uint_fast16_t;
pub type uint_fast32_t = __uint_fast32_t;
pub type uint_fast64_t = __uint_fast64_t;
extern "C" {
    #[link_name = "cold"]
    pub static mut cold: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "suspend_blocked"]
    pub static mut suspend_blocked: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "rebooting"]
    pub static mut rebooting: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "panicstr"]
    pub static mut panicstr: *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "version"]
    pub static mut version: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "compiler_version"]
    pub static mut compiler_version: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "copyright"]
    pub static mut copyright: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "kstack_pages"]
    pub static mut kstack_pages: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "pagesizes"]
    pub static mut pagesizes: [u_long; 0usize];
}
extern "C" {
    #[link_name = "physmem"]
    pub static mut physmem: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "realmem"]
    pub static mut realmem: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "rootdevnames"]
    pub static mut rootdevnames: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    #[link_name = "boothowto"]
    pub static mut boothowto: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "bootverbose"]
    pub static mut bootverbose: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "maxusers"]
    pub static mut maxusers: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "ngroups_max"]
    pub static mut ngroups_max: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "vm_guest"]
    pub static mut vm_guest: ::std::os::raw::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VM_GUEST {
    VM_GUEST_NO = 0,
    VM_GUEST_VM = 1,
    VM_GUEST_XEN = 2,
    VM_GUEST_HV = 3,
    VM_GUEST_VMWARE = 4,
    VM_GUEST_KVM = 5,
    VM_GUEST_BHYVE = 6,
    VM_LAST = 7,
}
extern "C" {
    #[link_name = "osreldate"]
    pub static mut osreldate: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "envmode"]
    pub static mut envmode: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "hintmode"]
    pub static mut hintmode: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "dynamic_kenv"]
    pub static mut dynamic_kenv: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mtx {
    pub lock_object: lock_object,
    pub mtx_lock: usize,
}
#[test]
fn bindgen_test_layout_mtx() {
    assert_eq!(::std::mem::size_of::<mtx>() , 32usize , concat ! (
               "Size of: " , stringify ! ( mtx ) ));
    assert_eq! (::std::mem::align_of::<mtx>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( mtx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mtx ) ) . lock_object as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mtx ) , "::" ,
                stringify ! ( lock_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mtx ) ) . mtx_lock as * const _ as usize
                } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mtx ) , "::" ,
                stringify ! ( mtx_lock ) ));
}
impl Clone for mtx {
    fn clone(&self) -> Self { *self }
}
impl Default for mtx {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    #[link_name = "kenv_lock"]
    pub static mut kenv_lock: mtx;
}
extern "C" {
    #[link_name = "kern_envp"]
    pub static mut kern_envp: *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "static_env"]
    pub static mut static_env: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "static_hints"]
    pub static mut static_hints: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "kenvp"]
    pub static mut kenvp: *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "zero_region"]
    pub static mut zero_region: *const ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "unmapped_buf_allowed"]
    pub static mut unmapped_buf_allowed: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct malloc_type {
    pub ks_next: *mut malloc_type,
    pub ks_magic: u_long,
    pub ks_shortdesc: *const ::std::os::raw::c_char,
    pub ks_handle: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_malloc_type() {
    assert_eq!(::std::mem::size_of::<malloc_type>() , 32usize , concat ! (
               "Size of: " , stringify ! ( malloc_type ) ));
    assert_eq! (::std::mem::align_of::<malloc_type>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( malloc_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type ) ) . ks_next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type ) , "::" ,
                stringify ! ( ks_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type ) ) . ks_magic as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type ) , "::" ,
                stringify ! ( ks_magic ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type ) ) . ks_shortdesc as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type ) , "::" ,
                stringify ! ( ks_shortdesc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type ) ) . ks_handle as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type ) , "::" ,
                stringify ! ( ks_handle ) ));
}
impl Clone for malloc_type {
    fn clone(&self) -> Self { *self }
}
impl Default for malloc_type {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct proc_ {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tty {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ucred {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uio {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _jmp_buf {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct trapframe {
    pub tf_rdi: register_t,
    pub tf_rsi: register_t,
    pub tf_rdx: register_t,
    pub tf_rcx: register_t,
    pub tf_r8: register_t,
    pub tf_r9: register_t,
    pub tf_rax: register_t,
    pub tf_rbx: register_t,
    pub tf_rbp: register_t,
    pub tf_r10: register_t,
    pub tf_r11: register_t,
    pub tf_r12: register_t,
    pub tf_r13: register_t,
    pub tf_r14: register_t,
    pub tf_r15: register_t,
    pub tf_trapno: u32,
    pub tf_fs: u16,
    pub tf_gs: u16,
    pub tf_addr: register_t,
    pub tf_flags: u32,
    pub tf_es: u16,
    pub tf_ds: u16,
    pub tf_err: register_t,
    pub tf_rip: register_t,
    pub tf_cs: register_t,
    pub tf_rflags: register_t,
    pub tf_rsp: register_t,
    pub tf_ss: register_t,
}
#[test]
fn bindgen_test_layout_trapframe() {
    assert_eq!(::std::mem::size_of::<trapframe>() , 192usize , concat ! (
               "Size of: " , stringify ! ( trapframe ) ));
    assert_eq! (::std::mem::align_of::<trapframe>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( trapframe ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rdi as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rdi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rsi as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rsi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rdx as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rdx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rcx as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rcx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r8 as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r9 as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rax as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rax ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rbx as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rbx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rbp as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rbp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r10 as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r10 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r11 as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r11 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r12 as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r12 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r13 as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r13 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r14 as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r14 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r15 as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r15 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_trapno as * const _ as
                usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_trapno ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_fs as * const _ as
                usize } , 124usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_fs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_gs as * const _ as
                usize } , 126usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_gs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_addr as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_flags as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_es as * const _ as
                usize } , 140usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_es ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_ds as * const _ as
                usize } , 142usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_ds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_err as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_err ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rip as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rip ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_cs as * const _ as
                usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_cs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rflags as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rflags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rsp as * const _ as
                usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rsp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_ss as * const _ as
                usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_ss ) ));
}
impl Clone for trapframe {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eventtimer {
    _unused: [u8; 0],
}
extern "C" {
    pub fn setjmp(arg1: *mut _jmp_buf) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn longjmp(arg1: *mut _jmp_buf, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn dumpstatus(addr: vm_offset_t, count: off_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nullop() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn eopnotsupp() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ureadc(arg1: ::std::os::raw::c_int, arg2: *mut uio)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn hashdestroy(arg1: *mut ::std::os::raw::c_void,
                       arg2: *mut malloc_type, arg3: u_long);
}
extern "C" {
    pub fn hashinit(count: ::std::os::raw::c_int, type_: *mut malloc_type,
                    hashmask: *mut u_long) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn hashinit_flags(count: ::std::os::raw::c_int,
                          type_: *mut malloc_type, hashmask: *mut u_long,
                          flags: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn phashinit(count: ::std::os::raw::c_int, type_: *mut malloc_type,
                     nentries: *mut u_long) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn phashinit_flags(count: ::std::os::raw::c_int,
                           type_: *mut malloc_type, nentries: *mut u_long,
                           flags: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn g_waitidle();
}
extern "C" {
    pub fn panic(arg1: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn vpanic(arg1: *const ::std::os::raw::c_char,
                  arg2: *mut __va_list_tag);
}
extern "C" {
    pub fn cpu_boot(arg1: ::std::os::raw::c_int);
}
extern "C" {
    pub fn cpu_flush_dcache(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn cpu_rootconf();
}
extern "C" {
    pub fn critical_enter();
}
extern "C" {
    pub fn critical_exit();
}
extern "C" {
    pub fn init_param1();
}
extern "C" {
    pub fn init_param2(physpages: ::std::os::raw::c_long);
}
extern "C" {
    pub fn init_static_kenv(arg1: *mut ::std::os::raw::c_char, arg2: usize);
}
extern "C" {
    pub fn tablefull(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn kvprintf(arg1: *const ::std::os::raw::c_char,
                    arg2:
                        ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                       ::std::os::raw::c_int,
                                                                   arg2:
                                                                       *mut ::std::os::raw::c_void)>,
                    arg3: *mut ::std::os::raw::c_void,
                    arg4: ::std::os::raw::c_int, arg5: *mut __va_list_tag)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn log(arg1: ::std::os::raw::c_int,
               arg2: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn log_console(arg1: *mut uio);
}
extern "C" {
    pub fn vlog(arg1: ::std::os::raw::c_int,
                arg2: *const ::std::os::raw::c_char,
                arg3: *mut __va_list_tag);
}
extern "C" {
    pub fn asprintf(ret: *mut *mut ::std::os::raw::c_char,
                    mtp: *mut malloc_type,
                    format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(arg1: *mut ::std::os::raw::c_char, arg2: usize,
                    arg3: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(buf: *mut ::std::os::raw::c_char,
                   arg1: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uprintf(arg1: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(arg1: *const ::std::os::raw::c_char,
                   arg2: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(ret: *mut *mut ::std::os::raw::c_char,
                     mtp: *mut malloc_type,
                     format: *const ::std::os::raw::c_char,
                     ap: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(arg1: *mut ::std::os::raw::c_char, arg2: usize,
                     arg3: *const ::std::os::raw::c_char,
                     arg4: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnrprintf(arg1: *mut ::std::os::raw::c_char, arg2: usize,
                      arg3: ::std::os::raw::c_int,
                      arg4: *const ::std::os::raw::c_char,
                      arg5: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(buf: *mut ::std::os::raw::c_char,
                    arg1: *const ::std::os::raw::c_char,
                    arg2: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ttyprintf(arg1: *mut tty, arg2: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(arg1: *const ::std::os::raw::c_char,
                  arg2: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(arg1: *const ::std::os::raw::c_char,
                   arg2: *const ::std::os::raw::c_char,
                   arg3: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strtol(arg1: *const ::std::os::raw::c_char,
                  arg2: *mut *mut ::std::os::raw::c_char,
                  arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(arg1: *const ::std::os::raw::c_char,
                   arg2: *mut *mut ::std::os::raw::c_char,
                   arg3: ::std::os::raw::c_int) -> u_long;
}
extern "C" {
    pub fn strtoq(arg1: *const ::std::os::raw::c_char,
                  arg2: *mut *mut ::std::os::raw::c_char,
                  arg3: ::std::os::raw::c_int) -> quad_t;
}
extern "C" {
    pub fn strtouq(arg1: *const ::std::os::raw::c_char,
                   arg2: *mut *mut ::std::os::raw::c_char,
                   arg3: ::std::os::raw::c_int) -> u_quad_t;
}
extern "C" {
    pub fn tprintf(p: *mut proc_, pri: ::std::os::raw::c_int,
                   arg1: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn vtprintf(arg1: *mut proc_, arg2: ::std::os::raw::c_int,
                    arg3: *const ::std::os::raw::c_char,
                    arg4: *mut __va_list_tag);
}
extern "C" {
    pub fn hexdump(ptr: *const ::std::os::raw::c_void,
                   length: ::std::os::raw::c_int,
                   hdr: *const ::std::os::raw::c_char,
                   flags: ::std::os::raw::c_int);
}
extern "C" {
    pub fn bcopy(from: *const ::std::os::raw::c_void,
                 to: *mut ::std::os::raw::c_void, len: usize);
}
extern "C" {
    pub fn bzero(buf: *mut ::std::os::raw::c_void, len: usize);
}
extern "C" {
    pub fn explicit_bzero(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn memcpy(to: *mut ::std::os::raw::c_void,
                  from: *const ::std::os::raw::c_void, len: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(dest: *mut ::std::os::raw::c_void,
                   src: *const ::std::os::raw::c_void, n: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn copystr(kfaddr: *const ::std::os::raw::c_void,
                   kdaddr: *mut ::std::os::raw::c_void, len: usize,
                   lencopied: *mut usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn copyinstr(udaddr: *const ::std::os::raw::c_void,
                     kaddr: *mut ::std::os::raw::c_void, len: usize,
                     lencopied: *mut usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn copyin(udaddr: *const ::std::os::raw::c_void,
                  kaddr: *mut ::std::os::raw::c_void, len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn copyin_nofault(udaddr: *const ::std::os::raw::c_void,
                          kaddr: *mut ::std::os::raw::c_void, len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn copyout(kaddr: *const ::std::os::raw::c_void,
                   udaddr: *mut ::std::os::raw::c_void, len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn copyout_nofault(kaddr: *const ::std::os::raw::c_void,
                           udaddr: *mut ::std::os::raw::c_void, len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fubyte(base: *const ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fuword(base: *const ::std::os::raw::c_void)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fuword16(base: *const ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fuword32(base: *const ::std::os::raw::c_void) -> i32;
}
extern "C" {
    pub fn fuword64(base: *const ::std::os::raw::c_void) -> i64;
}
extern "C" {
    pub fn fueword(base: *const ::std::os::raw::c_void,
                   val: *mut ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fueword32(base: *const ::std::os::raw::c_void, val: *mut i32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fueword64(base: *const ::std::os::raw::c_void, val: *mut i64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn subyte(base: *mut ::std::os::raw::c_void,
                  byte: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn suword(base: *mut ::std::os::raw::c_void,
                  word: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn suword16(base: *mut ::std::os::raw::c_void,
                    word: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn suword32(base: *mut ::std::os::raw::c_void, word: i32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn suword64(base: *mut ::std::os::raw::c_void, word: i64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn casuword32(base: *mut u32, oldval: u32, newval: u32) -> u32;
}
extern "C" {
    pub fn casuword(p: *mut u_long, oldval: u_long, newval: u_long) -> u_long;
}
extern "C" {
    pub fn casueword32(base: *mut u32, oldval: u32, oldvalp: *mut u32,
                       newval: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn casueword(p: *mut u_long, oldval: u_long, oldvalp: *mut u_long,
                     newval: u_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realitexpire(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn sysbeep(hertz: ::std::os::raw::c_int,
                   period: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn hardclock(usermode: ::std::os::raw::c_int, pc: uintfptr_t);
}
extern "C" {
    pub fn hardclock_cnt(cnt: ::std::os::raw::c_int,
                         usermode: ::std::os::raw::c_int);
}
extern "C" {
    pub fn hardclock_cpu(usermode: ::std::os::raw::c_int);
}
extern "C" {
    pub fn hardclock_sync(cpu: ::std::os::raw::c_int);
}
extern "C" {
    pub fn softclock(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn statclock(usermode: ::std::os::raw::c_int);
}
extern "C" {
    pub fn statclock_cnt(cnt: ::std::os::raw::c_int,
                         usermode: ::std::os::raw::c_int);
}
extern "C" {
    pub fn profclock(usermode: ::std::os::raw::c_int, pc: uintfptr_t);
}
extern "C" {
    pub fn profclock_cnt(cnt: ::std::os::raw::c_int,
                         usermode: ::std::os::raw::c_int, pc: uintfptr_t);
}
extern "C" {
    pub fn hardclockintr() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn startprofclock(arg1: *mut proc_);
}
extern "C" {
    pub fn stopprofclock(arg1: *mut proc_);
}
extern "C" {
    pub fn cpu_startprofclock();
}
extern "C" {
    pub fn cpu_stopprofclock();
}
extern "C" {
    pub fn cpu_idleclock() -> sbintime_t;
}
extern "C" {
    pub fn cpu_activeclock();
}
extern "C" {
    pub fn cpu_new_callout(cpu: ::std::os::raw::c_int, bt: sbintime_t,
                           bt_opt: sbintime_t);
}
extern "C" {
    pub fn cpu_et_frequency(et: *mut eventtimer, newfreq: u64);
}
extern "C" {
    #[link_name = "cpu_disable_c2_sleep"]
    pub static mut cpu_disable_c2_sleep: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "cpu_disable_c3_sleep"]
    pub static mut cpu_disable_c3_sleep: ::std::os::raw::c_int;
}
extern "C" {
    pub fn kern_getenv(name: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn freeenv(env: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn getenv_int(name: *const ::std::os::raw::c_char,
                      data: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getenv_uint(name: *const ::std::os::raw::c_char,
                       data: *mut ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getenv_long(name: *const ::std::os::raw::c_char,
                       data: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getenv_ulong(name: *const ::std::os::raw::c_char,
                        data: *mut ::std::os::raw::c_ulong)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getenv_string(name: *const ::std::os::raw::c_char,
                         data: *mut ::std::os::raw::c_char,
                         size: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getenv_int64(name: *const ::std::os::raw::c_char, data: *mut i64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getenv_uint64(name: *const ::std::os::raw::c_char, data: *mut u64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getenv_quad(name: *const ::std::os::raw::c_char, data: *mut quad_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kern_setenv(name: *const ::std::os::raw::c_char,
                       value: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kern_unsetenv(name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn testenv(name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
pub type cpu_tick_f = ::std::option::Option<unsafe extern "C" fn() -> u64>;
extern "C" {
    pub fn set_cputicker(func: cpu_tick_f, freq: u64,
                         var: ::std::os::raw::c_uint);
}
extern "C" {
    #[link_name = "cpu_ticks"]
    pub static mut cpu_ticks: cpu_tick_f;
}
extern "C" {
    pub fn cpu_tickrate() -> u64;
}
extern "C" {
    pub fn cputick2usec(tick: u64) -> u64;
}
extern "C" {
    #[link_name = "bcd2bin_data"]
    pub static mut bcd2bin_data: [u_char; 0usize];
}
extern "C" {
    #[link_name = "bin2bcd_data"]
    pub static mut bin2bcd_data: [u_char; 0usize];
}
extern "C" {
    #[link_name = "hex2ascii_data"]
    pub static mut hex2ascii_data: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "arc4rand_iniseed_state"]
    pub static mut arc4rand_iniseed_state: ::std::os::raw::c_int;
}
extern "C" {
    pub fn arc4random() -> u32;
}
extern "C" {
    pub fn arc4random_buf(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn arc4rand(arg1: *mut ::std::os::raw::c_void, arg2: u_int,
                    arg3: ::std::os::raw::c_int);
}
extern "C" {
    pub fn bcmp(arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void, arg3: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timingsafe_bcmp(arg1: *const ::std::os::raw::c_void,
                           arg2: *const ::std::os::raw::c_void, arg3: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bsearch(arg1: *const ::std::os::raw::c_void,
                   arg2: *const ::std::os::raw::c_void, arg3: usize,
                   arg4: usize,
                   arg5:
                       ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                      *const ::std::os::raw::c_void,
                                                                  arg2:
                                                                      *const ::std::os::raw::c_void)
                                                 -> ::std::os::raw::c_int>)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn fnmatch(arg1: *const ::std::os::raw::c_char,
                   arg2: *const ::std::os::raw::c_char,
                   arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn locc(arg1: ::std::os::raw::c_int,
                arg2: *mut ::std::os::raw::c_char, arg3: u_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(s: *const ::std::os::raw::c_void, c: ::std::os::raw::c_int,
                  n: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcchr(s: *const ::std::os::raw::c_void, c: ::std::os::raw::c_int,
                   n: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(b1: *const ::std::os::raw::c_void,
                  b2: *const ::std::os::raw::c_void, len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memmem(l: *const ::std::os::raw::c_void, l_len: usize,
                  s: *const ::std::os::raw::c_void, s_len: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(base: *mut ::std::os::raw::c_void, nmemb: usize, size: usize,
                 compar:
                     ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                    *const ::std::os::raw::c_void,
                                                                arg2:
                                                                    *const ::std::os::raw::c_void)
                                               -> ::std::os::raw::c_int>);
}
extern "C" {
    pub fn qsort_r(base: *mut ::std::os::raw::c_void, nmemb: usize,
                   size: usize, thunk: *mut ::std::os::raw::c_void,
                   compar:
                       ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                      *mut ::std::os::raw::c_void,
                                                                  arg2:
                                                                      *const ::std::os::raw::c_void,
                                                                  arg3:
                                                                      *const ::std::os::raw::c_void)
                                                 -> ::std::os::raw::c_int>);
}
extern "C" {
    pub fn random() -> u_long;
}
extern "C" {
    pub fn scanc(arg1: u_int, arg2: *const u_char, arg3: *const u_char,
                 arg4: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom(arg1: u_long);
}
extern "C" {
    pub fn strcasecmp(arg1: *const ::std::os::raw::c_char,
                      arg2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcat(arg1: *mut ::std::os::raw::c_char,
                  arg2: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(arg1: *const ::std::os::raw::c_char,
                  arg2: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(arg1: *const ::std::os::raw::c_char,
                  arg2: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcpy(arg1: *mut ::std::os::raw::c_char,
                  arg2: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(arg1: *const ::std::os::raw::c_char,
                   arg2: *const ::std::os::raw::c_char) -> usize;
}
extern "C" {
    pub fn strdup(arg1: *const ::std::os::raw::c_char, arg2: *mut malloc_type)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(arg1: *mut ::std::os::raw::c_char,
                   arg2: *const ::std::os::raw::c_char, arg3: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(arg1: *const ::std::os::raw::c_char, arg2: usize,
                   arg3: *mut malloc_type) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlcat(arg1: *mut ::std::os::raw::c_char,
                   arg2: *const ::std::os::raw::c_char, arg3: usize) -> usize;
}
extern "C" {
    pub fn strlcpy(arg1: *mut ::std::os::raw::c_char,
                   arg2: *const ::std::os::raw::c_char, arg3: usize) -> usize;
}
extern "C" {
    pub fn strlen(arg1: *const ::std::os::raw::c_char) -> usize;
}
extern "C" {
    pub fn strncasecmp(arg1: *const ::std::os::raw::c_char,
                       arg2: *const ::std::os::raw::c_char, arg3: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(arg1: *const ::std::os::raw::c_char,
                   arg2: *const ::std::os::raw::c_char, arg3: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncpy(arg1: *mut ::std::os::raw::c_char,
                   arg2: *const ::std::os::raw::c_char, arg3: usize)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnlen(arg1: *const ::std::os::raw::c_char, arg2: usize) -> usize;
}
extern "C" {
    pub fn strrchr(arg1: *const ::std::os::raw::c_char,
                   arg2: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsep(arg1: *mut *mut ::std::os::raw::c_char,
                  delim: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strspn(arg1: *const ::std::os::raw::c_char,
                  arg2: *const ::std::os::raw::c_char) -> usize;
}
extern "C" {
    pub fn strstr(arg1: *const ::std::os::raw::c_char,
                  arg2: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strvalid(arg1: *const ::std::os::raw::c_char, arg2: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "crc32_tab"]
    pub static mut crc32_tab: [u32; 0usize];
}
extern "C" {
    pub fn calculate_crc32c(crc32c: u32,
                            buffer: *const ::std::os::raw::c_uchar,
                            length: ::std::os::raw::c_uint) -> u32;
}
extern "C" {
    pub fn sse42_crc32c(arg1: u32, arg2: *const ::std::os::raw::c_uchar,
                        arg3: ::std::os::raw::c_uint) -> u32;
}
extern "C" {
    pub fn consinit();
}
extern "C" {
    pub fn cpu_initclocks();
}
extern "C" {
    pub fn cpu_initclocks_bsp();
}
extern "C" {
    pub fn cpu_initclocks_ap();
}
extern "C" {
    pub fn usrinfoinit();
}
extern "C" {
    pub fn kern_reboot(arg1: ::std::os::raw::c_int);
}
extern "C" {
    pub fn shutdown_nice(arg1: ::std::os::raw::c_int);
}
pub type timeout_t =
    ::std::option::Option<unsafe extern "C" fn(arg1:
                                                   *mut ::std::os::raw::c_void)>;
extern "C" {
    pub fn callout_handle_init(arg1: *mut callout_handle);
}
extern "C" {
    pub fn timeout(arg1: timeout_t, arg2: *mut ::std::os::raw::c_void,
                   arg3: ::std::os::raw::c_int) -> callout_handle;
}
extern "C" {
    pub fn untimeout(arg1: timeout_t, arg2: *mut ::std::os::raw::c_void,
                     arg3: callout_handle);
}
extern "C" {
    pub fn _sleep(chan: *mut ::std::os::raw::c_void, lock: *mut lock_object,
                  pri: ::std::os::raw::c_int,
                  wmesg: *const ::std::os::raw::c_char, sbt: sbintime_t,
                  pr: sbintime_t, flags: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn msleep_spin_sbt(chan: *mut ::std::os::raw::c_void, mtx: *mut mtx,
                           wmesg: *const ::std::os::raw::c_char,
                           sbt: sbintime_t, pr: sbintime_t,
                           flags: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pause_sbt(wmesg: *const ::std::os::raw::c_char, sbt: sbintime_t,
                     pr: sbintime_t, flags: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wakeup(chan: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn wakeup_one(chan: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cdev {
    _unused: [u8; 0],
}
extern "C" {
    pub fn dev2udev(x: *mut cdev) -> dev_t;
}
extern "C" {
    pub fn devtoname(cdev: *mut cdev) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn devfs_iosize_max() -> usize;
}
extern "C" {
    pub fn iosize_max() -> usize;
}
extern "C" {
    pub fn poll_no_poll(events: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn DELAY(usec: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct root_hold_token {
    _unused: [u8; 0],
}
extern "C" {
    pub fn root_mount_hold(identifier: *const ::std::os::raw::c_char)
     -> *mut root_hold_token;
}
extern "C" {
    pub fn root_mount_rel(h: *mut root_hold_token);
}
extern "C" {
    pub fn root_mounted() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct unrhdr {
    _unused: [u8; 0],
}
extern "C" {
    pub fn new_unrhdr(low: ::std::os::raw::c_int, high: ::std::os::raw::c_int,
                      mutex: *mut mtx) -> *mut unrhdr;
}
extern "C" {
    pub fn init_unrhdr(uh: *mut unrhdr, low: ::std::os::raw::c_int,
                       high: ::std::os::raw::c_int, mutex: *mut mtx);
}
extern "C" {
    pub fn delete_unrhdr(uh: *mut unrhdr);
}
extern "C" {
    pub fn clear_unrhdr(uh: *mut unrhdr);
}
extern "C" {
    pub fn clean_unrhdr(uh: *mut unrhdr);
}
extern "C" {
    pub fn clean_unrhdrl(uh: *mut unrhdr);
}
extern "C" {
    pub fn alloc_unr(uh: *mut unrhdr) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn alloc_unr_specific(uh: *mut unrhdr, item: u_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn alloc_unrl(uh: *mut unrhdr) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn free_unr(uh: *mut unrhdr, item: u_int);
}
extern "C" {
    pub fn intr_prof_stack_use(td: *mut thread, frame: *mut trapframe);
}
extern "C" {
    pub fn counted_warning(counter: *mut ::std::os::raw::c_uint,
                           msg: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    assert_eq!(::std::mem::size_of::<timezone>() , 8usize , concat ! (
               "Size of: " , stringify ! ( timezone ) ));
    assert_eq! (::std::mem::align_of::<timezone>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( timezone ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timezone ) ) . tz_minuteswest as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timezone ) , "::" ,
                stringify ! ( tz_minuteswest ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timezone ) ) . tz_dsttime as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( timezone ) , "::" ,
                stringify ! ( tz_dsttime ) ));
}
impl Clone for timezone {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct bintime {
    pub sec: time_t,
    pub frac: u64,
}
#[test]
fn bindgen_test_layout_bintime() {
    assert_eq!(::std::mem::size_of::<bintime>() , 16usize , concat ! (
               "Size of: " , stringify ! ( bintime ) ));
    assert_eq! (::std::mem::align_of::<bintime>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( bintime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const bintime ) ) . sec as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( bintime ) , "::" ,
                stringify ! ( sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const bintime ) ) . frac as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( bintime ) , "::" ,
                stringify ! ( frac ) ));
}
impl Clone for bintime {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    assert_eq!(::std::mem::size_of::<itimerval>() , 32usize , concat ! (
               "Size of: " , stringify ! ( itimerval ) ));
    assert_eq! (::std::mem::align_of::<itimerval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( itimerval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerval ) ) . it_interval as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerval ) , "::" ,
                stringify ! ( it_interval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerval ) ) . it_value as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerval ) , "::" ,
                stringify ! ( it_value ) ));
}
impl Clone for itimerval {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct clockinfo {
    pub hz: ::std::os::raw::c_int,
    pub tick: ::std::os::raw::c_int,
    pub spare: ::std::os::raw::c_int,
    pub stathz: ::std::os::raw::c_int,
    pub profhz: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_clockinfo() {
    assert_eq!(::std::mem::size_of::<clockinfo>() , 20usize , concat ! (
               "Size of: " , stringify ! ( clockinfo ) ));
    assert_eq! (::std::mem::align_of::<clockinfo>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( clockinfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . hz as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( hz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . tick as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( tick ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . spare as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( spare ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . stathz as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( stathz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . profhz as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( profhz ) ));
}
impl Clone for clockinfo {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn inittodr(base: time_t);
}
extern "C" {
    pub fn resettodr();
}
extern "C" {
    #[link_name = "time_second"]
    pub static mut time_second: time_t;
}
extern "C" {
    #[link_name = "time_uptime"]
    pub static mut time_uptime: time_t;
}
extern "C" {
    #[link_name = "tc_tick_bt"]
    pub static mut tc_tick_bt: bintime;
}
extern "C" {
    #[link_name = "tc_tick_sbt"]
    pub static mut tc_tick_sbt: sbintime_t;
}
extern "C" {
    #[link_name = "tick_bt"]
    pub static mut tick_bt: bintime;
}
extern "C" {
    #[link_name = "tick_sbt"]
    pub static mut tick_sbt: sbintime_t;
}
extern "C" {
    #[link_name = "tc_precexp"]
    pub static mut tc_precexp: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "tc_timepercentage"]
    pub static mut tc_timepercentage: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "bt_timethreshold"]
    pub static mut bt_timethreshold: bintime;
}
extern "C" {
    #[link_name = "bt_tickthreshold"]
    pub static mut bt_tickthreshold: bintime;
}
extern "C" {
    #[link_name = "sbt_timethreshold"]
    pub static mut sbt_timethreshold: sbintime_t;
}
extern "C" {
    #[link_name = "sbt_tickthreshold"]
    pub static mut sbt_tickthreshold: sbintime_t;
}
extern "C" {
    #[link_name = "rtc_generation"]
    pub static mut rtc_generation: ::std::os::raw::c_int;
}
extern "C" {
    pub fn binuptime(bt: *mut bintime);
}
extern "C" {
    pub fn nanouptime(tsp: *mut timespec);
}
extern "C" {
    pub fn microuptime(tvp: *mut timeval);
}
extern "C" {
    pub fn bintime(bt: *mut bintime);
}
extern "C" {
    pub fn nanotime(tsp: *mut timespec);
}
extern "C" {
    pub fn microtime(tvp: *mut timeval);
}
extern "C" {
    pub fn getbinuptime(bt: *mut bintime);
}
extern "C" {
    pub fn getnanouptime(tsp: *mut timespec);
}
extern "C" {
    pub fn getmicrouptime(tvp: *mut timeval);
}
extern "C" {
    pub fn getbintime(bt: *mut bintime);
}
extern "C" {
    pub fn getnanotime(tsp: *mut timespec);
}
extern "C" {
    pub fn getmicrotime(tvp: *mut timeval);
}
extern "C" {
    pub fn getboottime(boottime: *mut timeval);
}
extern "C" {
    pub fn getboottimebin(boottimebin: *mut bintime);
}
extern "C" {
    pub fn itimerdecr(itp: *mut itimerval, usec: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn itimerfix(tv: *mut timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ppsratecheck(arg1: *mut timeval, arg2: *mut ::std::os::raw::c_int,
                        arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ratecheck(arg1: *mut timeval, arg2: *const timeval)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timevaladd(t1: *mut timeval, t2: *const timeval);
}
extern "C" {
    pub fn timevalsub(t1: *mut timeval, t2: *const timeval);
}
extern "C" {
    pub fn tvtohz(tv: *mut timeval) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct priority {
    pub pri_class: u_char,
    pub pri_level: u_char,
    pub pri_native: u_char,
    pub pri_user: u_char,
}
#[test]
fn bindgen_test_layout_priority() {
    assert_eq!(::std::mem::size_of::<priority>() , 4usize , concat ! (
               "Size of: " , stringify ! ( priority ) ));
    assert_eq! (::std::mem::align_of::<priority>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const priority ) ) . pri_class as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( priority ) , "::" ,
                stringify ! ( pri_class ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const priority ) ) . pri_level as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( priority ) , "::" ,
                stringify ! ( pri_level ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const priority ) ) . pri_native as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( priority ) , "::" ,
                stringify ! ( pri_native ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const priority ) ) . pri_user as * const _ as
                usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( priority ) , "::" ,
                stringify ! ( pri_user ) ));
}
impl Clone for priority {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn htonl(arg1: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn htons(arg1: __uint16_t) -> __uint16_t;
}
extern "C" {
    pub fn ntohl(arg1: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn ntohs(arg1: __uint16_t) -> __uint16_t;
}
#[repr(C)]
#[derive(Copy)]
pub struct mtx_padalign {
    pub lock_object: lock_object,
    pub mtx_lock: usize,
    pub __bindgen_padding_0: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_mtx_padalign() {
    assert_eq!(::std::mem::size_of::<mtx_padalign>() , 64usize , concat ! (
               "Size of: " , stringify ! ( mtx_padalign ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mtx_padalign ) ) . lock_object as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mtx_padalign ) , "::" ,
                stringify ! ( lock_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mtx_padalign ) ) . mtx_lock as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mtx_padalign ) , "::" ,
                stringify ! ( mtx_lock ) ));
}
impl Clone for mtx_padalign {
    fn clone(&self) -> Self { *self }
}
impl Default for mtx_padalign {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for mtx_padalign {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "mtx_padalign {{ lock_object: {:?}, mtx_lock: {:?} }}" ,
               self . lock_object , self . mtx_lock)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct malloc_type_stats {
    pub mts_memalloced: u64,
    pub mts_memfreed: u64,
    pub mts_numallocs: u64,
    pub mts_numfrees: u64,
    pub mts_size: u64,
    pub _mts_reserved1: u64,
    pub _mts_reserved2: u64,
    pub _mts_reserved3: u64,
}
#[test]
fn bindgen_test_layout_malloc_type_stats() {
    assert_eq!(::std::mem::size_of::<malloc_type_stats>() , 64usize , concat !
               ( "Size of: " , stringify ! ( malloc_type_stats ) ));
    assert_eq! (::std::mem::align_of::<malloc_type_stats>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( malloc_type_stats ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stats ) ) . mts_memalloced as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_stats ) ,
                "::" , stringify ! ( mts_memalloced ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stats ) ) . mts_memfreed as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_stats ) ,
                "::" , stringify ! ( mts_memfreed ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stats ) ) . mts_numallocs as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_stats ) ,
                "::" , stringify ! ( mts_numallocs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stats ) ) . mts_numfrees as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_stats ) ,
                "::" , stringify ! ( mts_numfrees ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stats ) ) . mts_size as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_stats ) ,
                "::" , stringify ! ( mts_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stats ) ) . _mts_reserved1 as
                * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_stats ) ,
                "::" , stringify ! ( _mts_reserved1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stats ) ) . _mts_reserved2 as
                * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_stats ) ,
                "::" , stringify ! ( _mts_reserved2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stats ) ) . _mts_reserved3 as
                * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_stats ) ,
                "::" , stringify ! ( _mts_reserved3 ) ));
}
impl Clone for malloc_type_stats {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct malloc_type_internal {
    pub mti_probes: [u32; 2usize],
    pub mti_zone: u_char,
    pub mti_stats: [malloc_type_stats; 256usize],
}
#[test]
fn bindgen_test_layout_malloc_type_internal() {
    assert_eq!(::std::mem::size_of::<malloc_type_internal>() , 16400usize ,
               concat ! ( "Size of: " , stringify ! ( malloc_type_internal )
               ));
    assert_eq! (::std::mem::align_of::<malloc_type_internal>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( malloc_type_internal ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_internal ) ) . mti_probes as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_internal )
                , "::" , stringify ! ( mti_probes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_internal ) ) . mti_zone as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_internal )
                , "::" , stringify ! ( mti_zone ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_internal ) ) . mti_stats as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_internal )
                , "::" , stringify ! ( mti_stats ) ));
}
impl Clone for malloc_type_internal {
    fn clone(&self) -> Self { *self }
}
impl Default for malloc_type_internal {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for malloc_type_internal {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "malloc_type_internal {{ mti_probes: {:?}, mti_zone: {:?}, mti_stats: [{}] }}"
               , self . mti_probes , self . mti_zone , self . mti_stats . iter
               (  ) . enumerate (  ) . map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ))
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct malloc_type_stream_header {
    pub mtsh_version: u32,
    pub mtsh_maxcpus: u32,
    pub mtsh_count: u32,
    pub _mtsh_pad: u32,
}
#[test]
fn bindgen_test_layout_malloc_type_stream_header() {
    assert_eq!(::std::mem::size_of::<malloc_type_stream_header>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( malloc_type_stream_header ) ));
    assert_eq! (::std::mem::align_of::<malloc_type_stream_header>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( malloc_type_stream_header )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stream_header ) ) .
                mtsh_version as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                malloc_type_stream_header ) , "::" , stringify ! (
                mtsh_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stream_header ) ) .
                mtsh_maxcpus as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                malloc_type_stream_header ) , "::" , stringify ! (
                mtsh_maxcpus ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stream_header ) ) .
                mtsh_count as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                malloc_type_stream_header ) , "::" , stringify ! ( mtsh_count
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_stream_header ) ) . _mtsh_pad
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                malloc_type_stream_header ) , "::" , stringify ! ( _mtsh_pad )
                ));
}
impl Clone for malloc_type_stream_header {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct malloc_type_header {
    pub mth_name: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_malloc_type_header() {
    assert_eq!(::std::mem::size_of::<malloc_type_header>() , 32usize , concat
               ! ( "Size of: " , stringify ! ( malloc_type_header ) ));
    assert_eq! (::std::mem::align_of::<malloc_type_header>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( malloc_type_header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type_header ) ) . mth_name as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type_header ) ,
                "::" , stringify ! ( mth_name ) ));
}
impl Clone for malloc_type_header {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "M_CACHE"]
    pub static mut M_CACHE: [malloc_type; 1usize];
}
extern "C" {
    #[link_name = "M_DEVBUF"]
    pub static mut M_DEVBUF: [malloc_type; 1usize];
}
extern "C" {
    #[link_name = "M_TEMP"]
    pub static mut M_TEMP: [malloc_type; 1usize];
}
extern "C" {
    #[link_name = "M_IOV"]
    pub static mut M_IOV: [malloc_type; 1usize];
}
extern "C" {
    #[link_name = "malloc_mtx"]
    pub static mut malloc_mtx: mtx;
}
pub type malloc_type_list_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut malloc_type,
                                               arg2:
                                                   *mut ::std::os::raw::c_void)>;
extern "C" {
    pub fn contigfree(addr: *mut ::std::os::raw::c_void,
                      size: ::std::os::raw::c_ulong, type_: *mut malloc_type);
}
extern "C" {
    pub fn contigmalloc(size: ::std::os::raw::c_ulong,
                        type_: *mut malloc_type, flags: ::std::os::raw::c_int,
                        low: vm_paddr_t, high: vm_paddr_t,
                        alignment: ::std::os::raw::c_ulong,
                        boundary: vm_paddr_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn contigmalloc_domain(size: ::std::os::raw::c_ulong,
                               type_: *mut malloc_type,
                               domain: ::std::os::raw::c_int,
                               flags: ::std::os::raw::c_int, low: vm_paddr_t,
                               high: vm_paddr_t,
                               alignment: ::std::os::raw::c_ulong,
                               boundary: vm_paddr_t)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(addr: *mut ::std::os::raw::c_void, type_: *mut malloc_type);
}
extern "C" {
    pub fn free_domain(addr: *mut ::std::os::raw::c_void,
                       type_: *mut malloc_type);
}
extern "C" {
    pub fn malloc(size: ::std::os::raw::c_ulong, type_: *mut malloc_type,
                  flags: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn malloc_domain(size: ::std::os::raw::c_ulong,
                         type_: *mut malloc_type,
                         domain: ::std::os::raw::c_int,
                         flags: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn mallocarray(nmemb: usize, size: usize, type_: *mut malloc_type,
                       flags: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn malloc_init(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn malloc_last_fail() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc_type_allocated(type_: *mut malloc_type,
                                 size: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn malloc_type_freed(type_: *mut malloc_type,
                             size: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn malloc_type_list(arg1: malloc_type_list_func_t,
                            arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn malloc_uninit(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn realloc(addr: *mut ::std::os::raw::c_void,
                   size: ::std::os::raw::c_ulong, type_: *mut malloc_type,
                   flags: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn reallocf(addr: *mut ::std::os::raw::c_void,
                    size: ::std::os::raw::c_ulong, type_: *mut malloc_type,
                    flags: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn malloc_desc2type(desc: *const ::std::os::raw::c_char)
     -> *mut malloc_type;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uma_zone {
    _unused: [u8; 0],
}
pub type uma_zone_t = *mut uma_zone;
extern "C" {
    pub fn zone_drain(arg1: uma_zone_t);
}
pub type uma_ctor =
    ::std::option::Option<unsafe extern "C" fn(mem:
                                                   *mut ::std::os::raw::c_void,
                                               size: ::std::os::raw::c_int,
                                               arg:
                                                   *mut ::std::os::raw::c_void,
                                               flags: ::std::os::raw::c_int)
                              -> ::std::os::raw::c_int>;
pub type uma_dtor =
    ::std::option::Option<unsafe extern "C" fn(mem:
                                                   *mut ::std::os::raw::c_void,
                                               size: ::std::os::raw::c_int,
                                               arg:
                                                   *mut ::std::os::raw::c_void)>;
pub type uma_init =
    ::std::option::Option<unsafe extern "C" fn(mem:
                                                   *mut ::std::os::raw::c_void,
                                               size: ::std::os::raw::c_int,
                                               flags: ::std::os::raw::c_int)
                              -> ::std::os::raw::c_int>;
pub type uma_fini =
    ::std::option::Option<unsafe extern "C" fn(mem:
                                                   *mut ::std::os::raw::c_void,
                                               size: ::std::os::raw::c_int)>;
pub type uma_import =
    ::std::option::Option<unsafe extern "C" fn(arg:
                                                   *mut ::std::os::raw::c_void,
                                               store:
                                                   *mut *mut ::std::os::raw::c_void,
                                               count: ::std::os::raw::c_int,
                                               domain: ::std::os::raw::c_int,
                                               flags: ::std::os::raw::c_int)
                              -> ::std::os::raw::c_int>;
pub type uma_release =
    ::std::option::Option<unsafe extern "C" fn(arg:
                                                   *mut ::std::os::raw::c_void,
                                               store:
                                                   *mut *mut ::std::os::raw::c_void,
                                               count: ::std::os::raw::c_int)>;
extern "C" {
    pub fn uma_zcreate(name: *const ::std::os::raw::c_char, size: usize,
                       ctor: uma_ctor, dtor: uma_dtor, uminit: uma_init,
                       fini: uma_fini, align: ::std::os::raw::c_int,
                       flags: u32) -> uma_zone_t;
}
extern "C" {
    pub fn uma_zsecond_create(name: *mut ::std::os::raw::c_char,
                              ctor: uma_ctor, dtor: uma_dtor, zinit: uma_init,
                              zfini: uma_fini, master: uma_zone_t)
     -> uma_zone_t;
}
extern "C" {
    pub fn uma_zsecond_add(zone: uma_zone_t, master: uma_zone_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zcache_create(name: *mut ::std::os::raw::c_char,
                             size: ::std::os::raw::c_int, ctor: uma_ctor,
                             dtor: uma_dtor, zinit: uma_init, zfini: uma_fini,
                             zimport: uma_import, zrelease: uma_release,
                             arg: *mut ::std::os::raw::c_void,
                             flags: ::std::os::raw::c_int) -> uma_zone_t;
}
extern "C" {
    pub fn uma_zdestroy(zone: uma_zone_t);
}
extern "C" {
    pub fn uma_zalloc_arg(zone: uma_zone_t, arg: *mut ::std::os::raw::c_void,
                          flags: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn uma_zalloc_domain(zone: uma_zone_t,
                             arg: *mut ::std::os::raw::c_void,
                             domain: ::std::os::raw::c_int,
                             flags: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn uma_zfree_arg(zone: uma_zone_t, item: *mut ::std::os::raw::c_void,
                         arg: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn uma_zfree_domain(zone: uma_zone_t,
                            item: *mut ::std::os::raw::c_void,
                            arg: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn uma_zwait(zone: uma_zone_t);
}
pub type uma_alloc =
    ::std::option::Option<unsafe extern "C" fn(zone: uma_zone_t,
                                               size: vm_size_t,
                                               domain: ::std::os::raw::c_int,
                                               pflag: *mut u8,
                                               wait: ::std::os::raw::c_int)
                              -> *mut ::std::os::raw::c_void>;
pub type uma_free =
    ::std::option::Option<unsafe extern "C" fn(item:
                                                   *mut ::std::os::raw::c_void,
                                               size: vm_size_t, pflag: u8)>;
extern "C" {
    pub fn uma_startup(bootmem: *mut ::std::os::raw::c_void,
                       boot_pages: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_startup2();
}
extern "C" {
    pub fn uma_reclaim();
}
extern "C" {
    pub fn uma_set_align(align: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_zone_reserve(zone: uma_zone_t, nitems: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_zone_reserve_kva(zone: uma_zone_t,
                                nitems: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_set_max(zone: uma_zone_t, nitems: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_get_max(zone: uma_zone_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_set_warning(zone: uma_zone_t,
                                warning: *const ::std::os::raw::c_char);
}
pub type uma_maxaction_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: uma_zone_t,
                                               arg2: ::std::os::raw::c_int)>;
extern "C" {
    pub fn uma_zone_set_maxaction(zone: uma_zone_t, arg1: uma_maxaction_t);
}
extern "C" {
    pub fn uma_zone_get_cur(zone: uma_zone_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_set_init(zone: uma_zone_t, uminit: uma_init);
}
extern "C" {
    pub fn uma_zone_set_fini(zone: uma_zone_t, fini: uma_fini);
}
extern "C" {
    pub fn uma_zone_set_zinit(zone: uma_zone_t, zinit: uma_init);
}
extern "C" {
    pub fn uma_zone_set_zfini(zone: uma_zone_t, zfini: uma_fini);
}
extern "C" {
    pub fn uma_zone_set_allocf(zone: uma_zone_t, allocf: uma_alloc);
}
extern "C" {
    pub fn uma_zone_set_freef(zone: uma_zone_t, freef: uma_free);
}
extern "C" {
    pub fn uma_prealloc(zone: uma_zone_t, itemcnt: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uma_zone_exhausted(zone: uma_zone_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uma_zone_exhausted_nolock(zone: uma_zone_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "pcpu_zone_64"]
    pub static mut pcpu_zone_64: uma_zone_t;
}
extern "C" {
    #[link_name = "pcpu_zone_ptr"]
    pub static mut pcpu_zone_ptr: uma_zone_t;
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct uma_stream_header {
    pub ush_version: u32,
    pub ush_maxcpus: u32,
    pub ush_count: u32,
    pub _ush_pad: u32,
}
#[test]
fn bindgen_test_layout_uma_stream_header() {
    assert_eq!(::std::mem::size_of::<uma_stream_header>() , 16usize , concat !
               ( "Size of: " , stringify ! ( uma_stream_header ) ));
    assert_eq! (::std::mem::align_of::<uma_stream_header>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( uma_stream_header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_stream_header ) ) . ush_version as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_stream_header ) ,
                "::" , stringify ! ( ush_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_stream_header ) ) . ush_maxcpus as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_stream_header ) ,
                "::" , stringify ! ( ush_maxcpus ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_stream_header ) ) . ush_count as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_stream_header ) ,
                "::" , stringify ! ( ush_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_stream_header ) ) . _ush_pad as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_stream_header ) ,
                "::" , stringify ! ( _ush_pad ) ));
}
impl Clone for uma_stream_header {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct uma_type_header {
    pub uth_name: [::std::os::raw::c_char; 32usize],
    pub uth_align: u32,
    pub uth_size: u32,
    pub uth_rsize: u32,
    pub uth_maxpages: u32,
    pub uth_limit: u32,
    pub uth_pages: u32,
    pub uth_keg_free: u32,
    pub uth_zone_free: u32,
    pub uth_bucketsize: u32,
    pub uth_zone_flags: u32,
    pub uth_allocs: u64,
    pub uth_frees: u64,
    pub uth_fails: u64,
    pub uth_sleeps: u64,
    pub _uth_reserved1: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_uma_type_header() {
    assert_eq!(::std::mem::size_of::<uma_type_header>() , 120usize , concat !
               ( "Size of: " , stringify ! ( uma_type_header ) ));
    assert_eq! (::std::mem::align_of::<uma_type_header>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( uma_type_header ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_name as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_align as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_align ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_size as * const
                _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_rsize as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_rsize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_maxpages as *
                const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_maxpages ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_limit as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_limit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_pages as *
                const _ as usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_pages ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_keg_free as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_keg_free ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_zone_free as *
                const _ as usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_zone_free ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_bucketsize as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_bucketsize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_zone_flags as *
                const _ as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_zone_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_allocs as *
                const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_allocs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_frees as *
                const _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_frees ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_fails as *
                const _ as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_fails ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . uth_sleeps as *
                const _ as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( uth_sleeps ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_type_header ) ) . _uth_reserved1 as *
                const _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_type_header ) ,
                "::" , stringify ! ( _uth_reserved1 ) ));
}
impl Clone for uma_type_header {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct uma_percpu_stat {
    pub ups_allocs: u64,
    pub ups_frees: u64,
    pub ups_cache_free: u64,
    pub _ups_reserved: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_uma_percpu_stat() {
    assert_eq!(::std::mem::size_of::<uma_percpu_stat>() , 64usize , concat ! (
               "Size of: " , stringify ! ( uma_percpu_stat ) ));
    assert_eq! (::std::mem::align_of::<uma_percpu_stat>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( uma_percpu_stat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_percpu_stat ) ) . ups_allocs as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_percpu_stat ) ,
                "::" , stringify ! ( ups_allocs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_percpu_stat ) ) . ups_frees as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_percpu_stat ) ,
                "::" , stringify ! ( ups_frees ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_percpu_stat ) ) . ups_cache_free as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_percpu_stat ) ,
                "::" , stringify ! ( ups_cache_free ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uma_percpu_stat ) ) . _ups_reserved as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( uma_percpu_stat ) ,
                "::" , stringify ! ( _ups_reserved ) ));
}
impl Clone for uma_percpu_stat {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn uma_reclaim_wakeup();
}
extern "C" {
    pub fn uma_reclaim_worker(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn uma_limit() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn uma_size() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn uma_avail() -> ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "sdt_probes_enabled"]
    pub static mut sdt_probes_enabled: bool_;
}
pub type sdt_probe_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: u32, arg0: usize,
                                               arg1: usize, arg2: usize,
                                               arg3: usize, arg4: usize)>;
extern "C" {
    #[link_name = "sdt_probe_func"]
    pub static mut sdt_probe_func: sdt_probe_func_t;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sdt_probe {
    pub version: ::std::os::raw::c_int,
    pub prov: *mut sdt_provider,
    pub probe_entry: sdt_probe__bindgen_ty_1,
    pub argtype_list: sdt_probe__bindgen_ty_2,
    pub mod_: *const ::std::os::raw::c_char,
    pub func: *const ::std::os::raw::c_char,
    pub name: *const ::std::os::raw::c_char,
    pub id: id_t,
    pub n_args: ::std::os::raw::c_int,
    pub sdtp_lf: *mut linker_file,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sdt_probe__bindgen_ty_1 {
    pub tqe_next: *mut sdt_probe,
    pub tqe_prev: *mut *mut sdt_probe,
}
#[test]
fn bindgen_test_layout_sdt_probe__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<sdt_probe__bindgen_ty_1>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( sdt_probe__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<sdt_probe__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( sdt_probe__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe__bindgen_ty_1 ) ) . tqe_next as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe__bindgen_ty_1
                ) , "::" , stringify ! ( tqe_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe__bindgen_ty_1 ) ) . tqe_prev as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe__bindgen_ty_1
                ) , "::" , stringify ! ( tqe_prev ) ));
}
impl Clone for sdt_probe__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for sdt_probe__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sdt_probe__bindgen_ty_2 {
    pub tqh_first: *mut sdt_argtype,
    pub tqh_last: *mut *mut sdt_argtype,
}
#[test]
fn bindgen_test_layout_sdt_probe__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<sdt_probe__bindgen_ty_2>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( sdt_probe__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<sdt_probe__bindgen_ty_2>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( sdt_probe__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe__bindgen_ty_2 ) ) . tqh_first
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe__bindgen_ty_2
                ) , "::" , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe__bindgen_ty_2 ) ) . tqh_last as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe__bindgen_ty_2
                ) , "::" , stringify ! ( tqh_last ) ));
}
impl Clone for sdt_probe__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for sdt_probe__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_sdt_probe() {
    assert_eq!(::std::mem::size_of::<sdt_probe>() , 96usize , concat ! (
               "Size of: " , stringify ! ( sdt_probe ) ));
    assert_eq! (::std::mem::align_of::<sdt_probe>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sdt_probe ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . version as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . prov as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( prov ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . probe_entry as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( probe_entry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . argtype_list as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( argtype_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . mod_ as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( mod_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . func as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( func ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . name as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . id as * const _ as usize
                } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . n_args as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( n_args ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_probe ) ) . sdtp_lf as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_probe ) , "::" ,
                stringify ! ( sdtp_lf ) ));
}
impl Clone for sdt_probe {
    fn clone(&self) -> Self { *self }
}
impl Default for sdt_probe {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sdt_provider {
    pub name: *mut ::std::os::raw::c_char,
    pub prov_entry: sdt_provider__bindgen_ty_1,
    pub id: usize,
    pub sdt_refs: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sdt_provider__bindgen_ty_1 {
    pub tqe_next: *mut sdt_provider,
    pub tqe_prev: *mut *mut sdt_provider,
}
#[test]
fn bindgen_test_layout_sdt_provider__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<sdt_provider__bindgen_ty_1>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( sdt_provider__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<sdt_provider__bindgen_ty_1>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( sdt_provider__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_provider__bindgen_ty_1 ) ) . tqe_next
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                sdt_provider__bindgen_ty_1 ) , "::" , stringify ! ( tqe_next )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_provider__bindgen_ty_1 ) ) . tqe_prev
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                sdt_provider__bindgen_ty_1 ) , "::" , stringify ! ( tqe_prev )
                ));
}
impl Clone for sdt_provider__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for sdt_provider__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_sdt_provider() {
    assert_eq!(::std::mem::size_of::<sdt_provider>() , 40usize , concat ! (
               "Size of: " , stringify ! ( sdt_provider ) ));
    assert_eq! (::std::mem::align_of::<sdt_provider>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sdt_provider ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_provider ) ) . name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_provider ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_provider ) ) . prov_entry as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_provider ) , "::" ,
                stringify ! ( prov_entry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_provider ) ) . id as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_provider ) , "::" ,
                stringify ! ( id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_provider ) ) . sdt_refs as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_provider ) , "::" ,
                stringify ! ( sdt_refs ) ));
}
impl Clone for sdt_provider {
    fn clone(&self) -> Self { *self }
}
impl Default for sdt_provider {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linker_file {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sdt_argtype {
    pub ndx: ::std::os::raw::c_int,
    pub type_: *const ::std::os::raw::c_char,
    pub xtype: *const ::std::os::raw::c_char,
    pub argtype_entry: sdt_argtype__bindgen_ty_1,
    pub probe: *mut sdt_probe,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sdt_argtype__bindgen_ty_1 {
    pub tqe_next: *mut sdt_argtype,
    pub tqe_prev: *mut *mut sdt_argtype,
}
#[test]
fn bindgen_test_layout_sdt_argtype__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<sdt_argtype__bindgen_ty_1>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( sdt_argtype__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<sdt_argtype__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( sdt_argtype__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_argtype__bindgen_ty_1 ) ) . tqe_next
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                sdt_argtype__bindgen_ty_1 ) , "::" , stringify ! ( tqe_next )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_argtype__bindgen_ty_1 ) ) . tqe_prev
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                sdt_argtype__bindgen_ty_1 ) , "::" , stringify ! ( tqe_prev )
                ));
}
impl Clone for sdt_argtype__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for sdt_argtype__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_sdt_argtype() {
    assert_eq!(::std::mem::size_of::<sdt_argtype>() , 48usize , concat ! (
               "Size of: " , stringify ! ( sdt_argtype ) ));
    assert_eq! (::std::mem::align_of::<sdt_argtype>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sdt_argtype ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_argtype ) ) . ndx as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_argtype ) , "::" ,
                stringify ! ( ndx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_argtype ) ) . type_ as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_argtype ) , "::" ,
                stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_argtype ) ) . xtype as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_argtype ) , "::" ,
                stringify ! ( xtype ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_argtype ) ) . argtype_entry as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_argtype ) , "::" ,
                stringify ! ( argtype_entry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sdt_argtype ) ) . probe as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( sdt_argtype ) , "::" ,
                stringify ! ( probe ) ));
}
impl Clone for sdt_argtype {
    fn clone(&self) -> Self { *self }
}
impl Default for sdt_argtype {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    pub fn sdt_probe_stub(arg1: u32, arg2: usize, arg3: usize, arg4: usize,
                          arg5: usize, arg6: usize);
}
#[repr(C)]
pub struct mbuf {
    pub __bindgen_anon_1: mbuf__bindgen_ty_1,
    pub __bindgen_anon_2: mbuf__bindgen_ty_2,
    pub m_data: caddr_t,
    pub m_len: i32,
    pub _bitfield_1: u32,
    pub __bindgen_anon_3: mbuf__bindgen_ty_3,
}
#[repr(C)]
#[derive(Copy)]
pub union mbuf__bindgen_ty_1 {
    pub m_next: *mut mbuf,
    pub m_slist: mbuf__bindgen_ty_1__bindgen_ty_1,
    pub m_stailq: mbuf__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mbuf__bindgen_ty_1__bindgen_ty_1 {
    pub sle_next: *mut mbuf,
}
#[test]
fn bindgen_test_layout_mbuf__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<mbuf__bindgen_ty_1__bindgen_ty_1>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( mbuf__bindgen_ty_1__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<mbuf__bindgen_ty_1__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                mbuf__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_1__bindgen_ty_1 ) ) .
                sle_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                mbuf__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! (
                sle_next ) ));
}
impl Clone for mbuf__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for mbuf__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mbuf__bindgen_ty_1__bindgen_ty_2 {
    pub stqe_next: *mut mbuf,
}
#[test]
fn bindgen_test_layout_mbuf__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<mbuf__bindgen_ty_1__bindgen_ty_2>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( mbuf__bindgen_ty_1__bindgen_ty_2 )
               ));
    assert_eq! (::std::mem::align_of::<mbuf__bindgen_ty_1__bindgen_ty_2>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                mbuf__bindgen_ty_1__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_1__bindgen_ty_2 ) ) .
                stqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                mbuf__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! (
                stqe_next ) ));
}
impl Clone for mbuf__bindgen_ty_1__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for mbuf__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_mbuf__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<mbuf__bindgen_ty_1>() , 8usize , concat !
               ( "Size of: " , stringify ! ( mbuf__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<mbuf__bindgen_ty_1>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( mbuf__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_1 ) ) . m_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mbuf__bindgen_ty_1 ) ,
                "::" , stringify ! ( m_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_1 ) ) . m_slist as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mbuf__bindgen_ty_1 ) ,
                "::" , stringify ! ( m_slist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_1 ) ) . m_stailq as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mbuf__bindgen_ty_1 ) ,
                "::" , stringify ! ( m_stailq ) ));
}
impl Clone for mbuf__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for mbuf__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for mbuf__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "mbuf__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy)]
pub union mbuf__bindgen_ty_2 {
    pub m_nextpkt: *mut mbuf,
    pub m_slistpkt: mbuf__bindgen_ty_2__bindgen_ty_1,
    pub m_stailqpkt: mbuf__bindgen_ty_2__bindgen_ty_2,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mbuf__bindgen_ty_2__bindgen_ty_1 {
    pub sle_next: *mut mbuf,
}
#[test]
fn bindgen_test_layout_mbuf__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<mbuf__bindgen_ty_2__bindgen_ty_1>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( mbuf__bindgen_ty_2__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<mbuf__bindgen_ty_2__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                mbuf__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_2__bindgen_ty_1 ) ) .
                sle_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                mbuf__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                sle_next ) ));
}
impl Clone for mbuf__bindgen_ty_2__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for mbuf__bindgen_ty_2__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mbuf__bindgen_ty_2__bindgen_ty_2 {
    pub stqe_next: *mut mbuf,
}
#[test]
fn bindgen_test_layout_mbuf__bindgen_ty_2__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<mbuf__bindgen_ty_2__bindgen_ty_2>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( mbuf__bindgen_ty_2__bindgen_ty_2 )
               ));
    assert_eq! (::std::mem::align_of::<mbuf__bindgen_ty_2__bindgen_ty_2>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                mbuf__bindgen_ty_2__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_2__bindgen_ty_2 ) ) .
                stqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                mbuf__bindgen_ty_2__bindgen_ty_2 ) , "::" , stringify ! (
                stqe_next ) ));
}
impl Clone for mbuf__bindgen_ty_2__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for mbuf__bindgen_ty_2__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_mbuf__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<mbuf__bindgen_ty_2>() , 8usize , concat !
               ( "Size of: " , stringify ! ( mbuf__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<mbuf__bindgen_ty_2>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( mbuf__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_2 ) ) . m_nextpkt as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mbuf__bindgen_ty_2 ) ,
                "::" , stringify ! ( m_nextpkt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_2 ) ) . m_slistpkt as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mbuf__bindgen_ty_2 ) ,
                "::" , stringify ! ( m_slistpkt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_2 ) ) . m_stailqpkt as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mbuf__bindgen_ty_2 ) ,
                "::" , stringify ! ( m_stailqpkt ) ));
}
impl Clone for mbuf__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for mbuf__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for mbuf__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "mbuf__bindgen_ty_2 {{ union }}")
    }
}
#[repr(C)]
pub struct mbuf__bindgen_ty_3 {
    pub __bindgen_anon_1: __BindgenUnionField<mbuf__bindgen_ty_3__bindgen_ty_1>,
    pub m_dat: __BindgenUnionField<[::std::os::raw::c_char; 0usize]>,
    pub bindgen_union_field: [u64; 13usize],
}
#[repr(C)]
pub struct mbuf__bindgen_ty_3__bindgen_ty_1 {
    pub m_pkthdr: pkthdr,
    pub __bindgen_anon_1: mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
pub struct mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    pub m_ext: __BindgenUnionField<m_ext>,
    pub m_pktdat: __BindgenUnionField<[::std::os::raw::c_char; 0usize]>,
    pub bindgen_union_field: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1>()
               , 48usize , concat ! (
               "Size of: " , stringify ! (
               mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 )
                ) . m_ext as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 ) , "::" ,
                stringify ! ( m_ext ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 )
                ) . m_pktdat as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 ) , "::" ,
                stringify ! ( m_pktdat ) ));
}
impl Default for mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_mbuf__bindgen_ty_3__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<mbuf__bindgen_ty_3__bindgen_ty_1>() ,
               104usize , concat ! (
               "Size of: " , stringify ! ( mbuf__bindgen_ty_3__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<mbuf__bindgen_ty_3__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                mbuf__bindgen_ty_3__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_3__bindgen_ty_1 ) ) .
                m_pkthdr as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                mbuf__bindgen_ty_3__bindgen_ty_1 ) , "::" , stringify ! (
                m_pkthdr ) ));
}
impl Default for mbuf__bindgen_ty_3__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for mbuf__bindgen_ty_3__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "mbuf__bindgen_ty_3__bindgen_ty_1 {{ m_pkthdr: {:?} }}" ,
               self . m_pkthdr)
    }
}
#[test]
fn bindgen_test_layout_mbuf__bindgen_ty_3() {
    assert_eq!(::std::mem::size_of::<mbuf__bindgen_ty_3>() , 104usize , concat
               ! ( "Size of: " , stringify ! ( mbuf__bindgen_ty_3 ) ));
    assert_eq! (::std::mem::align_of::<mbuf__bindgen_ty_3>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( mbuf__bindgen_ty_3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf__bindgen_ty_3 ) ) . m_dat as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mbuf__bindgen_ty_3 ) ,
                "::" , stringify ! ( m_dat ) ));
}
impl Default for mbuf__bindgen_ty_3 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for mbuf__bindgen_ty_3 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "mbuf__bindgen_ty_3 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_mbuf() {
    assert_eq!(::std::mem::size_of::<mbuf>() , 136usize , concat ! (
               "Size of: " , stringify ! ( mbuf ) ));
    assert_eq! (::std::mem::align_of::<mbuf>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( mbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf ) ) . m_data as * const _ as usize }
                , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( mbuf ) , "::" ,
                stringify ! ( m_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbuf ) ) . m_len as * const _ as usize }
                , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mbuf ) , "::" ,
                stringify ! ( m_len ) ));
}
impl Default for mbuf {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for mbuf {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "mbuf {{ m_data: {:?}, m_len: {:?}, m_type : {:?}, m_flags : {:?} }}"
               , self . m_data , self . m_len , self . m_type (  ) , self .
               m_flags (  ))
    }
}
impl mbuf {
    #[inline]
    pub fn m_type(&self) -> u32 {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_m_type(&mut self, val: u32) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn m_flags(&self) -> u32 {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4294967040u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_m_flags(&mut self, val: u32) {
        let mask = 4294967040u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(m_type: u32, m_flags: u32) -> u32 {
        ({ ({ 0 } | ((m_type as u32 as u32) << 0usize) & (255u64 as u32)) } |
             ((m_flags as u32 as u32) << 8usize) & (4294967040u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct mb_args {
    pub flags: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_mb_args() {
    assert_eq!(::std::mem::size_of::<mb_args>() , 8usize , concat ! (
               "Size of: " , stringify ! ( mb_args ) ));
    assert_eq! (::std::mem::align_of::<mb_args>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( mb_args ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mb_args ) ) . flags as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mb_args ) , "::" ,
                stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mb_args ) ) . type_ as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( mb_args ) , "::" ,
                stringify ! ( type_ ) ));
}
impl Clone for mb_args {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct m_tag {
    pub m_tag_link: m_tag__bindgen_ty_1,
    pub m_tag_id: u_int16_t,
    pub m_tag_len: u_int16_t,
    pub m_tag_cookie: u_int32_t,
    pub m_tag_free: ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                   *mut m_tag)>,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct m_tag__bindgen_ty_1 {
    pub sle_next: *mut m_tag,
}
#[test]
fn bindgen_test_layout_m_tag__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<m_tag__bindgen_ty_1>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( m_tag__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<m_tag__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( m_tag__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_tag__bindgen_ty_1 ) ) . sle_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( m_tag__bindgen_ty_1 ) ,
                "::" , stringify ! ( sle_next ) ));
}
impl Clone for m_tag__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for m_tag__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_m_tag() {
    assert_eq!(::std::mem::size_of::<m_tag>() , 24usize , concat ! (
               "Size of: " , stringify ! ( m_tag ) ));
    assert_eq! (::std::mem::align_of::<m_tag>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( m_tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_tag ) ) . m_tag_link as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( m_tag ) , "::" ,
                stringify ! ( m_tag_link ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_tag ) ) . m_tag_id as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( m_tag ) , "::" ,
                stringify ! ( m_tag_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_tag ) ) . m_tag_len as * const _ as
                usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( m_tag ) , "::" ,
                stringify ! ( m_tag_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_tag ) ) . m_tag_cookie as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( m_tag ) , "::" ,
                stringify ! ( m_tag_cookie ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_tag ) ) . m_tag_free as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( m_tag ) , "::" ,
                stringify ! ( m_tag_free ) ));
}
impl Clone for m_tag {
    fn clone(&self) -> Self { *self }
}
impl Default for m_tag {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct m_snd_tag {
    pub ifp: *mut ifnet,
}
#[test]
fn bindgen_test_layout_m_snd_tag() {
    assert_eq!(::std::mem::size_of::<m_snd_tag>() , 8usize , concat ! (
               "Size of: " , stringify ! ( m_snd_tag ) ));
    assert_eq! (::std::mem::align_of::<m_snd_tag>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( m_snd_tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_snd_tag ) ) . ifp as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( m_snd_tag ) , "::" ,
                stringify ! ( ifp ) ));
}
impl Clone for m_snd_tag {
    fn clone(&self) -> Self { *self }
}
impl Default for m_snd_tag {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct pkthdr {
    pub __bindgen_anon_1: pkthdr__bindgen_ty_1,
    pub tags: pkthdr_packet_tags,
    pub len: i32,
    pub flowid: u32,
    pub csum_flags: u32,
    pub fibnum: u16,
    pub cosqos: u8,
    pub rsstype: u8,
    pub __bindgen_anon_2: pkthdr__bindgen_ty_2,
    pub PH_per: pkthdr__bindgen_ty_3,
    pub PH_loc: pkthdr__bindgen_ty_4,
}
#[repr(C)]
#[derive(Copy)]
pub union pkthdr__bindgen_ty_1 {
    pub snd_tag: *mut m_snd_tag,
    pub rcvif: *mut ifnet,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pkthdr__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pkthdr__bindgen_ty_1>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pkthdr__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<pkthdr__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pkthdr__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_1 ) ) . snd_tag as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_1 )
                , "::" , stringify ! ( snd_tag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_1 ) ) . rcvif as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_1 )
                , "::" , stringify ! ( rcvif ) ));
}
impl Clone for pkthdr__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for pkthdr__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for pkthdr__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "pkthdr__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pkthdr_packet_tags {
    pub slh_first: *mut m_tag,
}
#[test]
fn bindgen_test_layout_pkthdr_packet_tags() {
    assert_eq!(::std::mem::size_of::<pkthdr_packet_tags>() , 8usize , concat !
               ( "Size of: " , stringify ! ( pkthdr_packet_tags ) ));
    assert_eq! (::std::mem::align_of::<pkthdr_packet_tags>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( pkthdr_packet_tags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr_packet_tags ) ) . slh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr_packet_tags ) ,
                "::" , stringify ! ( slh_first ) ));
}
impl Clone for pkthdr_packet_tags {
    fn clone(&self) -> Self { *self }
}
impl Default for pkthdr_packet_tags {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub union pkthdr__bindgen_ty_2 {
    pub rcv_tstmp: u64,
    pub __bindgen_anon_1: pkthdr__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pkthdr__bindgen_ty_2__bindgen_ty_1 {
    pub l2hlen: u8,
    pub l3hlen: u8,
    pub l4hlen: u8,
    pub l5hlen: u8,
    pub spare: u32,
}
#[test]
fn bindgen_test_layout_pkthdr__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pkthdr__bindgen_ty_2__bindgen_ty_1>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( pkthdr__bindgen_ty_2__bindgen_ty_1
               ) ));
    assert_eq! (::std::mem::align_of::<pkthdr__bindgen_ty_2__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                pkthdr__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_2__bindgen_ty_1 ) ) .
                l2hlen as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pkthdr__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                l2hlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_2__bindgen_ty_1 ) ) .
                l3hlen as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                pkthdr__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                l3hlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_2__bindgen_ty_1 ) ) .
                l4hlen as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                pkthdr__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                l4hlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_2__bindgen_ty_1 ) ) .
                l5hlen as * const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! (
                pkthdr__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                l5hlen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_2__bindgen_ty_1 ) ) .
                spare as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pkthdr__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                spare ) ));
}
impl Clone for pkthdr__bindgen_ty_2__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pkthdr__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<pkthdr__bindgen_ty_2>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pkthdr__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<pkthdr__bindgen_ty_2>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pkthdr__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_2 ) ) . rcv_tstmp as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_2 )
                , "::" , stringify ! ( rcv_tstmp ) ));
}
impl Clone for pkthdr__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for pkthdr__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for pkthdr__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "pkthdr__bindgen_ty_2 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy)]
pub union pkthdr__bindgen_ty_3 {
    pub eight: [u8; 8usize],
    pub sixteen: [u16; 4usize],
    pub thirtytwo: [u32; 2usize],
    pub sixtyfour: [u64; 1usize],
    pub unintptr: [usize; 1usize],
    pub ptr: *mut ::std::os::raw::c_void,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pkthdr__bindgen_ty_3() {
    assert_eq!(::std::mem::size_of::<pkthdr__bindgen_ty_3>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pkthdr__bindgen_ty_3 ) ));
    assert_eq! (::std::mem::align_of::<pkthdr__bindgen_ty_3>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pkthdr__bindgen_ty_3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_3 ) ) . eight as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_3 )
                , "::" , stringify ! ( eight ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_3 ) ) . sixteen as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_3 )
                , "::" , stringify ! ( sixteen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_3 ) ) . thirtytwo as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_3 )
                , "::" , stringify ! ( thirtytwo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_3 ) ) . sixtyfour as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_3 )
                , "::" , stringify ! ( sixtyfour ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_3 ) ) . unintptr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_3 )
                , "::" , stringify ! ( unintptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_3 ) ) . ptr as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_3 )
                , "::" , stringify ! ( ptr ) ));
}
impl Clone for pkthdr__bindgen_ty_3 {
    fn clone(&self) -> Self { *self }
}
impl Default for pkthdr__bindgen_ty_3 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for pkthdr__bindgen_ty_3 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "pkthdr__bindgen_ty_3 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy)]
pub union pkthdr__bindgen_ty_4 {
    pub eight: [u8; 8usize],
    pub sixteen: [u16; 4usize],
    pub thirtytwo: [u32; 2usize],
    pub sixtyfour: [u64; 1usize],
    pub unintptr: [usize; 1usize],
    pub ptr: *mut ::std::os::raw::c_void,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pkthdr__bindgen_ty_4() {
    assert_eq!(::std::mem::size_of::<pkthdr__bindgen_ty_4>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pkthdr__bindgen_ty_4 ) ));
    assert_eq! (::std::mem::align_of::<pkthdr__bindgen_ty_4>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pkthdr__bindgen_ty_4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_4 ) ) . eight as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_4 )
                , "::" , stringify ! ( eight ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_4 ) ) . sixteen as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_4 )
                , "::" , stringify ! ( sixteen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_4 ) ) . thirtytwo as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_4 )
                , "::" , stringify ! ( thirtytwo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_4 ) ) . sixtyfour as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_4 )
                , "::" , stringify ! ( sixtyfour ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_4 ) ) . unintptr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_4 )
                , "::" , stringify ! ( unintptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr__bindgen_ty_4 ) ) . ptr as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr__bindgen_ty_4 )
                , "::" , stringify ! ( ptr ) ));
}
impl Clone for pkthdr__bindgen_ty_4 {
    fn clone(&self) -> Self { *self }
}
impl Default for pkthdr__bindgen_ty_4 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for pkthdr__bindgen_ty_4 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "pkthdr__bindgen_ty_4 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_pkthdr() {
    assert_eq!(::std::mem::size_of::<pkthdr>() , 56usize , concat ! (
               "Size of: " , stringify ! ( pkthdr ) ));
    assert_eq! (::std::mem::align_of::<pkthdr>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pkthdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr ) ) . tags as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr ) , "::" ,
                stringify ! ( tags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr ) ) . len as * const _ as usize }
                , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr ) , "::" ,
                stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr ) ) . flowid as * const _ as usize
                } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr ) , "::" ,
                stringify ! ( flowid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr ) ) . csum_flags as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr ) , "::" ,
                stringify ! ( csum_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr ) ) . fibnum as * const _ as usize
                } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr ) , "::" ,
                stringify ! ( fibnum ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr ) ) . cosqos as * const _ as usize
                } , 30usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr ) , "::" ,
                stringify ! ( cosqos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr ) ) . rsstype as * const _ as
                usize } , 31usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr ) , "::" ,
                stringify ! ( rsstype ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr ) ) . PH_per as * const _ as usize
                } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr ) , "::" ,
                stringify ! ( PH_per ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pkthdr ) ) . PH_loc as * const _ as usize
                } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( pkthdr ) , "::" ,
                stringify ! ( PH_loc ) ));
}
impl Clone for pkthdr {
    fn clone(&self) -> Self { *self }
}
impl Default for pkthdr {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for pkthdr {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "pkthdr {{ tags: {:?}, len: {:?}, flowid: {:?}, csum_flags: {:?}, fibnum: {:?}, cosqos: {:?}, rsstype: {:?}, PH_per: {:?}, PH_loc: {:?} }}"
               , self . tags , self . len , self . flowid , self . csum_flags
               , self . fibnum , self . cosqos , self . rsstype , self .
               PH_per , self . PH_loc)
    }
}
pub type m_ext_free_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut mbuf)>;
#[repr(C)]
#[derive(Copy)]
pub struct m_ext {
    pub __bindgen_anon_1: m_ext__bindgen_ty_1,
    pub ext_buf: *mut ::std::os::raw::c_char,
    pub ext_size: u32,
    pub _bitfield_1: u32,
    pub ext_free: m_ext_free_t,
    pub ext_arg1: *mut ::std::os::raw::c_void,
    pub ext_arg2: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy)]
pub union m_ext__bindgen_ty_1 {
    pub ext_count: u_int,
    pub ext_cnt: *mut u_int,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_m_ext__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<m_ext__bindgen_ty_1>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( m_ext__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<m_ext__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( m_ext__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_ext__bindgen_ty_1 ) ) . ext_count as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( m_ext__bindgen_ty_1 ) ,
                "::" , stringify ! ( ext_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_ext__bindgen_ty_1 ) ) . ext_cnt as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( m_ext__bindgen_ty_1 ) ,
                "::" , stringify ! ( ext_cnt ) ));
}
impl Clone for m_ext__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for m_ext__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for m_ext__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f , "m_ext__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_m_ext() {
    assert_eq!(::std::mem::size_of::<m_ext>() , 48usize , concat ! (
               "Size of: " , stringify ! ( m_ext ) ));
    assert_eq! (::std::mem::align_of::<m_ext>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( m_ext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_ext ) ) . ext_buf as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( m_ext ) , "::" ,
                stringify ! ( ext_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_ext ) ) . ext_size as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( m_ext ) , "::" ,
                stringify ! ( ext_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_ext ) ) . ext_free as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( m_ext ) , "::" ,
                stringify ! ( ext_free ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_ext ) ) . ext_arg1 as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( m_ext ) , "::" ,
                stringify ! ( ext_arg1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const m_ext ) ) . ext_arg2 as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( m_ext ) , "::" ,
                stringify ! ( ext_arg2 ) ));
}
impl Clone for m_ext {
    fn clone(&self) -> Self { *self }
}
impl Default for m_ext {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
impl ::std::fmt::Debug for m_ext {
    fn fmt(&self, f: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        write!(f ,
               "m_ext {{ ext_buf: {:?}, ext_size: {:?}, ext_type : {:?}, ext_flags : {:?}, ext_free: {:?}, ext_arg1: {:?}, ext_arg2: {:?} }}"
               , self . ext_buf , self . ext_size , self . ext_type (  ) ,
               self . ext_flags (  ) , self . ext_free , self . ext_arg1 ,
               self . ext_arg2)
    }
}
impl m_ext {
    #[inline]
    pub fn ext_type(&self) -> u32 {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_ext_type(&mut self, val: u32) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn ext_flags(&self) -> u32 {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 4294967040u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_ext_flags(&mut self, val: u32) {
        let mask = 4294967040u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(ext_type: u32, ext_flags: u32) -> u32 {
        ({ ({ 0 } | ((ext_type as u32 as u32) << 0usize) & (255u64 as u32)) }
             | ((ext_flags as u32 as u32) << 8usize) & (4294967040u64 as u32))
    }
}
extern "C" {
    #[link_name = "zone_mbuf"]
    pub static mut zone_mbuf: uma_zone_t;
}
extern "C" {
    #[link_name = "zone_clust"]
    pub static mut zone_clust: uma_zone_t;
}
extern "C" {
    #[link_name = "zone_pack"]
    pub static mut zone_pack: uma_zone_t;
}
extern "C" {
    #[link_name = "zone_jumbop"]
    pub static mut zone_jumbop: uma_zone_t;
}
extern "C" {
    #[link_name = "zone_jumbo9"]
    pub static mut zone_jumbo9: uma_zone_t;
}
extern "C" {
    #[link_name = "zone_jumbo16"]
    pub static mut zone_jumbo16: uma_zone_t;
}
extern "C" {
    pub fn mb_dupcl(arg1: *mut mbuf, arg2: *mut mbuf);
}
extern "C" {
    pub fn mb_free_ext(arg1: *mut mbuf);
}
extern "C" {
    pub fn m_adj(arg1: *mut mbuf, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn m_apply(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                   arg3: ::std::os::raw::c_int,
                   arg4:
                       ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                      *mut ::std::os::raw::c_void,
                                                                  arg2:
                                                                      *mut ::std::os::raw::c_void,
                                                                  arg3: u_int)
                                                 -> ::std::os::raw::c_int>,
                   arg5: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m_append(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                    arg3: c_caddr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m_cat(arg1: *mut mbuf, arg2: *mut mbuf);
}
extern "C" {
    pub fn m_catpkt(arg1: *mut mbuf, arg2: *mut mbuf);
}
extern "C" {
    pub fn m_clget(m: *mut mbuf, how: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m_cljget(m: *mut mbuf, how: ::std::os::raw::c_int,
                    size: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn m_collapse(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                      arg3: ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_copyback(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                      arg3: ::std::os::raw::c_int, arg4: c_caddr_t);
}
extern "C" {
    pub fn m_copydata(arg1: *const mbuf, arg2: ::std::os::raw::c_int,
                      arg3: ::std::os::raw::c_int, arg4: caddr_t);
}
extern "C" {
    pub fn m_copym(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                   arg3: ::std::os::raw::c_int, arg4: ::std::os::raw::c_int)
     -> *mut mbuf;
}
extern "C" {
    pub fn m_copypacket(arg1: *mut mbuf, arg2: ::std::os::raw::c_int)
     -> *mut mbuf;
}
extern "C" {
    pub fn m_copy_pkthdr(arg1: *mut mbuf, arg2: *mut mbuf);
}
extern "C" {
    pub fn m_copyup(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                    arg3: ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_defrag(arg1: *mut mbuf, arg2: ::std::os::raw::c_int)
     -> *mut mbuf;
}
extern "C" {
    pub fn m_demote_pkthdr(arg1: *mut mbuf);
}
extern "C" {
    pub fn m_demote(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                    arg3: ::std::os::raw::c_int);
}
extern "C" {
    pub fn m_devget(arg1: *mut ::std::os::raw::c_char,
                    arg2: ::std::os::raw::c_int, arg3: ::std::os::raw::c_int,
                    arg4: *mut ifnet,
                    arg5:
                        ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                       *mut ::std::os::raw::c_char,
                                                                   arg2:
                                                                       caddr_t,
                                                                   arg3:
                                                                       u_int)>)
     -> *mut mbuf;
}
extern "C" {
    pub fn m_dup(arg1: *const mbuf, arg2: ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_dup_pkthdr(arg1: *mut mbuf, arg2: *const mbuf,
                        arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m_extadd(arg1: *mut mbuf, arg2: *mut ::std::os::raw::c_char,
                    arg3: u_int, arg4: m_ext_free_t,
                    arg5: *mut ::std::os::raw::c_void,
                    arg6: *mut ::std::os::raw::c_void,
                    arg7: ::std::os::raw::c_int, arg8: ::std::os::raw::c_int);
}
extern "C" {
    pub fn m_fixhdr(arg1: *mut mbuf) -> u_int;
}
extern "C" {
    pub fn m_fragment(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                      arg3: ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_freem(arg1: *mut mbuf);
}
extern "C" {
    pub fn m_get2(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int,
                  arg3: ::std::os::raw::c_short, arg4: ::std::os::raw::c_int)
     -> *mut mbuf;
}
extern "C" {
    pub fn m_getjcl(arg1: ::std::os::raw::c_int,
                    arg2: ::std::os::raw::c_short,
                    arg3: ::std::os::raw::c_int, arg4: ::std::os::raw::c_int)
     -> *mut mbuf;
}
extern "C" {
    pub fn m_getm2(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                   arg3: ::std::os::raw::c_int, arg4: ::std::os::raw::c_short,
                   arg5: ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_getptr(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                    arg3: *mut ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_length(arg1: *mut mbuf, arg2: *mut *mut mbuf) -> u_int;
}
extern "C" {
    pub fn m_mbuftouio(arg1: *mut uio, arg2: *const mbuf,
                       arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m_move_pkthdr(arg1: *mut mbuf, arg2: *mut mbuf);
}
extern "C" {
    pub fn m_pkthdr_init(arg1: *mut mbuf, arg2: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m_prepend(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                     arg3: ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_print(arg1: *const mbuf, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn m_pulldown(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                      arg3: ::std::os::raw::c_int,
                      arg4: *mut ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_pullup(arg1: *mut mbuf, arg2: ::std::os::raw::c_int)
     -> *mut mbuf;
}
extern "C" {
    pub fn m_sanity(arg1: *mut mbuf, arg2: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m_split(arg1: *mut mbuf, arg2: ::std::os::raw::c_int,
                   arg3: ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_uiotombuf(arg1: *mut uio, arg2: ::std::os::raw::c_int,
                       arg3: ::std::os::raw::c_int,
                       arg4: ::std::os::raw::c_int,
                       arg5: ::std::os::raw::c_int) -> *mut mbuf;
}
extern "C" {
    pub fn m_unshare(arg1: *mut mbuf, arg2: ::std::os::raw::c_int)
     -> *mut mbuf;
}
extern "C" {
    #[link_name = "max_datalen"]
    pub static mut max_datalen: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "max_hdr"]
    pub static mut max_hdr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "max_linkhdr"]
    pub static mut max_linkhdr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "max_protohdr"]
    pub static mut max_protohdr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "nmbclusters"]
    pub static mut nmbclusters: ::std::os::raw::c_int;
}
extern "C" {
    pub fn m_tag_alloc(arg1: u_int32_t, arg2: ::std::os::raw::c_int,
                       arg3: ::std::os::raw::c_int,
                       arg4: ::std::os::raw::c_int) -> *mut m_tag;
}
extern "C" {
    pub fn m_tag_delete(arg1: *mut mbuf, arg2: *mut m_tag);
}
extern "C" {
    pub fn m_tag_delete_chain(arg1: *mut mbuf, arg2: *mut m_tag);
}
extern "C" {
    pub fn m_tag_free_default(arg1: *mut m_tag);
}
extern "C" {
    pub fn m_tag_locate(arg1: *mut mbuf, arg2: u_int32_t,
                        arg3: ::std::os::raw::c_int, arg4: *mut m_tag)
     -> *mut m_tag;
}
extern "C" {
    pub fn m_tag_copy(arg1: *mut m_tag, arg2: ::std::os::raw::c_int)
     -> *mut m_tag;
}
extern "C" {
    pub fn m_tag_copy_chain(arg1: *mut mbuf, arg2: *const mbuf,
                            arg3: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn m_tag_delete_nonpersistent(arg1: *mut mbuf);
}
extern "C" {
    pub fn m_ether_tcpip_hash_init() -> u32;
}
extern "C" {
    pub fn m_ether_tcpip_hash(arg1: u32, arg2: *const mbuf, arg3: u32) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mbufq {
    pub mq_head: mbufq__bindgen_ty_1,
    pub mq_len: ::std::os::raw::c_int,
    pub mq_maxlen: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mbufq__bindgen_ty_1 {
    pub stqh_first: *mut mbuf,
    pub stqh_last: *mut *mut mbuf,
}
#[test]
fn bindgen_test_layout_mbufq__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<mbufq__bindgen_ty_1>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( mbufq__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<mbufq__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( mbufq__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbufq__bindgen_ty_1 ) ) . stqh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mbufq__bindgen_ty_1 ) ,
                "::" , stringify ! ( stqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbufq__bindgen_ty_1 ) ) . stqh_last as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( mbufq__bindgen_ty_1 ) ,
                "::" , stringify ! ( stqh_last ) ));
}
impl Clone for mbufq__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for mbufq__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_mbufq() {
    assert_eq!(::std::mem::size_of::<mbufq>() , 24usize , concat ! (
               "Size of: " , stringify ! ( mbufq ) ));
    assert_eq! (::std::mem::align_of::<mbufq>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( mbufq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbufq ) ) . mq_head as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mbufq ) , "::" ,
                stringify ! ( mq_head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbufq ) ) . mq_len as * const _ as usize
                } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( mbufq ) , "::" ,
                stringify ! ( mq_len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mbufq ) ) . mq_maxlen as * const _ as
