/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::core::marker::PhantomData<T>);
impl <T> __IncompleteArrayField<T> {
    #[inline]
    pub fn new() -> Self {
        __IncompleteArrayField(::core::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T { ::core::mem::transmute(self) }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::core::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl <T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl <T> ::core::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self { Self::new() }
}
impl <T> ::core::marker::Copy for __IncompleteArrayField<T> { }
#[repr(C)]
pub struct __BindgenUnionField<T>(::core::marker::PhantomData<T>);
impl <T> __BindgenUnionField<T> {
    #[inline]
    pub fn new() -> Self { __BindgenUnionField(::core::marker::PhantomData) }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T { ::core::mem::transmute(self) }
    #[inline]

pub type __float_t = f32;
pub type __intfptr_t = __int64_t;
pub type __intptr_t = __int64_t;
pub type __intmax_t = __int64_t;
pub type __int_fast8_t = __int32_t;
pub type __int_fast16_t = __int32_t;
pub type __int_fast32_t = __int32_t;
pub type __int_fast64_t = __int64_t;
pub type __int_least8_t = __int8_t;
pub type __int_least16_t = __int16_t;
pub type __int_least32_t = __int32_t;
pub type __int_least64_t = __int64_t;
pub type __ptrdiff_t = __int64_t;
pub type __register_t = __int64_t;
pub type __segsz_t = __int64_t;
pub type __size_t = __uint64_t;
pub type __ssize_t = __int64_t;
pub type __time_t = __int64_t;
pub type __uintfptr_t = __uint64_t;
pub type __uintptr_t = __uint64_t;
pub type __uintmax_t = __uint64_t;
pub type __uint_fast8_t = __uint32_t;
pub type __uint_fast16_t = __uint32_t;
pub type __uint_fast32_t = __uint32_t;
pub type __uint_fast64_t = __uint64_t;
pub type __uint_least8_t = __uint8_t;
pub type __uint_least16_t = __uint16_t;
pub type __uint_least32_t = __uint32_t;
pub type __uint_least64_t = __uint64_t;
pub type __u_register_t = __uint64_t;
pub type __vm_offset_t = __uint64_t;
pub type __vm_paddr_t = __uint64_t;
pub type __vm_size_t = __uint64_t;
pub type ___wchar_t = ::kernel::sys::raw::c_int;
pub type __blksize_t = __int32_t;
pub type __blkcnt_t = __int64_t;
pub type __clockid_t = __int32_t;
pub type __fflags_t = __uint32_t;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint64_t;
pub type __gid_t = __uint32_t;
pub type __id_t = __int64_t;
pub type __ino_t = __uint64_t;
pub type __key_t = ::kernel::sys::raw::c_long;
pub type __lwpid_t = __int32_t;
pub type __mode_t = __uint16_t;
pub type __accmode_t = ::kernel::sys::raw::c_int;
pub type __nl_item = ::kernel::sys::raw::c_int;
pub type __nlink_t = __uint64_t;
pub type __off_t = __int64_t;
pub type __off64_t = __int64_t;
pub type __pid_t = __int32_t;
pub type __rlim_t = __int64_t;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __suseconds_t = ::kernel::sys::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __timer {
    _unused: [u8; 0],
}
pub type __timer_t = *mut __timer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __mq {
    _unused: [u8; 0],
}
pub type __mqd_t = *mut __mq;
pub type __uid_t = __uint32_t;
pub type __useconds_t = ::kernel::sys::raw::c_uint;
pub type __cpuwhich_t = ::kernel::sys::raw::c_int;
pub type __cpulevel_t = ::kernel::sys::raw::c_int;
pub type __cpusetid_t = ::kernel::sys::raw::c_int;
pub type __ct_rune_t = ::kernel::sys::raw::c_int;
pub type __rune_t = __ct_rune_t;
pub type __wint_t = __ct_rune_t;
pub type __char16_t = __uint_least16_t;
pub type __char32_t = __uint_least32_t;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct __max_align_t {
    pub __max_align1: ::kernel::sys::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __max_align2: f64,
}
#[test]
fn bindgen_test_layout___max_align_t() {
    assert_eq!(::core::mem::size_of::<__max_align_t>() , 32usize , concat ! (
               "Size of: " , stringify ! ( __max_align_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __max_align_t ) ) . __max_align1 as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __max_align_t ) , "::"
                , stringify ! ( __max_align1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __max_align_t ) ) . __max_align2 as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( __max_align_t ) , "::"
                , stringify ! ( __max_align2 ) ));
}
impl Clone for __max_align_t {
    fn clone(&self) -> Self { *self }
}
pub type __dev_t = __uint64_t;
pub type __fixpt_t = __uint32_t;
#[repr(C)]
#[derive(Copy)]
pub union __mbstate_t {
    pub __mbstate8: [::kernel::sys::raw::c_char; 128usize],
    pub _mbstateL: __int64_t,
    _bindgen_union_align: [u64; 16usize],
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(::core::mem::size_of::<__mbstate_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( __mbstate_t ) ));
    assert_eq! (::core::mem::align_of::<__mbstate_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __mbstate_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __mbstate8 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __mbstate8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . _mbstateL as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( _mbstateL ) ));
}
impl Clone for __mbstate_t {
    fn clone(&self) -> Self { *self }
}
impl Default for __mbstate_t {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for __mbstate_t {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f , "__mbstate_t {{ union }}")
    }
}
pub type __rman_res_t = __uintmax_t;
pub type __va_list = __builtin_va_list;
pub type __gnuc_va_list = __va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_once {
    pub state: ::kernel::sys::raw::c_int,
    pub mutex: pthread_mutex_t,
}
#[test]
fn bindgen_test_layout_pthread_once() {
    assert_eq!(::core::mem::size_of::<pthread_once>() , 16usize , concat ! (
               "Size of: " , stringify ! ( pthread_once ) ));
    assert_eq! (::core::mem::align_of::<pthread_once>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_once ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_once ) ) . state as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_once ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_once ) ) . mutex as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_once ) , "::" ,
                stringify ! ( mutex ) ));
}
impl Clone for pthread_once {
    fn clone(&self) -> Self { *self }
}
impl Default for pthread_once {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlock {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlockattr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrier {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrier_attr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_spinlock {
    _unused: [u8; 0],
}
pub type pthread_t = *mut pthread;
pub type pthread_attr_t = *mut pthread_attr;
pub type pthread_mutex_t = *mut pthread_mutex;
pub type pthread_mutexattr_t = *mut pthread_mutex_attr;
pub type pthread_cond_t = *mut pthread_cond;
pub type pthread_condattr_t = *mut pthread_cond_attr;
pub type pthread_key_t = ::kernel::sys::raw::c_int;
pub type pthread_once_t = pthread_once;
pub type pthread_rwlock_t = *mut pthread_rwlock;
pub type pthread_rwlockattr_t = *mut pthread_rwlockattr;
pub type pthread_barrier_t = *mut pthread_barrier;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrierattr {
    _unused: [u8; 0],
}
pub type pthread_barrierattr_t = *mut pthread_barrierattr;
pub type pthread_spinlock_t = *mut pthread_spinlock;
pub type pthread_addr_t = *mut ::kernel::sys::raw::c_void;
pub type pthread_startroutine_t =
    ::core::option::Option<unsafe extern "C" fn(arg1:
                                                    *mut ::kernel::sys::raw::c_void)
                               -> *mut ::kernel::sys::raw::c_void>;
pub type u_char = ::kernel::sys::raw::c_uchar;
pub type u_short = ::kernel::sys::raw::c_ushort;
pub type u_int = ::kernel::sys::raw::c_uint;
pub type u_long = ::kernel::sys::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type u_quad_t = __uint64_t;
pub type quad_t = __int64_t;
pub type qaddr_t = *mut quad_t;
pub type caddr_t = *mut ::kernel::sys::raw::c_char;
pub type c_caddr_t = *const ::kernel::sys::raw::c_char;
pub type blksize_t = __blksize_t;
pub type cpuwhich_t = __cpuwhich_t;
pub type cpulevel_t = __cpulevel_t;
pub type cpusetid_t = __cpusetid_t;
pub type blkcnt_t = __blkcnt_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type critical_t = __critical_t;
pub type daddr_t = __int64_t;
pub type dev_t = __dev_t;
pub type fflags_t = __fflags_t;
pub type fixpt_t = __fixpt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type gid_t = __gid_t;
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type id_t = __id_t;
pub type ino_t = __ino_t;
pub type key_t = __key_t;
pub type lwpid_t = __lwpid_t;
pub type mode_t = __mode_t;
pub type accmode_t = __accmode_t;
pub type nlink_t = __nlink_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type register_t = __register_t;
pub type rlim_t = __rlim_t;
pub type sbintime_t = __int64_t;
pub type segsz_t = __segsz_t;
pub type suseconds_t = __suseconds_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type mqd_t = __mqd_t;
pub type u_register_t = __u_register_t;
pub type uid_t = __uid_t;
pub type useconds_t = __useconds_t;
pub type cap_ioctl_t = ::kernel::sys::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cap_rights {
    _unused: [u8; 0],
}
pub type cap_rights_t = cap_rights;
pub type vm_offset_t = __vm_offset_t;
pub type vm_ooffset_t = __int64_t;
pub type vm_paddr_t = __vm_paddr_t;
pub type vm_pindex_t = __uint64_t;
pub type vm_size_t = __vm_size_t;
pub type rman_res_t = __rman_res_t;
pub type boolean_t = ::kernel::sys::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct device {
    _unused: [u8; 0],
}
pub type device_t = *mut device;
pub type intfptr_t = __intfptr_t;
pub type intrmask_t = __uint32_t;
pub type uintfptr_t = __uintfptr_t;
pub type uoff_t = __uint64_t;
pub type vm_memattr_t = ::kernel::sys::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_page {
    _unused: [u8; 0],
}
pub type vm_page_t = *mut vm_page;
pub type bool_ = bool;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct __sigset {
    pub __bits: [__uint32_t; 4usize],
}
#[test]
fn bindgen_test_layout___sigset() {
    assert_eq!(::core::mem::size_of::<__sigset>() , 16usize , concat ! (
               "Size of: " , stringify ! ( __sigset ) ));
    assert_eq! (::core::mem::align_of::<__sigset>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __sigset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sigset ) ) . __bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sigset ) , "::" ,
                stringify ! ( __bits ) ));
}
impl Clone for __sigset {
    fn clone(&self) -> Self { *self }
}
pub type __sigset_t = __sigset;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(::core::mem::size_of::<timeval>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timeval ) ));
    assert_eq! (::core::mem::align_of::<timeval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timeval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_usec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_usec ) ));
}
impl Clone for timeval {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::kernel::sys::raw::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::core::mem::size_of::<timespec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timespec ) ));
    assert_eq! (::core::mem::align_of::<timespec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timespec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_nsec ) ));
}
impl Clone for timespec {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(::core::mem::size_of::<itimerspec>() , 32usize , concat ! (
               "Size of: " , stringify ! ( itimerspec ) ));
    assert_eq! (::core::mem::align_of::<itimerspec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( itimerspec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_interval as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_interval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerspec ) ) . it_value as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerspec ) , "::" ,
                stringify ! ( it_value ) ));
}
impl Clone for itimerspec {
    fn clone(&self) -> Self { *self }
}
pub type __fd_mask = ::kernel::sys::raw::c_ulong;
pub type fd_mask = __fd_mask;
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(::core::mem::size_of::<fd_set>() , 128usize , concat ! (
               "Size of: " , stringify ! ( fd_set ) ));
    assert_eq! (::core::mem::align_of::<fd_set>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( fd_set ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fd_set ) ) . __fds_bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fd_set ) , "::" ,
                stringify ! ( __fds_bits ) ));
}
impl Clone for fd_set {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct timezone {
    pub tz_minuteswest: ::kernel::sys::raw::c_int,
    pub tz_dsttime: ::kernel::sys::raw::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    assert_eq!(::core::mem::size_of::<timezone>() , 8usize , concat ! (
               "Size of: " , stringify ! ( timezone ) ));
    assert_eq! (::core::mem::align_of::<timezone>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( timezone ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timezone ) ) . tz_minuteswest as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timezone ) , "::" ,
                stringify ! ( tz_minuteswest ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timezone ) ) . tz_dsttime as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( timezone ) , "::" ,
                stringify ! ( tz_dsttime ) ));
}
impl Clone for timezone {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct bintime {
    pub sec: time_t,
    pub frac: u64,
}
#[test]
fn bindgen_test_layout_bintime() {
    assert_eq!(::core::mem::size_of::<bintime>() , 16usize , concat ! (
               "Size of: " , stringify ! ( bintime ) ));
    assert_eq! (::core::mem::align_of::<bintime>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( bintime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const bintime ) ) . sec as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( bintime ) , "::" ,
                stringify ! ( sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const bintime ) ) . frac as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( bintime ) , "::" ,
                stringify ! ( frac ) ));
}
impl Clone for bintime {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    assert_eq!(::core::mem::size_of::<itimerval>() , 32usize , concat ! (
               "Size of: " , stringify ! ( itimerval ) ));
    assert_eq! (::core::mem::align_of::<itimerval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( itimerval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerval ) ) . it_interval as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerval ) , "::" ,
                stringify ! ( it_interval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const itimerval ) ) . it_value as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( itimerval ) , "::" ,
                stringify ! ( it_value ) ));
}
impl Clone for itimerval {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct clockinfo {
    pub hz: ::kernel::sys::raw::c_int,
    pub tick: ::kernel::sys::raw::c_int,
    pub spare: ::kernel::sys::raw::c_int,
    pub stathz: ::kernel::sys::raw::c_int,
    pub profhz: ::kernel::sys::raw::c_int,
}
#[test]
fn bindgen_test_layout_clockinfo() {
    assert_eq!(::core::mem::size_of::<clockinfo>() , 20usize , concat ! (
               "Size of: " , stringify ! ( clockinfo ) ));
    assert_eq! (::core::mem::align_of::<clockinfo>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( clockinfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . hz as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( hz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . tick as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( tick ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . spare as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( spare ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . stathz as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( stathz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const clockinfo ) ) . profhz as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( clockinfo ) , "::" ,
                stringify ! ( profhz ) ));
}
impl Clone for clockinfo {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn inittodr(base: time_t);
}
extern "C" {
    pub fn resettodr();
}
extern "C" {
    #[link_name = "time_second"]
    pub static mut time_second: time_t;
}
extern "C" {
    #[link_name = "time_uptime"]
    pub static mut time_uptime: time_t;
}
extern "C" {
    #[link_name = "tc_tick_bt"]
    pub static mut tc_tick_bt: bintime;
}
extern "C" {
    #[link_name = "tc_tick_sbt"]
    pub static mut tc_tick_sbt: sbintime_t;
}
extern "C" {
    #[link_name = "tick_bt"]
    pub static mut tick_bt: bintime;
}
extern "C" {
    #[link_name = "tick_sbt"]
    pub static mut tick_sbt: sbintime_t;
}
extern "C" {
    #[link_name = "tc_precexp"]
    pub static mut tc_precexp: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "tc_timepercentage"]
    pub static mut tc_timepercentage: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "bt_timethreshold"]
    pub static mut bt_timethreshold: bintime;
}
extern "C" {
    #[link_name = "bt_tickthreshold"]
    pub static mut bt_tickthreshold: bintime;
}
extern "C" {
    #[link_name = "sbt_timethreshold"]
    pub static mut sbt_timethreshold: sbintime_t;
}
extern "C" {
    #[link_name = "sbt_tickthreshold"]
    pub static mut sbt_tickthreshold: sbintime_t;
}
extern "C" {
    #[link_name = "rtc_generation"]
    pub static mut rtc_generation: ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn binuptime(bt: *mut bintime);
}
extern "C" {
    pub fn nanouptime(tsp: *mut timespec);
}
extern "C" {
    pub fn microuptime(tvp: *mut timeval);
}
extern "C" {
    pub fn bintime(bt: *mut bintime);
}
extern "C" {
    pub fn nanotime(tsp: *mut timespec);
}
extern "C" {
    pub fn microtime(tvp: *mut timeval);
}
extern "C" {
    pub fn getbinuptime(bt: *mut bintime);
}
extern "C" {
    pub fn getnanouptime(tsp: *mut timespec);
}
extern "C" {
    pub fn getmicrouptime(tvp: *mut timeval);
}
extern "C" {
    pub fn getbintime(bt: *mut bintime);
}
extern "C" {
    pub fn getnanotime(tsp: *mut timespec);
}
extern "C" {
    pub fn getmicrotime(tvp: *mut timeval);
}
extern "C" {
    pub fn getboottime(boottime: *mut timeval);
}
extern "C" {
    pub fn getboottimebin(boottimebin: *mut bintime);
}
extern "C" {
    pub fn itimerdecr(itp: *mut itimerval, usec: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn itimerfix(tv: *mut timeval) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn ppsratecheck(arg1: *mut timeval,
                        arg2: *mut ::kernel::sys::raw::c_int,
                        arg3: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn ratecheck(arg1: *mut timeval, arg2: *const timeval)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn timevaladd(t1: *mut timeval, t2: *const timeval);
}
extern "C" {
    pub fn timevalsub(t1: *mut timeval, t2: *const timeval);
}
extern "C" {
    pub fn tvtohz(tv: *mut timeval) -> ::kernel::sys::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct priority {
    pub pri_class: u_char,
    pub pri_level: u_char,
    pub pri_native: u_char,
    pub pri_user: u_char,
}
#[test]
fn bindgen_test_layout_priority() {
    assert_eq!(::core::mem::size_of::<priority>() , 4usize , concat ! (
               "Size of: " , stringify ! ( priority ) ));
    assert_eq! (::core::mem::align_of::<priority>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const priority ) ) . pri_class as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( priority ) , "::" ,
                stringify ! ( pri_class ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const priority ) ) . pri_level as * const _ as
                usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( priority ) , "::" ,
                stringify ! ( pri_level ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const priority ) ) . pri_native as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( priority ) , "::" ,
                stringify ! ( pri_native ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const priority ) ) . pri_user as * const _ as
                usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( priority ) , "::" ,
                stringify ! ( pri_user ) ));
}
impl Clone for priority {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn htonl(arg1: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn htons(arg1: __uint16_t) -> __uint16_t;
}
extern "C" {
    pub fn ntohl(arg1: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn ntohs(arg1: __uint16_t) -> __uint16_t;
}
extern "C" {
    pub fn atomic_cmpset_char(dst: *mut u_char, expect: u_char, src: u_char)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_cmpset_short(dst: *mut u_short, expect: u_short,
                               src: u_short) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_cmpset_int(dst: *mut u_int, expect: u_int, src: u_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_cmpset_long(dst: *mut u_long, expect: u_long, src: u_long)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_fcmpset_char(dst: *mut u_char, expect: *mut u_char,
                               src: u_char) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_fcmpset_short(dst: *mut u_short, expect: *mut u_short,
                                src: u_short) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_fcmpset_int(dst: *mut u_int, expect: *mut u_int, src: u_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_fcmpset_long(dst: *mut u_long, expect: *mut u_long,
                               src: u_long) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_fetchadd_int(p: *mut u_int, v: u_int) -> u_int;
}
extern "C" {
    pub fn atomic_fetchadd_long(p: *mut u_long, v: u_long) -> u_long;
}
extern "C" {
    pub fn atomic_testandset_int(p: *mut u_int, v: u_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_testandset_long(p: *mut u_long, v: u_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_testandclear_int(p: *mut u_int, v: u_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_testandclear_long(p: *mut u_long, v: u_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn atomic_thread_fence_acq();
}
extern "C" {
    pub fn atomic_thread_fence_acq_rel();
}
extern "C" {
    pub fn atomic_thread_fence_rel();
}
extern "C" {
    pub fn atomic_thread_fence_seq_cst();
}
extern "C" {
    pub fn atomic_set_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_set_barr_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_clear_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_clear_barr_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_add_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_add_barr_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_subtract_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_subtract_barr_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_set_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_set_barr_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_clear_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_clear_barr_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_add_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_add_barr_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_subtract_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_subtract_barr_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_set_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_set_barr_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_clear_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_clear_barr_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_add_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_add_barr_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_subtract_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_subtract_barr_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_set_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_set_barr_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_clear_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_clear_barr_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_add_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_add_barr_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_subtract_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_subtract_barr_long(p: *mut u_long, v: u_long);
}
extern "C" {
    pub fn atomic_load_acq_char(p: *mut u_char) -> u_char;
}
extern "C" {
    pub fn atomic_store_rel_char(p: *mut u_char, v: u_char);
}
extern "C" {
    pub fn atomic_load_acq_short(p: *mut u_short) -> u_short;
}
extern "C" {
    pub fn atomic_store_rel_short(p: *mut u_short, v: u_short);
}
extern "C" {
    pub fn atomic_load_acq_int(p: *mut u_int) -> u_int;
}
extern "C" {
    pub fn atomic_store_rel_int(p: *mut u_int, v: u_int);
}
extern "C" {
    pub fn atomic_load_acq_long(p: *mut u_long) -> u_long;
}
extern "C" {
    pub fn atomic_store_rel_long(p: *mut u_long, v: u_long);
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct region_descriptor {
    pub _bitfield_1: [u64; 2usize],
    pub __bindgen_align: [u8; 0usize],
}
#[test]
fn bindgen_test_layout_region_descriptor() {
    assert_eq!(::core::mem::size_of::<region_descriptor>() , 10usize , concat
               ! ( "Size of: " , stringify ! ( region_descriptor ) ));
    assert_eq! (::core::mem::align_of::<region_descriptor>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( region_descriptor ) ));
}
impl Clone for region_descriptor {
    fn clone(&self) -> Self { *self }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct invpcid_descr {
    pub _bitfield_1: u64,
    pub addr: u64,
}
#[test]
fn bindgen_test_layout_invpcid_descr() {
    assert_eq!(::core::mem::size_of::<invpcid_descr>() , 16usize , concat ! (
               "Size of: " , stringify ! ( invpcid_descr ) ));
    assert_eq! (::core::mem::align_of::<invpcid_descr>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( invpcid_descr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const invpcid_descr ) ) . addr as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( invpcid_descr ) , "::"
                , stringify ! ( addr ) ));
}
impl Clone for invpcid_descr {
    fn clone(&self) -> Self { *self }
}
impl invpcid_descr {
    #[inline]
    pub fn pcid(&self) -> u64 {
        let mut unit_field_val: u64 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u64
                                                 as *mut u8,
                                             ::core::mem::size_of::<u64>())
        };
        let mask = 4095u64 as u64;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::core::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_pcid(&mut self, val: u64) {
        let mask = 4095u64 as u64;
        let val = val as u64 as u64;
        let mut unit_field_val: u64 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u64
                                                 as *mut u8,
                                             ::core::mem::size_of::<u64>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u64>());
        }
    }
    #[inline]
    pub fn pad(&self) -> u64 {
        let mut unit_field_val: u64 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u64
                                                 as *mut u8,
                                             ::core::mem::size_of::<u64>())
        };
        let mask = 18446744073709547520u64 as u64;
        let val = (unit_field_val & mask) >> 12usize;
        unsafe { ::core::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_pad(&mut self, val: u64) {
        let mask = 18446744073709547520u64 as u64;
        let val = val as u64 as u64;
        let mut unit_field_val: u64 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u64
                                                 as *mut u8,
                                             ::core::mem::size_of::<u64>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 12usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u64>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(pcid: u64, pad: u64) -> u64 {
        ({ ({ 0 } | ((pcid as u64 as u64) << 0usize) & (4095u64 as u64)) } |
             ((pad as u64 as u64) << 12usize) &
                 (18446744073709547520u64 as u64))
    }
}
pub const SGX_ECREATE: _bindgen_ty_1 = _bindgen_ty_1::SGX_ECREATE;
pub const SGX_EADD: _bindgen_ty_1 = _bindgen_ty_1::SGX_EADD;
pub const SGX_EINIT: _bindgen_ty_1 = _bindgen_ty_1::SGX_EINIT;
pub const SGX_EREMOVE: _bindgen_ty_1 = _bindgen_ty_1::SGX_EREMOVE;
pub const SGX_EDGBRD: _bindgen_ty_1 = _bindgen_ty_1::SGX_EDGBRD;
pub const SGX_EDGBWR: _bindgen_ty_1 = _bindgen_ty_1::SGX_EDGBWR;
pub const SGX_EEXTEND: _bindgen_ty_1 = _bindgen_ty_1::SGX_EEXTEND;
pub const SGX_ELDU: _bindgen_ty_1 = _bindgen_ty_1::SGX_ELDU;
pub const SGX_EBLOCK: _bindgen_ty_1 = _bindgen_ty_1::SGX_EBLOCK;
pub const SGX_EPA: _bindgen_ty_1 = _bindgen_ty_1::SGX_EPA;
pub const SGX_EWB: _bindgen_ty_1 = _bindgen_ty_1::SGX_EWB;
pub const SGX_ETRACK: _bindgen_ty_1 = _bindgen_ty_1::SGX_ETRACK;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    SGX_ECREATE = 0,
    SGX_EADD = 1,
    SGX_EINIT = 2,
    SGX_EREMOVE = 3,
    SGX_EDGBRD = 4,
    SGX_EDGBWR = 5,
    SGX_EEXTEND = 6,
    SGX_ELDU = 8,
    SGX_EBLOCK = 9,
    SGX_EPA = 10,
    SGX_EWB = 11,
    SGX_ETRACK = 12,
}
pub const SGX_PT_SECS: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_SECS;
pub const SGX_PT_TCS: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_TCS;
pub const SGX_PT_REG: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_REG;
pub const SGX_PT_VA: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_VA;
pub const SGX_PT_TRIM: _bindgen_ty_2 = _bindgen_ty_2::SGX_PT_TRIM;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 {
    SGX_PT_SECS = 0,
    SGX_PT_TCS = 1,
    SGX_PT_REG = 2,
    SGX_PT_VA = 3,
    SGX_PT_TRIM = 4,
}
extern "C" {
    pub fn sgx_encls(eax: u32, rbx: u64, rcx: u64, rdx: u64)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn reset_dbregs();
}
extern "C" {
    pub fn rdmsr_safe(msr: u_int, val: *mut u64) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn wrmsr_safe(msr: u_int, newval: u64) -> ::kernel::sys::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct lock_object {
    pub lo_name: *const ::kernel::sys::raw::c_char,
    pub lo_flags: u_int,
    pub lo_data: u_int,
    pub lo_witness: *mut witness,
}
#[test]
fn bindgen_test_layout_lock_object() {
    assert_eq!(::core::mem::size_of::<lock_object>() , 24usize , concat ! (
               "Size of: " , stringify ! ( lock_object ) ));
    assert_eq! (::core::mem::align_of::<lock_object>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( lock_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_object ) ) . lo_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_object ) , "::" ,
                stringify ! ( lo_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_object ) ) . lo_flags as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_object ) , "::" ,
                stringify ! ( lo_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_object ) ) . lo_data as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_object ) , "::" ,
                stringify ! ( lo_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_object ) ) . lo_witness as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_object ) , "::" ,
                stringify ! ( lo_witness ) ));
}
impl Clone for lock_object {
    fn clone(&self) -> Self { *self }
}
impl Default for lock_object {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout_list {
    pub lh_first: *mut callout,
}
#[test]
fn bindgen_test_layout_callout_list() {
    assert_eq!(::core::mem::size_of::<callout_list>() , 8usize , concat ! (
               "Size of: " , stringify ! ( callout_list ) ));
    assert_eq! (::core::mem::align_of::<callout_list>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( callout_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_list ) ) . lh_first as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_list ) , "::" ,
                stringify ! ( lh_first ) ));
}
impl Clone for callout_list {
    fn clone(&self) -> Self { *self }
}
impl Default for callout_list {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout_slist {
    pub slh_first: *mut callout,
}
#[test]
fn bindgen_test_layout_callout_slist() {
    assert_eq!(::core::mem::size_of::<callout_slist>() , 8usize , concat ! (
               "Size of: " , stringify ! ( callout_slist ) ));
    assert_eq! (::core::mem::align_of::<callout_slist>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( callout_slist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_slist ) ) . slh_first as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_slist ) , "::"
                , stringify ! ( slh_first ) ));
}
impl Clone for callout_slist {
    fn clone(&self) -> Self { *self }
}
impl Default for callout_slist {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout_tailq {
    pub tqh_first: *mut callout,
    pub tqh_last: *mut *mut callout,
}
#[test]
fn bindgen_test_layout_callout_tailq() {
    assert_eq!(::core::mem::size_of::<callout_tailq>() , 16usize , concat ! (
               "Size of: " , stringify ! ( callout_tailq ) ));
    assert_eq! (::core::mem::align_of::<callout_tailq>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( callout_tailq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_tailq ) ) . tqh_first as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_tailq ) , "::"
                , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_tailq ) ) . tqh_last as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_tailq ) , "::"
                , stringify ! ( tqh_last ) ));
}
impl Clone for callout_tailq {
    fn clone(&self) -> Self { *self }
}
impl Default for callout_tailq {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct callout {
    pub c_links: callout__bindgen_ty_1,
    pub c_time: sbintime_t,
    pub c_precision: sbintime_t,
    pub c_arg: *mut ::kernel::sys::raw::c_void,
    pub c_func: ::core::option::Option<unsafe extern "C" fn(arg1:
                                                                *mut ::kernel::sys::raw::c_void)>,
    pub c_lock: *mut lock_object,
    pub c_flags: ::kernel::sys::raw::c_short,
    pub c_iflags: ::kernel::sys::raw::c_short,
    pub c_cpu: ::kernel::sys::raw::c_int,
}
#[repr(C)]
#[derive(Copy)]
pub union callout__bindgen_ty_1 {
    pub le: callout__bindgen_ty_1__bindgen_ty_1,
    pub sle: callout__bindgen_ty_1__bindgen_ty_2,
    pub tqe: callout__bindgen_ty_1__bindgen_ty_3,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout__bindgen_ty_1__bindgen_ty_1 {
    pub le_next: *mut callout,
    pub le_prev: *mut *mut callout,
}
#[test]
fn bindgen_test_layout_callout__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<callout__bindgen_ty_1__bindgen_ty_1>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( callout__bindgen_ty_1__bindgen_ty_1
               ) ));
    assert_eq! (::core::mem::align_of::<callout__bindgen_ty_1__bindgen_ty_1>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_1 ) ) .
                le_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! (
                le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_1 ) ) .
                le_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! (
                le_prev ) ));
}
impl Clone for callout__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for callout__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout__bindgen_ty_1__bindgen_ty_2 {
    pub sle_next: *mut callout,
}
#[test]
fn bindgen_test_layout_callout__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(::core::mem::size_of::<callout__bindgen_ty_1__bindgen_ty_2>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( callout__bindgen_ty_1__bindgen_ty_2
               ) ));
    assert_eq! (::core::mem::align_of::<callout__bindgen_ty_1__bindgen_ty_2>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_2 ) ) .
                sle_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! (
                sle_next ) ));
}
impl Clone for callout__bindgen_ty_1__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for callout__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout__bindgen_ty_1__bindgen_ty_3 {
    pub tqe_next: *mut callout,
    pub tqe_prev: *mut *mut callout,
}
#[test]
fn bindgen_test_layout_callout__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(::core::mem::size_of::<callout__bindgen_ty_1__bindgen_ty_3>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( callout__bindgen_ty_1__bindgen_ty_3
               ) ));
    assert_eq! (::core::mem::align_of::<callout__bindgen_ty_1__bindgen_ty_3>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_3 ) ) .
                tqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_3 ) , "::" , stringify ! (
                tqe_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1__bindgen_ty_3 ) ) .
                tqe_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                callout__bindgen_ty_1__bindgen_ty_3 ) , "::" , stringify ! (
                tqe_prev ) ));
}
impl Clone for callout__bindgen_ty_1__bindgen_ty_3 {
    fn clone(&self) -> Self { *self }
}
impl Default for callout__bindgen_ty_1__bindgen_ty_3 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_callout__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<callout__bindgen_ty_1>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( callout__bindgen_ty_1 )
               ));
    assert_eq! (::core::mem::align_of::<callout__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( callout__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1 ) ) . le as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout__bindgen_ty_1 )
                , "::" , stringify ! ( le ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1 ) ) . sle as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout__bindgen_ty_1 )
                , "::" , stringify ! ( sle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout__bindgen_ty_1 ) ) . tqe as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout__bindgen_ty_1 )
                , "::" , stringify ! ( tqe ) ));
}
impl Clone for callout__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for callout__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for callout__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f , "callout__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_callout() {
    assert_eq!(::core::mem::size_of::<callout>() , 64usize , concat ! (
               "Size of: " , stringify ! ( callout ) ));
    assert_eq! (::core::mem::align_of::<callout>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( callout ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_links as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_links ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_time as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_precision as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_precision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_arg as * const _ as usize
                } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_arg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_func as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_func ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_lock as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_flags as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_iflags as * const _ as
                usize } , 58usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_iflags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout ) ) . c_cpu as * const _ as usize
                } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( callout ) , "::" ,
                stringify ! ( c_cpu ) ));
}
impl Clone for callout {
    fn clone(&self) -> Self { *self }
}
impl Default for callout {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for callout {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f ,
               "callout {{ c_links: {:?}, c_time: {:?}, c_precision: {:?}, c_arg: {:?}, c_func: {:?}, c_lock: {:?}, c_flags: {:?}, c_iflags: {:?}, c_cpu: {:?} }}"
               , self . c_links , self . c_time , self . c_precision , self .
               c_arg , self . c_func , self . c_lock , self . c_flags , self .
               c_iflags , self . c_cpu)
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct callout_handle {
    pub callout: *mut callout,
}
#[test]
fn bindgen_test_layout_callout_handle() {
    assert_eq!(::core::mem::size_of::<callout_handle>() , 8usize , concat ! (
               "Size of: " , stringify ! ( callout_handle ) ));
    assert_eq! (::core::mem::align_of::<callout_handle>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( callout_handle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const callout_handle ) ) . callout as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( callout_handle ) , "::"
                , stringify ! ( callout ) ));
}
impl Clone for callout_handle {
    fn clone(&self) -> Self { *self }
}
impl Default for callout_handle {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
extern "C" {
    pub fn callout_init(arg1: *mut callout, arg2: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn _callout_init_lock(arg1: *mut callout, arg2: *mut lock_object,
                              arg3: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn callout_reset_sbt_on(arg1: *mut callout, arg2: sbintime_t,
                                arg3: sbintime_t,
                                arg4:
                                    ::core::option::Option<unsafe extern "C" fn(arg1:
                                                                                    *mut ::kernel::sys::raw::c_void)>,
                                arg5: *mut ::kernel::sys::raw::c_void,
                                arg6: ::kernel::sys::raw::c_int,
                                arg7: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn callout_schedule(arg1: *mut callout,
                            arg2: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn callout_schedule_on(arg1: *mut callout,
                               arg2: ::kernel::sys::raw::c_int,
                               arg3: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn _callout_stop_safe(arg1: *mut callout,
                              arg2: ::kernel::sys::raw::c_int,
                              arg3:
                                  ::core::option::Option<unsafe extern "C" fn(arg1:
                                                                                  *mut ::kernel::sys::raw::c_void)>)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn callout_process(now: sbintime_t);
}
extern "C" {
    pub fn callout_when(sbt: sbintime_t, precision: sbintime_t,
                        flags: ::kernel::sys::raw::c_int,
                        sbt_res: *mut sbintime_t, prec_res: *mut sbintime_t);
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = __int_fast8_t;
pub type int_fast16_t = __int_fast16_t;
pub type int_fast32_t = __int_fast32_t;
pub type int_fast64_t = __int_fast64_t;
pub type uint_fast8_t = __uint_fast8_t;
pub type uint_fast16_t = __uint_fast16_t;
pub type uint_fast32_t = __uint_fast32_t;
pub type uint_fast64_t = __uint_fast64_t;
extern "C" {
    #[link_name = "cold"]
    pub static mut cold: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "suspend_blocked"]
    pub static mut suspend_blocked: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "rebooting"]
    pub static mut rebooting: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "panicstr"]
    pub static mut panicstr: *const ::kernel::sys::raw::c_char;
}
extern "C" {
    #[link_name = "version"]
    pub static mut version: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "compiler_version"]
    pub static mut compiler_version: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "copyright"]
    pub static mut copyright: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "kstack_pages"]
    pub static mut kstack_pages: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "pagesizes"]
    pub static mut pagesizes: [u_long; 0usize];
}
extern "C" {
    #[link_name = "physmem"]
    pub static mut physmem: ::kernel::sys::raw::c_long;
}
extern "C" {
    #[link_name = "realmem"]
    pub static mut realmem: ::kernel::sys::raw::c_long;
}
extern "C" {
    #[link_name = "rootdevnames"]
    pub static mut rootdevnames: [*mut ::kernel::sys::raw::c_char; 2usize];
}
extern "C" {
    #[link_name = "boothowto"]
    pub static mut boothowto: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "bootverbose"]
    pub static mut bootverbose: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "maxusers"]
    pub static mut maxusers: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "ngroups_max"]
    pub static mut ngroups_max: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "vm_guest"]
    pub static mut vm_guest: ::kernel::sys::raw::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum VM_GUEST {
    VM_GUEST_NO = 0,
    VM_GUEST_VM = 1,
    VM_GUEST_XEN = 2,
    VM_GUEST_HV = 3,
    VM_GUEST_VMWARE = 4,
    VM_GUEST_KVM = 5,
    VM_GUEST_BHYVE = 6,
    VM_LAST = 7,
}
extern "C" {
    #[link_name = "osreldate"]
    pub static mut osreldate: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "envmode"]
    pub static mut envmode: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "hintmode"]
    pub static mut hintmode: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "dynamic_kenv"]
    pub static mut dynamic_kenv: ::kernel::sys::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct mtx {
    pub lock_object: lock_object,
    pub mtx_lock: usize,
}
#[test]
fn bindgen_test_layout_mtx() {
    assert_eq!(::core::mem::size_of::<mtx>() , 32usize , concat ! (
               "Size of: " , stringify ! ( mtx ) ));
    assert_eq! (::core::mem::align_of::<mtx>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( mtx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mtx ) ) . lock_object as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mtx ) , "::" ,
                stringify ! ( lock_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mtx ) ) . mtx_lock as * const _ as usize
                } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mtx ) , "::" ,
                stringify ! ( mtx_lock ) ));
}
impl Clone for mtx {
    fn clone(&self) -> Self { *self }
}
impl Default for mtx {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
extern "C" {
    #[link_name = "kenv_lock"]
    pub static mut kenv_lock: mtx;
}
extern "C" {
    #[link_name = "kern_envp"]
    pub static mut kern_envp: *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    #[link_name = "static_env"]
    pub static mut static_env: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "static_hints"]
    pub static mut static_hints: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "kenvp"]
    pub static mut kenvp: *mut *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    #[link_name = "zero_region"]
    pub static mut zero_region: *const ::kernel::sys::raw::c_void;
}
extern "C" {
    #[link_name = "unmapped_buf_allowed"]
    pub static mut unmapped_buf_allowed: ::kernel::sys::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct inpcb {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct malloc_type {
    pub ks_next: *mut malloc_type,
    pub ks_magic: u_long,
    pub ks_shortdesc: *const ::kernel::sys::raw::c_char,
    pub ks_handle: *mut ::kernel::sys::raw::c_void,
}
#[test]
fn bindgen_test_layout_malloc_type() {
    assert_eq!(::core::mem::size_of::<malloc_type>() , 32usize , concat ! (
               "Size of: " , stringify ! ( malloc_type ) ));
    assert_eq! (::core::mem::align_of::<malloc_type>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( malloc_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type ) ) . ks_next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type ) , "::" ,
                stringify ! ( ks_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type ) ) . ks_magic as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type ) , "::" ,
                stringify ! ( ks_magic ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type ) ) . ks_shortdesc as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type ) , "::" ,
                stringify ! ( ks_shortdesc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_type ) ) . ks_handle as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_type ) , "::" ,
                stringify ! ( ks_handle ) ));
}
impl Clone for malloc_type {
    fn clone(&self) -> Self { *self }
}
impl Default for malloc_type {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct proc_ {
    pub p_list: proc__bindgen_ty_1,
    pub p_threads: proc__bindgen_ty_2,
    pub p_slock: mtx,
    pub p_ucred: *mut ucred,
    pub p_fd: *mut filedesc,
    pub p_fdtol: *mut filedesc_to_leader,
    pub p_stats: *mut pstats,
    pub p_limit: *mut plimit,
    pub p_limco: callout,
    pub p_sigacts: *mut sigacts,
    pub p_flag: ::kernel::sys::raw::c_int,
    pub p_flag2: ::kernel::sys::raw::c_int,
    pub p_state: proc__bindgen_ty_3,
    pub p_pid: pid_t,
    pub p_hash: proc__bindgen_ty_4,
    pub p_pglist: proc__bindgen_ty_5,
    pub p_pptr: *mut proc_,
    pub p_sibling: proc__bindgen_ty_6,
    pub p_children: proc__bindgen_ty_7,
    pub p_reaper: *mut proc_,
    pub p_reaplist: proc__bindgen_ty_8,
    pub p_reapsibling: proc__bindgen_ty_9,
    pub p_mtx: mtx,
    pub p_statmtx: mtx,
    pub p_itimmtx: mtx,
    pub p_profmtx: mtx,
    pub p_ksi: *mut ksiginfo,
    pub p_sigqueue: sigqueue_t,
    pub p_oppid: pid_t,
    pub p_vmspace: *mut vmspace,
    pub p_swtick: u_int,
    pub p_cowgen: u_int,
    pub p_realtimer: itimerval,
    pub p_ru: rusage,
    pub p_rux: rusage_ext,
    pub p_crux: rusage_ext,
    pub p_profthreads: ::kernel::sys::raw::c_int,
    pub p_exitthreads: ::kernel::sys::raw::c_int,
    pub p_traceflag: ::kernel::sys::raw::c_int,
    pub p_tracevp: *mut vnode,
    pub p_tracecred: *mut ucred,
    pub p_textvp: *mut vnode,
    pub p_lock: u_int,
    pub p_sigiolst: sigiolst,
    pub p_sigparent: ::kernel::sys::raw::c_int,
    pub p_sig: ::kernel::sys::raw::c_int,
    pub p_code: u_long,
    pub p_stops: u_int,
    pub p_stype: u_int,
    pub p_step: ::kernel::sys::raw::c_char,
    pub p_pfsflags: u_char,
    pub p_ptevents: u_int,
    pub p_nlminfo: *mut nlminfo,
    pub p_aioinfo: *mut kaioinfo,
    pub p_singlethread: *mut thread,
    pub p_suspcount: ::kernel::sys::raw::c_int,
    pub p_xthread: *mut thread,
    pub p_boundary_count: ::kernel::sys::raw::c_int,
    pub p_pendingcnt: ::kernel::sys::raw::c_int,
    pub p_itimers: *mut itimers,
    pub p_procdesc: *mut procdesc,
    pub p_treeflag: u_int,
    pub p_pendingexits: ::kernel::sys::raw::c_int,
    pub p_filemon: *mut filemon,
    pub p_pdeathsig: ::kernel::sys::raw::c_int,
    pub p_magic: u_int,
    pub p_osrel: ::kernel::sys::raw::c_int,
    pub p_comm: [::kernel::sys::raw::c_char; 20usize],
    pub p_sysent: *mut sysentvec,
    pub p_args: *mut pargs,
    pub p_cpulimit: rlim_t,
    pub p_nice: ::kernel::sys::raw::c_schar,
    pub p_fibnum: ::kernel::sys::raw::c_int,
    pub p_reapsubtree: pid_t,
    pub p_elf_machine: u16,
    pub p_elf_flags: u64,
    pub p_xexit: u_int,
    pub p_xsig: u_int,
    pub p_pgrp: *mut pgrp,
    pub p_klist: *mut knlist,
    pub p_numthreads: ::kernel::sys::raw::c_int,
    pub p_md: mdproc,
    pub p_itcallout: callout,
    pub p_acflag: u_short,
    pub p_peers: *mut proc_,
    pub p_leader: *mut proc_,
    pub p_emuldata: *mut ::kernel::sys::raw::c_void,
    pub p_label: *mut label,
    pub p_ktr: proc__bindgen_ty_10,
    pub p_mqnotifier: proc__bindgen_ty_11,
    pub p_dtrace: *mut kdtrace_proc,
    pub p_pwait: cv,
    pub p_dbgwait: cv,
    pub p_prev_runtime: u64,
    pub p_racct: *mut racct,
    pub p_throttled: ::kernel::sys::raw::c_int,
    pub p_orphan: proc__bindgen_ty_12,
    pub p_orphans: proc__bindgen_ty_13,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_1 {
    pub le_next: *mut proc_,
    pub le_prev: *mut *mut proc_,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_1>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_1 ) ) . le_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_1 ) ,
                "::" , stringify ! ( le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_1 ) ) . le_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_1 ) ,
                "::" , stringify ! ( le_prev ) ));
}
impl Clone for proc__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_2 {
    pub tqh_first: *mut thread,
    pub tqh_last: *mut *mut thread,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_2() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_2>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_2 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_2>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_2 ) ) . tqh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_2 ) ,
                "::" , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_2 ) ) . tqh_last as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_2 ) ,
                "::" , stringify ! ( tqh_last ) ));
}
impl Clone for proc__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
pub const proc__PRS_NEW: proc__bindgen_ty_3 = proc__bindgen_ty_3::PRS_NEW;
pub const proc__PRS_NORMAL: proc__bindgen_ty_3 =
    proc__bindgen_ty_3::PRS_NORMAL;
pub const proc__PRS_ZOMBIE: proc__bindgen_ty_3 =
    proc__bindgen_ty_3::PRS_ZOMBIE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum proc__bindgen_ty_3 { PRS_NEW = 0, PRS_NORMAL = 1, PRS_ZOMBIE = 2, }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_4 {
    pub le_next: *mut proc_,
    pub le_prev: *mut *mut proc_,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_4() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_4>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_4 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_4>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_4 ) ) . le_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_4 ) ,
                "::" , stringify ! ( le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_4 ) ) . le_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_4 ) ,
                "::" , stringify ! ( le_prev ) ));
}
impl Clone for proc__bindgen_ty_4 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_4 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_5 {
    pub le_next: *mut proc_,
    pub le_prev: *mut *mut proc_,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_5() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_5>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_5 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_5>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_5 ) ) . le_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_5 ) ,
                "::" , stringify ! ( le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_5 ) ) . le_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_5 ) ,
                "::" , stringify ! ( le_prev ) ));
}
impl Clone for proc__bindgen_ty_5 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_5 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_6 {
    pub le_next: *mut proc_,
    pub le_prev: *mut *mut proc_,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_6() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_6>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_6 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_6>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_6 ) ) . le_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_6 ) ,
                "::" , stringify ! ( le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_6 ) ) . le_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_6 ) ,
                "::" , stringify ! ( le_prev ) ));
}
impl Clone for proc__bindgen_ty_6 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_6 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_7 {
    pub lh_first: *mut proc_,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_7() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_7>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_7 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_7>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_7 ) ) . lh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_7 ) ,
                "::" , stringify ! ( lh_first ) ));
}
impl Clone for proc__bindgen_ty_7 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_7 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_8 {
    pub lh_first: *mut proc_,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_8() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_8>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_8 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_8>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_8 ) ) . lh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_8 ) ,
                "::" , stringify ! ( lh_first ) ));
}
impl Clone for proc__bindgen_ty_8 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_8 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_9 {
    pub le_next: *mut proc_,
    pub le_prev: *mut *mut proc_,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_9() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_9>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_9 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_9>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_9 ) ) . le_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_9 ) ,
                "::" , stringify ! ( le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_9 ) ) . le_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_9 ) ,
                "::" , stringify ! ( le_prev ) ));
}
impl Clone for proc__bindgen_ty_9 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_9 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_10 {
    pub stqh_first: *mut ktr_request,
    pub stqh_last: *mut *mut ktr_request,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_10() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_10>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( proc__bindgen_ty_10 )
               ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_10>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_10 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_10 ) ) . stqh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_10 ) ,
                "::" , stringify ! ( stqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_10 ) ) . stqh_last as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_10 ) ,
                "::" , stringify ! ( stqh_last ) ));
}
impl Clone for proc__bindgen_ty_10 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_10 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_11 {
    pub lh_first: *mut mqueue_notifier,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_11() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_11>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_11 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_11>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_11 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_11 ) ) . lh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_11 ) ,
                "::" , stringify ! ( lh_first ) ));
}
impl Clone for proc__bindgen_ty_11 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_11 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_12 {
    pub le_next: *mut proc_,
    pub le_prev: *mut *mut proc_,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_12() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_12>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( proc__bindgen_ty_12 )
               ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_12>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_12 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_12 ) ) . le_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_12 ) ,
                "::" , stringify ! ( le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_12 ) ) . le_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_12 ) ,
                "::" , stringify ! ( le_prev ) ));
}
impl Clone for proc__bindgen_ty_12 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_12 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct proc__bindgen_ty_13 {
    pub lh_first: *mut proc_,
}
#[test]
fn bindgen_test_layout_proc__bindgen_ty_13() {
    assert_eq!(::core::mem::size_of::<proc__bindgen_ty_13>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( proc__bindgen_ty_13 ) ));
    assert_eq! (::core::mem::align_of::<proc__bindgen_ty_13>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( proc__bindgen_ty_13 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc__bindgen_ty_13 ) ) . lh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc__bindgen_ty_13 ) ,
                "::" , stringify ! ( lh_first ) ));
}
impl Clone for proc__bindgen_ty_13 {
    fn clone(&self) -> Self { *self }
}
impl Default for proc__bindgen_ty_13 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_proc_() {
    assert_eq!(::core::mem::size_of::<proc_>() , 1336usize , concat ! (
               "Size of: " , stringify ! ( proc_ ) ));
    assert_eq! (::core::mem::align_of::<proc_>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( proc_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_list as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_threads as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_threads ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_slock as * const _ as usize
                } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_slock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_ucred as * const _ as usize
                } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_ucred ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_fd as * const _ as usize }
                , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_fd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_fdtol as * const _ as usize
                } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_fdtol ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_stats as * const _ as usize
                } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_stats ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_limit as * const _ as usize
                } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_limit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_limco as * const _ as usize
                } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_limco ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_sigacts as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_sigacts ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_flag as * const _ as usize
                } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_flag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_flag2 as * const _ as usize
                } , 180usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_flag2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_state as * const _ as usize
                } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_pid as * const _ as usize }
                , 188usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_pid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_hash as * const _ as usize
                } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_hash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_pglist as * const _ as
                usize } , 208usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_pglist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_pptr as * const _ as usize
                } , 224usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_pptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_sibling as * const _ as
                usize } , 232usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_sibling ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_children as * const _ as
                usize } , 248usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_children ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_reaper as * const _ as
                usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_reaper ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_reaplist as * const _ as
                usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_reaplist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_reapsibling as * const _ as
                usize } , 272usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_reapsibling ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_mtx as * const _ as usize }
                , 288usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_mtx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_statmtx as * const _ as
                usize } , 320usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_statmtx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_itimmtx as * const _ as
                usize } , 352usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_itimmtx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_profmtx as * const _ as
                usize } , 384usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_profmtx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_ksi as * const _ as usize }
                , 416usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_ksi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_sigqueue as * const _ as
                usize } , 424usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_sigqueue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_oppid as * const _ as usize
                } , 504usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_oppid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_vmspace as * const _ as
                usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_vmspace ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_swtick as * const _ as
                usize } , 520usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_swtick ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_cowgen as * const _ as
                usize } , 524usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_cowgen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_realtimer as * const _ as
                usize } , 528usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_realtimer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_ru as * const _ as usize }
                , 560usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_ru ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_rux as * const _ as usize }
                , 704usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_rux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_crux as * const _ as usize
                } , 760usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_crux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_profthreads as * const _ as
                usize } , 816usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_profthreads ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_exitthreads as * const _ as
                usize } , 820usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_exitthreads ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_traceflag as * const _ as
                usize } , 824usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_traceflag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_tracevp as * const _ as
                usize } , 832usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_tracevp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_tracecred as * const _ as
                usize } , 840usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_tracecred ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_textvp as * const _ as
                usize } , 848usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_textvp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_lock as * const _ as usize
                } , 856usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_sigiolst as * const _ as
                usize } , 864usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_sigiolst ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_sigparent as * const _ as
                usize } , 872usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_sigparent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_sig as * const _ as usize }
                , 876usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_sig ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_code as * const _ as usize
                } , 880usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_code ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_stops as * const _ as usize
                } , 888usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_stops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_stype as * const _ as usize
                } , 892usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_stype ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_step as * const _ as usize
                } , 896usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_step ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_pfsflags as * const _ as
                usize } , 897usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_pfsflags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_ptevents as * const _ as
                usize } , 900usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_ptevents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_nlminfo as * const _ as
                usize } , 904usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_nlminfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_aioinfo as * const _ as
                usize } , 912usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_aioinfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_singlethread as * const _
                as usize } , 920usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_singlethread ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_suspcount as * const _ as
                usize } , 928usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_suspcount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_xthread as * const _ as
                usize } , 936usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_xthread ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_boundary_count as * const _
                as usize } , 944usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_boundary_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_pendingcnt as * const _ as
                usize } , 948usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_pendingcnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_itimers as * const _ as
                usize } , 952usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_itimers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_procdesc as * const _ as
                usize } , 960usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_procdesc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_treeflag as * const _ as
                usize } , 968usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_treeflag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_pendingexits as * const _
                as usize } , 972usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_pendingexits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_filemon as * const _ as
                usize } , 976usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_filemon ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_pdeathsig as * const _ as
                usize } , 984usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_pdeathsig ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_magic as * const _ as usize
                } , 988usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_magic ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_osrel as * const _ as usize
                } , 992usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_osrel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_comm as * const _ as usize
                } , 996usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_comm ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_sysent as * const _ as
                usize } , 1016usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_sysent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_args as * const _ as usize
                } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_args ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_cpulimit as * const _ as
                usize } , 1032usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_cpulimit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_nice as * const _ as usize
                } , 1040usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_nice ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_fibnum as * const _ as
                usize } , 1044usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_fibnum ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_reapsubtree as * const _ as
                usize } , 1048usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_reapsubtree ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_elf_machine as * const _ as
                usize } , 1052usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_elf_machine ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_elf_flags as * const _ as
                usize } , 1056usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_elf_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_xexit as * const _ as usize
                } , 1064usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_xexit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_xsig as * const _ as usize
                } , 1068usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_xsig ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_pgrp as * const _ as usize
                } , 1072usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_pgrp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_klist as * const _ as usize
                } , 1080usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_klist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_numthreads as * const _ as
                usize } , 1088usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_numthreads ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_md as * const _ as usize }
                , 1096usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_md ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_itcallout as * const _ as
                usize } , 1120usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_itcallout ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_acflag as * const _ as
                usize } , 1184usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_acflag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_peers as * const _ as usize
                } , 1192usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_peers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_leader as * const _ as
                usize } , 1200usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_leader ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_emuldata as * const _ as
                usize } , 1208usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_emuldata ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_label as * const _ as usize
                } , 1216usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_label ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_ktr as * const _ as usize }
                , 1224usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_ktr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_mqnotifier as * const _ as
                usize } , 1240usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_mqnotifier ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_dtrace as * const _ as
                usize } , 1248usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_dtrace ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_pwait as * const _ as usize
                } , 1256usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_pwait ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_dbgwait as * const _ as
                usize } , 1272usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_dbgwait ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_prev_runtime as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_prev_runtime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_racct as * const _ as usize
                } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_racct ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_throttled as * const _ as
                usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_throttled ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_orphan as * const _ as
                usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_orphan ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const proc_ ) ) . p_orphans as * const _ as
                usize } , 1328usize , concat ! (
                "Alignment of field: " , stringify ! ( proc_ ) , "::" ,
                stringify ! ( p_orphans ) ));
}
impl Clone for proc_ {
    fn clone(&self) -> Self { *self }
}
impl Default for proc_ {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for proc_ {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f ,
               "proc_ {{ p_list: {:?}, p_threads: {:?}, p_slock: {:?}, p_ucred: {:?}, p_fd: {:?}, p_fdtol: {:?}, p_stats: {:?}, p_limit: {:?}, p_limco: {:?}, p_sigacts: {:?}, p_flag: {:?}, p_flag2: {:?}, p_state: {:?}, p_pid: {:?}, p_hash: {:?}, p_pglist: {:?}, p_pptr: {:?}, p_sibling: {:?}, p_children: {:?}, p_reaper: {:?}, p_reaplist: {:?}, p_reapsibling: {:?}, p_mtx: {:?}, p_statmtx: {:?}, p_itimmtx: {:?}, p_profmtx: {:?}, p_ksi: {:?}, p_sigqueue: {:?}, p_oppid: {:?}, p_vmspace: {:?}, p_swtick: {:?}, p_cowgen: {:?}, p_realtimer: {:?}, p_ru: {:?}, p_rux: {:?}, p_crux: {:?}, p_profthreads: {:?}, p_exitthreads: {:?}, p_traceflag: {:?}, p_tracevp: {:?}, p_tracecred: {:?}, p_textvp: {:?}, p_lock: {:?}, p_sigiolst: {:?}, p_sigparent: {:?}, p_sig: {:?}, p_code: {:?}, p_stops: {:?}, p_stype: {:?}, p_step: {:?}, p_pfsflags: {:?}, p_ptevents: {:?}, p_nlminfo: {:?}, p_aioinfo: {:?}, p_singlethread: {:?}, p_suspcount: {:?}, p_xthread: {:?}, p_boundary_count: {:?}, p_pendingcnt: {:?}, p_itimers: {:?}, p_procdesc: {:?}, p_treeflag: {:?}, p_pendingexits: {:?}, p_filemon: {:?}, p_pdeathsig: {:?}, p_magic: {:?}, p_osrel: {:?}, p_comm: {:?}, p_sysent: {:?}, p_args: {:?}, p_cpulimit: {:?}, p_nice: {:?}, p_fibnum: {:?}, p_reapsubtree: {:?}, p_elf_machine: {:?}, p_elf_flags: {:?}, p_xexit: {:?}, p_xsig: {:?}, p_pgrp: {:?}, p_klist: {:?}, p_numthreads: {:?}, p_md: {:?}, p_itcallout: {:?}, p_acflag: {:?}, p_peers: {:?}, p_leader: {:?}, p_emuldata: {:?}, p_label: {:?}, p_ktr: {:?}, p_mqnotifier: {:?}, p_dtrace: {:?}, p_pwait: {:?}, p_dbgwait: {:?}, p_prev_runtime: {:?}, p_racct: {:?}, p_throttled: {:?}, p_orphan: {:?}, p_orphans: {:?} }}"
               , self . p_list , self . p_threads , self . p_slock , self .
               p_ucred , self . p_fd , self . p_fdtol , self . p_stats , self
               . p_limit , self . p_limco , self . p_sigacts , self . p_flag ,
               self . p_flag2 , self . p_state , self . p_pid , self . p_hash
               , self . p_pglist , self . p_pptr , self . p_sibling , self .
               p_children , self . p_reaper , self . p_reaplist , self .
               p_reapsibling , self . p_mtx , self . p_statmtx , self .
               p_itimmtx , self . p_profmtx , self . p_ksi , self . p_sigqueue
               , self . p_oppid , self . p_vmspace , self . p_swtick , self .
               p_cowgen , self . p_realtimer , self . p_ru , self . p_rux ,
               self . p_crux , self . p_profthreads , self . p_exitthreads ,
               self . p_traceflag , self . p_tracevp , self . p_tracecred ,
               self . p_textvp , self . p_lock , self . p_sigiolst , self .
               p_sigparent , self . p_sig , self . p_code , self . p_stops ,
               self . p_stype , self . p_step , self . p_pfsflags , self .
               p_ptevents , self . p_nlminfo , self . p_aioinfo , self .
               p_singlethread , self . p_suspcount , self . p_xthread , self .
               p_boundary_count , self . p_pendingcnt , self . p_itimers ,
               self . p_procdesc , self . p_treeflag , self . p_pendingexits ,
               self . p_filemon , self . p_pdeathsig , self . p_magic , self .
               p_osrel , self . p_comm , self . p_sysent , self . p_args ,
               self . p_cpulimit , self . p_nice , self . p_fibnum , self .
               p_reapsubtree , self . p_elf_machine , self . p_elf_flags ,
               self . p_xexit , self . p_xsig , self . p_pgrp , self . p_klist
               , self . p_numthreads , self . p_md , self . p_itcallout , self
               . p_acflag , self . p_peers , self . p_leader , self .
               p_emuldata , self . p_label , self . p_ktr , self .
               p_mqnotifier , self . p_dtrace , self . p_pwait , self .
               p_dbgwait , self . p_prev_runtime , self . p_racct , self .
               p_throttled , self . p_orphan , self . p_orphans)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct socket {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy)]
pub struct thread {
    pub td_lock: *mut mtx,
    pub td_proc: *mut proc_,
    pub td_plist: thread__bindgen_ty_1,
    pub td_runq: thread__bindgen_ty_2,
    pub td_slpq: thread__bindgen_ty_3,
    pub td_lockq: thread__bindgen_ty_4,
    pub td_hash: thread__bindgen_ty_5,
    pub td_cpuset: *mut cpuset,
    pub td_domain: domainset_ref,
    pub td_sel: *mut seltd,
    pub td_sleepqueue: *mut sleepqueue,
    pub td_turnstile: *mut turnstile,
    pub td_rlqe: *mut rl_q_entry,
    pub td_umtxq: *mut umtx_q,
    pub td_tid: lwpid_t,
    pub td_sigqueue: sigqueue_t,
    pub td_lend_user_pri: u_char,
    pub td_epochnest: u_char,
    pub td_flags: ::kernel::sys::raw::c_int,
    pub td_inhibitors: ::kernel::sys::raw::c_int,
    pub td_pflags: ::kernel::sys::raw::c_int,
    pub td_dupfd: ::kernel::sys::raw::c_int,
    pub td_sqqueue: ::kernel::sys::raw::c_int,
    pub td_wchan: *mut ::kernel::sys::raw::c_void,
    pub td_wmesg: *const ::kernel::sys::raw::c_char,
    pub td_owepreempt: u_char,
    pub td_tsqueue: u_char,
    pub td_locks: ::kernel::sys::raw::c_short,
    pub td_rw_rlocks: ::kernel::sys::raw::c_short,
    pub td_sx_slocks: ::kernel::sys::raw::c_short,
    pub td_lk_slocks: ::kernel::sys::raw::c_short,
    pub td_stopsched: ::kernel::sys::raw::c_short,
    pub td_blocked: *mut turnstile,
    pub td_lockname: *const ::kernel::sys::raw::c_char,
    pub td_contested: thread__bindgen_ty_6,
    pub td_sleeplocks: *mut lock_list_entry,
    pub td_intr_nesting_level: ::kernel::sys::raw::c_int,
    pub td_pinned: ::kernel::sys::raw::c_int,
    pub td_ucred: *mut ucred,
    pub td_limit: *mut plimit,
    pub td_slptick: ::kernel::sys::raw::c_int,
    pub td_blktick: ::kernel::sys::raw::c_int,
    pub td_swvoltick: ::kernel::sys::raw::c_int,
    pub td_swinvoltick: ::kernel::sys::raw::c_int,
    pub td_cow: u_int,
    pub td_ru: rusage,
    pub td_rux: rusage_ext,
    pub td_incruntime: u64,
    pub td_runtime: u64,
    pub td_pticks: u_int,
    pub td_sticks: u_int,
    pub td_iticks: u_int,
    pub td_uticks: u_int,
    pub td_intrval: ::kernel::sys::raw::c_int,
    pub td_oldsigmask: sigset_t,
    pub td_generation: u_int,
    pub td_sigstk: stack_t,
    pub td_xsig: ::kernel::sys::raw::c_int,
    pub td_profil_addr: u_long,
    pub td_profil_ticks: u_int,
    pub td_name: [::kernel::sys::raw::c_char; 20usize],
    pub td_fpop: *mut file,
    pub td_dbgflags: ::kernel::sys::raw::c_int,
    pub td_si: siginfo_t,
    pub td_ng_outbound: ::kernel::sys::raw::c_int,
    pub td_osd: osd,
    pub td_map_def_user: *mut vm_map_entry,
    pub td_dbg_forked: pid_t,
    pub td_vp_reserv: u_int,
    pub td_no_sleeping: ::kernel::sys::raw::c_int,
    pub td_su: *mut ::kernel::sys::raw::c_void,
    pub td_sleeptimo: sbintime_t,
    pub td_rtcgen: ::kernel::sys::raw::c_int,
    pub td_vslock_sz: usize,
    pub td_sigmask: sigset_t,
    pub td_rqindex: u_char,
    pub td_base_pri: u_char,
    pub td_priority: u_char,
    pub td_pri_class: u_char,
    pub td_user_pri: u_char,
    pub td_base_user_pri: u_char,
    pub td_pre_epoch_prio: u_char,
    pub td_rb_list: usize,
    pub td_rbp_list: usize,
    pub td_rb_inact: usize,
    pub td_sa: syscall_args,
    pub td_pcb: *mut pcb,
    pub td_state: thread__bindgen_ty_7,
    pub td_uretoff: thread__bindgen_ty_8,
    pub td_cowgen: u_int,
    pub td_slpcallout: callout,
    pub td_frame: *mut trapframe,
    pub td_kstack_obj: *mut vm_object,
    pub td_kstack: vm_offset_t,
    pub td_kstack_pages: ::kernel::sys::raw::c_int,
    pub td_critnest: u_int,
    pub td_md: mdthread,
    pub td_ar: *mut kaudit_record,
    pub td_lprof: [lpohead; 2usize],
    pub td_dtrace: *mut kdtrace_thread,
    pub td_errno: ::kernel::sys::raw::c_int,
    pub td_vnet: *mut vnet,
    pub td_vnet_lpush: *const ::kernel::sys::raw::c_char,
    pub td_intr_frame: *mut trapframe,
    pub td_rfppwait_p: *mut proc_,
    pub td_ma: *mut *mut vm_page,
    pub td_ma_cnt: ::kernel::sys::raw::c_int,
    pub td_emuldata: *mut ::kernel::sys::raw::c_void,
    pub td_lastcpu: ::kernel::sys::raw::c_int,
    pub td_oncpu: ::kernel::sys::raw::c_int,
    pub td_lkpi_task: *mut ::kernel::sys::raw::c_void,
    pub td_epochq: thread__bindgen_ty_9,
    pub td_epoch_section: epoch_section_t,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct thread__bindgen_ty_1 {
    pub tqe_next: *mut thread,
    pub tqe_prev: *mut *mut thread,
}
#[test]
fn bindgen_test_layout_thread__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<thread__bindgen_ty_1>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( thread__bindgen_ty_1 )
               ));
    assert_eq! (::core::mem::align_of::<thread__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( thread__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_1 ) ) . tqe_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_1 )
                , "::" , stringify ! ( tqe_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_1 ) ) . tqe_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_1 )
                , "::" , stringify ! ( tqe_prev ) ));
}
impl Clone for thread__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for thread__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct thread__bindgen_ty_2 {
    pub tqe_next: *mut thread,
    pub tqe_prev: *mut *mut thread,
}
#[test]
fn bindgen_test_layout_thread__bindgen_ty_2() {
    assert_eq!(::core::mem::size_of::<thread__bindgen_ty_2>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( thread__bindgen_ty_2 )
               ));
    assert_eq! (::core::mem::align_of::<thread__bindgen_ty_2>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( thread__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_2 ) ) . tqe_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_2 )
                , "::" , stringify ! ( tqe_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_2 ) ) . tqe_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_2 )
                , "::" , stringify ! ( tqe_prev ) ));
}
impl Clone for thread__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for thread__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct thread__bindgen_ty_3 {
    pub tqe_next: *mut thread,
    pub tqe_prev: *mut *mut thread,
}
#[test]
fn bindgen_test_layout_thread__bindgen_ty_3() {
    assert_eq!(::core::mem::size_of::<thread__bindgen_ty_3>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( thread__bindgen_ty_3 )
               ));
    assert_eq! (::core::mem::align_of::<thread__bindgen_ty_3>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( thread__bindgen_ty_3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_3 ) ) . tqe_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_3 )
                , "::" , stringify ! ( tqe_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_3 ) ) . tqe_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_3 )
                , "::" , stringify ! ( tqe_prev ) ));
}
impl Clone for thread__bindgen_ty_3 {
    fn clone(&self) -> Self { *self }
}
impl Default for thread__bindgen_ty_3 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct thread__bindgen_ty_4 {
    pub tqe_next: *mut thread,
    pub tqe_prev: *mut *mut thread,
}
#[test]
fn bindgen_test_layout_thread__bindgen_ty_4() {
    assert_eq!(::core::mem::size_of::<thread__bindgen_ty_4>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( thread__bindgen_ty_4 )
               ));
    assert_eq! (::core::mem::align_of::<thread__bindgen_ty_4>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( thread__bindgen_ty_4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_4 ) ) . tqe_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_4 )
                , "::" , stringify ! ( tqe_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_4 ) ) . tqe_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_4 )
                , "::" , stringify ! ( tqe_prev ) ));
}
impl Clone for thread__bindgen_ty_4 {
    fn clone(&self) -> Self { *self }
}
impl Default for thread__bindgen_ty_4 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct thread__bindgen_ty_5 {
    pub le_next: *mut thread,
    pub le_prev: *mut *mut thread,
}
#[test]
fn bindgen_test_layout_thread__bindgen_ty_5() {
    assert_eq!(::core::mem::size_of::<thread__bindgen_ty_5>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( thread__bindgen_ty_5 )
               ));
    assert_eq! (::core::mem::align_of::<thread__bindgen_ty_5>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( thread__bindgen_ty_5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_5 ) ) . le_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_5 )
                , "::" , stringify ! ( le_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_5 ) ) . le_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_5 )
                , "::" , stringify ! ( le_prev ) ));
}
impl Clone for thread__bindgen_ty_5 {
    fn clone(&self) -> Self { *self }
}
impl Default for thread__bindgen_ty_5 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct thread__bindgen_ty_6 {
    pub lh_first: *mut turnstile,
}
#[test]
fn bindgen_test_layout_thread__bindgen_ty_6() {
    assert_eq!(::core::mem::size_of::<thread__bindgen_ty_6>() , 8usize ,
               concat ! ( "Size of: " , stringify ! ( thread__bindgen_ty_6 )
               ));
    assert_eq! (::core::mem::align_of::<thread__bindgen_ty_6>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( thread__bindgen_ty_6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_6 ) ) . lh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_6 )
                , "::" , stringify ! ( lh_first ) ));
}
impl Clone for thread__bindgen_ty_6 {
    fn clone(&self) -> Self { *self }
}
impl Default for thread__bindgen_ty_6 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
pub const thread_TDS_INACTIVE: thread__bindgen_ty_7 =
    thread__bindgen_ty_7::TDS_INACTIVE;
pub const thread_TDS_INHIBITED: thread__bindgen_ty_7 =
    thread__bindgen_ty_7::TDS_INHIBITED;
pub const thread_TDS_CAN_RUN: thread__bindgen_ty_7 =
    thread__bindgen_ty_7::TDS_CAN_RUN;
pub const thread_TDS_RUNQ: thread__bindgen_ty_7 =
    thread__bindgen_ty_7::TDS_RUNQ;
pub const thread_TDS_RUNNING: thread__bindgen_ty_7 =
    thread__bindgen_ty_7::TDS_RUNNING;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum thread__bindgen_ty_7 {
    TDS_INACTIVE = 0,
    TDS_INHIBITED = 1,
    TDS_CAN_RUN = 2,
    TDS_RUNQ = 3,
    TDS_RUNNING = 4,
}
#[repr(C)]
#[derive(Copy)]
pub union thread__bindgen_ty_8 {
    pub tdu_retval: [register_t; 2usize],
    pub tdu_off: off_t,
    _bindgen_union_align: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_thread__bindgen_ty_8() {
    assert_eq!(::core::mem::size_of::<thread__bindgen_ty_8>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( thread__bindgen_ty_8 )
               ));
    assert_eq! (::core::mem::align_of::<thread__bindgen_ty_8>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( thread__bindgen_ty_8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_8 ) ) . tdu_retval as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_8 )
                , "::" , stringify ! ( tdu_retval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_8 ) ) . tdu_off as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_8 )
                , "::" , stringify ! ( tdu_off ) ));
}
impl Clone for thread__bindgen_ty_8 {
    fn clone(&self) -> Self { *self }
}
impl Default for thread__bindgen_ty_8 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for thread__bindgen_ty_8 {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f , "thread__bindgen_ty_8 {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct thread__bindgen_ty_9 {
    pub tqe_next: *mut thread,
    pub tqe_prev: *mut *mut thread,
}
#[test]
fn bindgen_test_layout_thread__bindgen_ty_9() {
    assert_eq!(::core::mem::size_of::<thread__bindgen_ty_9>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( thread__bindgen_ty_9 )
               ));
    assert_eq! (::core::mem::align_of::<thread__bindgen_ty_9>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( thread__bindgen_ty_9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_9 ) ) . tqe_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_9 )
                , "::" , stringify ! ( tqe_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread__bindgen_ty_9 ) ) . tqe_prev as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( thread__bindgen_ty_9 )
                , "::" , stringify ! ( tqe_prev ) ));
}
impl Clone for thread__bindgen_ty_9 {
    fn clone(&self) -> Self { *self }
}
impl Default for thread__bindgen_ty_9 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_thread() {
    assert_eq!(::core::mem::size_of::<thread>() , 1352usize , concat ! (
               "Size of: " , stringify ! ( thread ) ));
    assert_eq! (::core::mem::align_of::<thread>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( thread ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_lock as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_proc as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_proc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_plist as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_plist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_runq as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_runq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_slpq as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_slpq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_lockq as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_lockq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_hash as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_hash ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_cpuset as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_cpuset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_domain as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_domain ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sel as * const _ as usize
                } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sleepqueue as * const _
                as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sleepqueue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_turnstile as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_turnstile ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_rlqe as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_rlqe ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_umtxq as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_umtxq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_tid as * const _ as usize
                } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_tid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sigqueue as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sigqueue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_lend_user_pri as * const
                _ as usize } , 248usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_lend_user_pri ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_epochnest as * const _ as
                usize } , 249usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_epochnest ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_flags as * const _ as
                usize } , 252usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_inhibitors as * const _
                as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_inhibitors ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_pflags as * const _ as
                usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_pflags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_dupfd as * const _ as
                usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_dupfd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sqqueue as * const _ as
                usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sqqueue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_wchan as * const _ as
                usize } , 272usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_wchan ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_wmesg as * const _ as
                usize } , 280usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_wmesg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_owepreempt as * const _
                as usize } , 288usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_owepreempt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_tsqueue as * const _ as
                usize } , 289usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_tsqueue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_locks as * const _ as
                usize } , 290usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_locks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_rw_rlocks as * const _ as
                usize } , 292usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_rw_rlocks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sx_slocks as * const _ as
                usize } , 294usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sx_slocks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_lk_slocks as * const _ as
                usize } , 296usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_lk_slocks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_stopsched as * const _ as
                usize } , 298usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_stopsched ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_blocked as * const _ as
                usize } , 304usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_blocked ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_lockname as * const _ as
                usize } , 312usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_lockname ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_contested as * const _ as
                usize } , 320usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_contested ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sleeplocks as * const _
                as usize } , 328usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sleeplocks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_intr_nesting_level as *
                const _ as usize } , 336usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_intr_nesting_level ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_pinned as * const _ as
                usize } , 340usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_pinned ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_ucred as * const _ as
                usize } , 344usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_ucred ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_limit as * const _ as
                usize } , 352usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_limit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_slptick as * const _ as
                usize } , 360usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_slptick ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_blktick as * const _ as
                usize } , 364usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_blktick ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_swvoltick as * const _ as
                usize } , 368usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_swvoltick ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_swinvoltick as * const _
                as usize } , 372usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_swinvoltick ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_cow as * const _ as usize
                } , 376usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_cow ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_ru as * const _ as usize
                } , 384usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_ru ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_rux as * const _ as usize
                } , 528usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_rux ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_incruntime as * const _
                as usize } , 584usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_incruntime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_runtime as * const _ as
                usize } , 592usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_runtime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_pticks as * const _ as
                usize } , 600usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_pticks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sticks as * const _ as
                usize } , 604usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sticks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_iticks as * const _ as
                usize } , 608usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_iticks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_uticks as * const _ as
                usize } , 612usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_uticks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_intrval as * const _ as
                usize } , 616usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_intrval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_oldsigmask as * const _
                as usize } , 620usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_oldsigmask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_generation as * const _
                as usize } , 636usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_generation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sigstk as * const _ as
                usize } , 640usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sigstk ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_xsig as * const _ as
                usize } , 664usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_xsig ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_profil_addr as * const _
                as usize } , 672usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_profil_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_profil_ticks as * const _
                as usize } , 680usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_profil_ticks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_name as * const _ as
                usize } , 684usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_fpop as * const _ as
                usize } , 704usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_fpop ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_dbgflags as * const _ as
                usize } , 712usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_dbgflags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_si as * const _ as usize
                } , 720usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_si ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_ng_outbound as * const _
                as usize } , 800usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_ng_outbound ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_osd as * const _ as usize
                } , 808usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_osd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_map_def_user as * const _
                as usize } , 840usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_map_def_user ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_dbg_forked as * const _
                as usize } , 848usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_dbg_forked ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_vp_reserv as * const _ as
                usize } , 852usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_vp_reserv ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_no_sleeping as * const _
                as usize } , 856usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_no_sleeping ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_su as * const _ as usize
                } , 864usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_su ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sleeptimo as * const _ as
                usize } , 872usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sleeptimo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_rtcgen as * const _ as
                usize } , 880usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_rtcgen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_vslock_sz as * const _ as
                usize } , 888usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_vslock_sz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sigmask as * const _ as
                usize } , 896usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sigmask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_rqindex as * const _ as
                usize } , 912usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_rqindex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_base_pri as * const _ as
                usize } , 913usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_base_pri ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_priority as * const _ as
                usize } , 914usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_pri_class as * const _ as
                usize } , 915usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_pri_class ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_user_pri as * const _ as
                usize } , 916usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_user_pri ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_base_user_pri as * const
                _ as usize } , 917usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_base_user_pri ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_pre_epoch_prio as * const
                _ as usize } , 918usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_pre_epoch_prio ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_rb_list as * const _ as
                usize } , 920usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_rb_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_rbp_list as * const _ as
                usize } , 928usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_rbp_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_rb_inact as * const _ as
                usize } , 936usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_rb_inact ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_sa as * const _ as usize
                } , 944usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_sa ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_pcb as * const _ as usize
                } , 1032usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_pcb ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_state as * const _ as
                usize } , 1040usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_uretoff as * const _ as
                usize } , 1048usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_uretoff ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_cowgen as * const _ as
                usize } , 1064usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_cowgen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_slpcallout as * const _
                as usize } , 1072usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_slpcallout ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_frame as * const _ as
                usize } , 1136usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_frame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_kstack_obj as * const _
                as usize } , 1144usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_kstack_obj ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_kstack as * const _ as
                usize } , 1152usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_kstack ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_kstack_pages as * const _
                as usize } , 1160usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_kstack_pages ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_critnest as * const _ as
                usize } , 1164usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_critnest ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_md as * const _ as usize
                } , 1168usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_md ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_ar as * const _ as usize
                } , 1216usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_ar ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_lprof as * const _ as
                usize } , 1224usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_lprof ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_dtrace as * const _ as
                usize } , 1240usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_dtrace ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_errno as * const _ as
                usize } , 1248usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_errno ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_vnet as * const _ as
                usize } , 1256usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_vnet ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_vnet_lpush as * const _
                as usize } , 1264usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_vnet_lpush ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_intr_frame as * const _
                as usize } , 1272usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_intr_frame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_rfppwait_p as * const _
                as usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_rfppwait_p ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_ma as * const _ as usize
                } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_ma ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_ma_cnt as * const _ as
                usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_ma_cnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_emuldata as * const _ as
                usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_emuldata ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_lastcpu as * const _ as
                usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_lastcpu ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_oncpu as * const _ as
                usize } , 1316usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_oncpu ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_lkpi_task as * const _ as
                usize } , 1320usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_lkpi_task ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_epochq as * const _ as
                usize } , 1328usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_epochq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const thread ) ) . td_epoch_section as * const
                _ as usize } , 1344usize , concat ! (
                "Alignment of field: " , stringify ! ( thread ) , "::" ,
                stringify ! ( td_epoch_section ) ));
}
impl Clone for thread {
    fn clone(&self) -> Self { *self }
}
impl Default for thread {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for thread {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f ,
               "thread {{ td_lock: {:?}, td_proc: {:?}, td_plist: {:?}, td_runq: {:?}, td_slpq: {:?}, td_lockq: {:?}, td_hash: {:?}, td_cpuset: {:?}, td_domain: {:?}, td_sel: {:?}, td_sleepqueue: {:?}, td_turnstile: {:?}, td_rlqe: {:?}, td_umtxq: {:?}, td_tid: {:?}, td_sigqueue: {:?}, td_lend_user_pri: {:?}, td_epochnest: {:?}, td_flags: {:?}, td_inhibitors: {:?}, td_pflags: {:?}, td_dupfd: {:?}, td_sqqueue: {:?}, td_wchan: {:?}, td_wmesg: {:?}, td_owepreempt: {:?}, td_tsqueue: {:?}, td_locks: {:?}, td_rw_rlocks: {:?}, td_sx_slocks: {:?}, td_lk_slocks: {:?}, td_stopsched: {:?}, td_blocked: {:?}, td_lockname: {:?}, td_contested: {:?}, td_sleeplocks: {:?}, td_intr_nesting_level: {:?}, td_pinned: {:?}, td_ucred: {:?}, td_limit: {:?}, td_slptick: {:?}, td_blktick: {:?}, td_swvoltick: {:?}, td_swinvoltick: {:?}, td_cow: {:?}, td_ru: {:?}, td_rux: {:?}, td_incruntime: {:?}, td_runtime: {:?}, td_pticks: {:?}, td_sticks: {:?}, td_iticks: {:?}, td_uticks: {:?}, td_intrval: {:?}, td_oldsigmask: {:?}, td_generation: {:?}, td_sigstk: {:?}, td_xsig: {:?}, td_profil_addr: {:?}, td_profil_ticks: {:?}, td_name: {:?}, td_fpop: {:?}, td_dbgflags: {:?}, td_si: {:?}, td_ng_outbound: {:?}, td_osd: {:?}, td_map_def_user: {:?}, td_dbg_forked: {:?}, td_vp_reserv: {:?}, td_no_sleeping: {:?}, td_su: {:?}, td_sleeptimo: {:?}, td_rtcgen: {:?}, td_vslock_sz: {:?}, td_sigmask: {:?}, td_rqindex: {:?}, td_base_pri: {:?}, td_priority: {:?}, td_pri_class: {:?}, td_user_pri: {:?}, td_base_user_pri: {:?}, td_pre_epoch_prio: {:?}, td_rb_list: {:?}, td_rbp_list: {:?}, td_rb_inact: {:?}, td_sa: {:?}, td_pcb: {:?}, td_state: {:?}, td_uretoff: {:?}, td_cowgen: {:?}, td_slpcallout: {:?}, td_frame: {:?}, td_kstack_obj: {:?}, td_kstack: {:?}, td_kstack_pages: {:?}, td_critnest: {:?}, td_md: {:?}, td_ar: {:?}, td_lprof: {:?}, td_dtrace: {:?}, td_errno: {:?}, td_vnet: {:?}, td_vnet_lpush: {:?}, td_intr_frame: {:?}, td_rfppwait_p: {:?}, td_ma: {:?}, td_ma_cnt: {:?}, td_emuldata: {:?}, td_lastcpu: {:?}, td_oncpu: {:?}, td_lkpi_task: {:?}, td_epochq: {:?}, td_epoch_section: {:?} }}"
               , self . td_lock , self . td_proc , self . td_plist , self .
               td_runq , self . td_slpq , self . td_lockq , self . td_hash ,
               self . td_cpuset , self . td_domain , self . td_sel , self .
               td_sleepqueue , self . td_turnstile , self . td_rlqe , self .
               td_umtxq , self . td_tid , self . td_sigqueue , self .
               td_lend_user_pri , self . td_epochnest , self . td_flags , self
               . td_inhibitors , self . td_pflags , self . td_dupfd , self .
               td_sqqueue , self . td_wchan , self . td_wmesg , self .
               td_owepreempt , self . td_tsqueue , self . td_locks , self .
               td_rw_rlocks , self . td_sx_slocks , self . td_lk_slocks , self
               . td_stopsched , self . td_blocked , self . td_lockname , self
               . td_contested , self . td_sleeplocks , self .
               td_intr_nesting_level , self . td_pinned , self . td_ucred ,
               self . td_limit , self . td_slptick , self . td_blktick , self
               . td_swvoltick , self . td_swinvoltick , self . td_cow , self .
               td_ru , self . td_rux , self . td_incruntime , self .
               td_runtime , self . td_pticks , self . td_sticks , self .
               td_iticks , self . td_uticks , self . td_intrval , self .
               td_oldsigmask , self . td_generation , self . td_sigstk , self
               . td_xsig , self . td_profil_addr , self . td_profil_ticks ,
               self . td_name , self . td_fpop , self . td_dbgflags , self .
               td_si , self . td_ng_outbound , self . td_osd , self .
               td_map_def_user , self . td_dbg_forked , self . td_vp_reserv ,
               self . td_no_sleeping , self . td_su , self . td_sleeptimo ,
               self . td_rtcgen , self . td_vslock_sz , self . td_sigmask ,
               self . td_rqindex , self . td_base_pri , self . td_priority ,
               self . td_pri_class , self . td_user_pri , self .
               td_base_user_pri , self . td_pre_epoch_prio , self . td_rb_list
               , self . td_rbp_list , self . td_rb_inact , self . td_sa , self
               . td_pcb , self . td_state , self . td_uretoff , self .
               td_cowgen , self . td_slpcallout , self . td_frame , self .
               td_kstack_obj , self . td_kstack , self . td_kstack_pages ,
               self . td_critnest , self . td_md , self . td_ar , self .
               td_lprof , self . td_dtrace , self . td_errno , self . td_vnet
               , self . td_vnet_lpush , self . td_intr_frame , self .
               td_rfppwait_p , self . td_ma , self . td_ma_cnt , self .
               td_emuldata , self . td_lastcpu , self . td_oncpu , self .
               td_lkpi_task , self . td_epochq , self . td_epoch_section)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tty {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ucred {
    pub cr_ref: u_int,
    pub cr_uid: uid_t,
    pub cr_ruid: uid_t,
    pub cr_svuid: uid_t,
    pub cr_ngroups: ::kernel::sys::raw::c_int,
    pub cr_rgid: gid_t,
    pub cr_svgid: gid_t,
    pub cr_uidinfo: *mut uidinfo,
    pub cr_ruidinfo: *mut uidinfo,
    pub cr_prison: *mut prison,
    pub cr_loginclass: *mut loginclass,
    pub cr_flags: u_int,
    pub cr_pspare2: [*mut ::kernel::sys::raw::c_void; 2usize],
    pub cr_label: *mut label,
    pub cr_audit: auditinfo_addr,
    pub cr_groups: *mut gid_t,
    pub cr_agroups: ::kernel::sys::raw::c_int,
    pub cr_smallgroups: [gid_t; 16usize],
}
#[test]
fn bindgen_test_layout_ucred() {
    assert_eq!(::core::mem::size_of::<ucred>() , 224usize , concat ! (
               "Size of: " , stringify ! ( ucred ) ));
    assert_eq! (::core::mem::align_of::<ucred>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ucred ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_ref as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_ref ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_uid as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_uid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_ruid as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_ruid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_svuid as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_svuid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_ngroups as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_ngroups ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_rgid as * const _ as usize
                } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_rgid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_svgid as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_svgid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_uidinfo as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_uidinfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_ruidinfo as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_ruidinfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_prison as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_prison ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_loginclass as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_loginclass ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_flags as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_pspare2 as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_pspare2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_label as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_label ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_audit as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_audit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_groups as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_groups ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_agroups as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_agroups ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ucred ) ) . cr_smallgroups as * const _
                as usize } , 156usize , concat ! (
                "Alignment of field: " , stringify ! ( ucred ) , "::" ,
                stringify ! ( cr_smallgroups ) ));
}
impl Clone for ucred {
    fn clone(&self) -> Self { *self }
}
impl Default for ucred {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uio {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _jmp_buf {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct trapframe {
    pub tf_rdi: register_t,
    pub tf_rsi: register_t,
    pub tf_rdx: register_t,
    pub tf_rcx: register_t,
    pub tf_r8: register_t,
    pub tf_r9: register_t,
    pub tf_rax: register_t,
    pub tf_rbx: register_t,
    pub tf_rbp: register_t,
    pub tf_r10: register_t,
    pub tf_r11: register_t,
    pub tf_r12: register_t,
    pub tf_r13: register_t,
    pub tf_r14: register_t,
    pub tf_r15: register_t,
    pub tf_trapno: u32,
    pub tf_fs: u16,
    pub tf_gs: u16,
    pub tf_addr: register_t,
    pub tf_flags: u32,
    pub tf_es: u16,
    pub tf_ds: u16,
    pub tf_err: register_t,
    pub tf_rip: register_t,
    pub tf_cs: register_t,
    pub tf_rflags: register_t,
    pub tf_rsp: register_t,
    pub tf_ss: register_t,
}
#[test]
fn bindgen_test_layout_trapframe() {
    assert_eq!(::core::mem::size_of::<trapframe>() , 192usize , concat ! (
               "Size of: " , stringify ! ( trapframe ) ));
    assert_eq! (::core::mem::align_of::<trapframe>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( trapframe ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rdi as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rdi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rsi as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rsi ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rdx as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rdx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rcx as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rcx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r8 as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r9 as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rax as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rax ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rbx as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rbx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rbp as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rbp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r10 as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r10 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r11 as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r11 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r12 as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r12 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r13 as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r13 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r14 as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r14 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_r15 as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_r15 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_trapno as * const _ as
                usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_trapno ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_fs as * const _ as
                usize } , 124usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_fs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_gs as * const _ as
                usize } , 126usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_gs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_addr as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_flags as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_es as * const _ as
                usize } , 140usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_es ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_ds as * const _ as
                usize } , 142usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_ds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_err as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_err ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rip as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rip ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_cs as * const _ as
                usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_cs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rflags as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rflags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_rsp as * const _ as
                usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_rsp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const trapframe ) ) . tf_ss as * const _ as
                usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( trapframe ) , "::" ,
                stringify ! ( tf_ss ) ));
}
impl Clone for trapframe {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eventtimer {
    _unused: [u8; 0],
}
extern "C" {
    pub fn setjmp(arg1: *mut _jmp_buf) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn longjmp(arg1: *mut _jmp_buf, arg2: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn dumpstatus(addr: vm_offset_t, count: off_t)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn nullop() -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn eopnotsupp() -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn ureadc(arg1: ::kernel::sys::raw::c_int, arg2: *mut uio)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn hashdestroy(arg1: *mut ::kernel::sys::raw::c_void,
                       arg2: *mut malloc_type, arg3: u_long);
}
extern "C" {
    pub fn hashinit(count: ::kernel::sys::raw::c_int, type_: *mut malloc_type,
                    hashmask: *mut u_long) -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn hashinit_flags(count: ::kernel::sys::raw::c_int,
                          type_: *mut malloc_type, hashmask: *mut u_long,
                          flags: ::kernel::sys::raw::c_int)
     -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn phashinit(count: ::kernel::sys::raw::c_int,
                     type_: *mut malloc_type, nentries: *mut u_long)
     -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn phashinit_flags(count: ::kernel::sys::raw::c_int,
                           type_: *mut malloc_type, nentries: *mut u_long,
                           flags: ::kernel::sys::raw::c_int)
     -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn g_waitidle();
}
extern "C" {
    pub fn panic(arg1: *const ::kernel::sys::raw::c_char, ...);
}
extern "C" {
    pub fn vpanic(arg1: *const ::kernel::sys::raw::c_char,
                  arg2: *mut __va_list_tag);
}
extern "C" {
    pub fn cpu_boot(arg1: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn cpu_flush_dcache(arg1: *mut ::kernel::sys::raw::c_void,
                            arg2: usize);
}
extern "C" {
    pub fn cpu_rootconf();
}
extern "C" {
    pub fn critical_enter();
}
extern "C" {
    pub fn critical_exit();
}
extern "C" {
    pub fn init_param1();
}
extern "C" {
    pub fn init_param2(physpages: ::kernel::sys::raw::c_long);
}
extern "C" {
    pub fn init_static_kenv(arg1: *mut ::kernel::sys::raw::c_char,
                            arg2: usize);
}
extern "C" {
    pub fn tablefull(arg1: *const ::kernel::sys::raw::c_char);
}
extern "C" {
    pub fn kvprintf(arg1: *const ::kernel::sys::raw::c_char,
                    arg2:
                        ::core::option::Option<unsafe extern "C" fn(arg1:
                                                                        ::kernel::sys::raw::c_int,
                                                                    arg2:
                                                                        *mut ::kernel::sys::raw::c_void)>,
                    arg3: *mut ::kernel::sys::raw::c_void,
                    arg4: ::kernel::sys::raw::c_int, arg5: *mut __va_list_tag)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn log(arg1: ::kernel::sys::raw::c_int,
               arg2: *const ::kernel::sys::raw::c_char, ...);
}
extern "C" {
    pub fn log_console(arg1: *mut uio);
}
extern "C" {
    pub fn vlog(arg1: ::kernel::sys::raw::c_int,
                arg2: *const ::kernel::sys::raw::c_char,
                arg3: *mut __va_list_tag);
}
extern "C" {
    pub fn asprintf(ret: *mut *mut ::kernel::sys::raw::c_char,
                    mtp: *mut malloc_type,
                    format: *const ::kernel::sys::raw::c_char, ...)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn printf(arg1: *const ::kernel::sys::raw::c_char, ...)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn snprintf(arg1: *mut ::kernel::sys::raw::c_char, arg2: usize,
                    arg3: *const ::kernel::sys::raw::c_char, ...)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn sprintf(buf: *mut ::kernel::sys::raw::c_char,
                   arg1: *const ::kernel::sys::raw::c_char, ...)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn uprintf(arg1: *const ::kernel::sys::raw::c_char, ...)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn vprintf(arg1: *const ::kernel::sys::raw::c_char,
                   arg2: *mut __va_list_tag) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn vasprintf(ret: *mut *mut ::kernel::sys::raw::c_char,
                     mtp: *mut malloc_type,
                     format: *const ::kernel::sys::raw::c_char,
                     ap: *mut __va_list_tag) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(arg1: *mut ::kernel::sys::raw::c_char, arg2: usize,
                     arg3: *const ::kernel::sys::raw::c_char,
                     arg4: *mut __va_list_tag) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn vsnrprintf(arg1: *mut ::kernel::sys::raw::c_char, arg2: usize,
                      arg3: ::kernel::sys::raw::c_int,
                      arg4: *const ::kernel::sys::raw::c_char,
                      arg5: *mut __va_list_tag) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn vsprintf(buf: *mut ::kernel::sys::raw::c_char,
                    arg1: *const ::kernel::sys::raw::c_char,
                    arg2: *mut __va_list_tag) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn ttyprintf(arg1: *mut tty,
                     arg2: *const ::kernel::sys::raw::c_char, ...)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn sscanf(arg1: *const ::kernel::sys::raw::c_char,
                  arg2: *const ::kernel::sys::raw::c_char, ...)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn vsscanf(arg1: *const ::kernel::sys::raw::c_char,
                   arg2: *const ::kernel::sys::raw::c_char,
                   arg3: *mut __va_list_tag) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn strtol(arg1: *const ::kernel::sys::raw::c_char,
                  arg2: *mut *mut ::kernel::sys::raw::c_char,
                  arg3: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_long;
}
extern "C" {
    pub fn strtoul(arg1: *const ::kernel::sys::raw::c_char,
                   arg2: *mut *mut ::kernel::sys::raw::c_char,
                   arg3: ::kernel::sys::raw::c_int) -> u_long;
}
extern "C" {
    pub fn strtoq(arg1: *const ::kernel::sys::raw::c_char,
                  arg2: *mut *mut ::kernel::sys::raw::c_char,
                  arg3: ::kernel::sys::raw::c_int) -> quad_t;
}
extern "C" {
    pub fn strtouq(arg1: *const ::kernel::sys::raw::c_char,
                   arg2: *mut *mut ::kernel::sys::raw::c_char,
                   arg3: ::kernel::sys::raw::c_int) -> u_quad_t;
}
extern "C" {
    pub fn tprintf(p: *mut proc_, pri: ::kernel::sys::raw::c_int,
                   arg1: *const ::kernel::sys::raw::c_char, ...);
}
extern "C" {
    pub fn vtprintf(arg1: *mut proc_, arg2: ::kernel::sys::raw::c_int,
                    arg3: *const ::kernel::sys::raw::c_char,
                    arg4: *mut __va_list_tag);
}
extern "C" {
    pub fn hexdump(ptr: *const ::kernel::sys::raw::c_void,
                   length: ::kernel::sys::raw::c_int,
                   hdr: *const ::kernel::sys::raw::c_char,
                   flags: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn bcopy(from: *const ::kernel::sys::raw::c_void,
                 to: *mut ::kernel::sys::raw::c_void, len: usize);
}
extern "C" {
    pub fn bzero(buf: *mut ::kernel::sys::raw::c_void, len: usize);
}
extern "C" {
    pub fn explicit_bzero(arg1: *mut ::kernel::sys::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn memcpy(to: *mut ::kernel::sys::raw::c_void,
                  from: *const ::kernel::sys::raw::c_void, len: usize)
     -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn memmove(dest: *mut ::kernel::sys::raw::c_void,
                   src: *const ::kernel::sys::raw::c_void, n: usize)
     -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn copystr(kfaddr: *const ::kernel::sys::raw::c_void,
                   kdaddr: *mut ::kernel::sys::raw::c_void, len: usize,
                   lencopied: *mut usize) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn copyinstr(udaddr: *const ::kernel::sys::raw::c_void,
                     kaddr: *mut ::kernel::sys::raw::c_void, len: usize,
                     lencopied: *mut usize) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn copyin(udaddr: *const ::kernel::sys::raw::c_void,
                  kaddr: *mut ::kernel::sys::raw::c_void, len: usize)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn copyin_nofault(udaddr: *const ::kernel::sys::raw::c_void,
                          kaddr: *mut ::kernel::sys::raw::c_void, len: usize)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn copyout(kaddr: *const ::kernel::sys::raw::c_void,
                   udaddr: *mut ::kernel::sys::raw::c_void, len: usize)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn copyout_nofault(kaddr: *const ::kernel::sys::raw::c_void,
                           udaddr: *mut ::kernel::sys::raw::c_void,
                           len: usize) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn fubyte(base: *const ::kernel::sys::raw::c_void)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn fuword(base: *const ::kernel::sys::raw::c_void)
     -> ::kernel::sys::raw::c_long;
}
extern "C" {
    pub fn fuword16(base: *const ::kernel::sys::raw::c_void)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn fuword32(base: *const ::kernel::sys::raw::c_void) -> i32;
}
extern "C" {
    pub fn fuword64(base: *const ::kernel::sys::raw::c_void) -> i64;
}
extern "C" {
    pub fn fueword(base: *const ::kernel::sys::raw::c_void,
                   val: *mut ::kernel::sys::raw::c_long)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn fueword32(base: *const ::kernel::sys::raw::c_void, val: *mut i32)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn fueword64(base: *const ::kernel::sys::raw::c_void, val: *mut i64)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn subyte(base: *mut ::kernel::sys::raw::c_void,
                  byte: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn suword(base: *mut ::kernel::sys::raw::c_void,
                  word: ::kernel::sys::raw::c_long)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn suword16(base: *mut ::kernel::sys::raw::c_void,
                    word: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn suword32(base: *mut ::kernel::sys::raw::c_void, word: i32)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn suword64(base: *mut ::kernel::sys::raw::c_void, word: i64)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn casuword32(base: *mut u32, oldval: u32, newval: u32) -> u32;
}
extern "C" {
    pub fn casuword(p: *mut u_long, oldval: u_long, newval: u_long) -> u_long;
}
extern "C" {
    pub fn casueword32(base: *mut u32, oldval: u32, oldvalp: *mut u32,
                       newval: u32) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn casueword(p: *mut u_long, oldval: u_long, oldvalp: *mut u_long,
                     newval: u_long) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn realitexpire(arg1: *mut ::kernel::sys::raw::c_void);
}
extern "C" {
    pub fn sysbeep(hertz: ::kernel::sys::raw::c_int,
                   period: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn hardclock(usermode: ::kernel::sys::raw::c_int, pc: uintfptr_t);
}
extern "C" {
    pub fn hardclock_cnt(cnt: ::kernel::sys::raw::c_int,
                         usermode: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn hardclock_cpu(usermode: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn hardclock_sync(cpu: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn softclock(arg1: *mut ::kernel::sys::raw::c_void);
}
extern "C" {
    pub fn statclock(usermode: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn statclock_cnt(cnt: ::kernel::sys::raw::c_int,
                         usermode: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn profclock(usermode: ::kernel::sys::raw::c_int, pc: uintfptr_t);
}
extern "C" {
    pub fn profclock_cnt(cnt: ::kernel::sys::raw::c_int,
                         usermode: ::kernel::sys::raw::c_int, pc: uintfptr_t);
}
extern "C" {
    pub fn hardclockintr() -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn startprofclock(arg1: *mut proc_);
}
extern "C" {
    pub fn stopprofclock(arg1: *mut proc_);
}
extern "C" {
    pub fn cpu_startprofclock();
}
extern "C" {
    pub fn cpu_stopprofclock();
}
extern "C" {
    pub fn suspendclock();
}
extern "C" {
    pub fn resumeclock();
}
extern "C" {
    pub fn cpu_idleclock() -> sbintime_t;
}
extern "C" {
    pub fn cpu_activeclock();
}
extern "C" {
    pub fn cpu_new_callout(cpu: ::kernel::sys::raw::c_int, bt: sbintime_t,
                           bt_opt: sbintime_t);
}
extern "C" {
    pub fn cpu_et_frequency(et: *mut eventtimer, newfreq: u64);
}
extern "C" {
    #[link_name = "cpu_disable_c2_sleep"]
    pub static mut cpu_disable_c2_sleep: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "cpu_disable_c3_sleep"]
    pub static mut cpu_disable_c3_sleep: ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn kern_getenv(name: *const ::kernel::sys::raw::c_char)
     -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn freeenv(env: *mut ::kernel::sys::raw::c_char);
}
extern "C" {
    pub fn getenv_int(name: *const ::kernel::sys::raw::c_char,
                      data: *mut ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn getenv_uint(name: *const ::kernel::sys::raw::c_char,
                       data: *mut ::kernel::sys::raw::c_uint)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn getenv_long(name: *const ::kernel::sys::raw::c_char,
                       data: *mut ::kernel::sys::raw::c_long)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn getenv_ulong(name: *const ::kernel::sys::raw::c_char,
                        data: *mut ::kernel::sys::raw::c_ulong)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn getenv_string(name: *const ::kernel::sys::raw::c_char,
                         data: *mut ::kernel::sys::raw::c_char,
                         size: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn getenv_int64(name: *const ::kernel::sys::raw::c_char,
                        data: *mut i64) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn getenv_uint64(name: *const ::kernel::sys::raw::c_char,
                         data: *mut u64) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn getenv_quad(name: *const ::kernel::sys::raw::c_char,
                       data: *mut quad_t) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn kern_setenv(name: *const ::kernel::sys::raw::c_char,
                       value: *const ::kernel::sys::raw::c_char)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn kern_unsetenv(name: *const ::kernel::sys::raw::c_char)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn testenv(name: *const ::kernel::sys::raw::c_char)
     -> ::kernel::sys::raw::c_int;
}
pub type cpu_tick_f = ::core::option::Option<unsafe extern "C" fn() -> u64>;
extern "C" {
    pub fn set_cputicker(func: cpu_tick_f, freq: u64,
                         var: ::kernel::sys::raw::c_uint);
}
extern "C" {
    #[link_name = "cpu_ticks"]
    pub static mut cpu_ticks: cpu_tick_f;
}
extern "C" {
    pub fn cpu_tickrate() -> u64;
}
extern "C" {
    pub fn cputick2usec(tick: u64) -> u64;
}
extern "C" {
    #[link_name = "bcd2bin_data"]
    pub static mut bcd2bin_data: [u_char; 0usize];
}
extern "C" {
    #[link_name = "bin2bcd_data"]
    pub static mut bin2bcd_data: [u_char; 0usize];
}
extern "C" {
    #[link_name = "hex2ascii_data"]
    pub static mut hex2ascii_data: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "arc4rand_iniseed_state"]
    pub static mut arc4rand_iniseed_state: ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn arc4random() -> u32;
}
extern "C" {
    pub fn arc4random_buf(arg1: *mut ::kernel::sys::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn arc4rand(arg1: *mut ::kernel::sys::raw::c_void, arg2: u_int,
                    arg3: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn bcmp(arg1: *const ::kernel::sys::raw::c_void,
                arg2: *const ::kernel::sys::raw::c_void, arg3: usize)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn timingsafe_bcmp(arg1: *const ::kernel::sys::raw::c_void,
                           arg2: *const ::kernel::sys::raw::c_void,
                           arg3: usize) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn bsearch(arg1: *const ::kernel::sys::raw::c_void,
                   arg2: *const ::kernel::sys::raw::c_void, arg3: usize,
                   arg4: usize,
                   arg5:
                       ::core::option::Option<unsafe extern "C" fn(arg1:
                                                                       *const ::kernel::sys::raw::c_void,
                                                                   arg2:
                                                                       *const ::kernel::sys::raw::c_void)
                                                  ->
                                                      ::kernel::sys::raw::c_int>)
     -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn fnmatch(arg1: *const ::kernel::sys::raw::c_char,
                   arg2: *const ::kernel::sys::raw::c_char,
                   arg3: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn locc(arg1: ::kernel::sys::raw::c_int,
                arg2: *mut ::kernel::sys::raw::c_char, arg3: u_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn memchr(s: *const ::kernel::sys::raw::c_void,
                  c: ::kernel::sys::raw::c_int, n: usize)
     -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn memcchr(s: *const ::kernel::sys::raw::c_void,
                   c: ::kernel::sys::raw::c_int, n: usize)
     -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn memcmp(b1: *const ::kernel::sys::raw::c_void,
                  b2: *const ::kernel::sys::raw::c_void, len: usize)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn memmem(l: *const ::kernel::sys::raw::c_void, l_len: usize,
                  s: *const ::kernel::sys::raw::c_void, s_len: usize)
     -> *mut ::kernel::sys::raw::c_void;
}
extern "C" {
    pub fn qsort(base: *mut ::kernel::sys::raw::c_void, nmemb: usize,
                 size: usize,
                 compar:
                     ::core::option::Option<unsafe extern "C" fn(arg1:
                                                                     *const ::kernel::sys::raw::c_void,
                                                                 arg2:
                                                                     *const ::kernel::sys::raw::c_void)
                                                ->
                                                    ::kernel::sys::raw::c_int>);
}
extern "C" {
    pub fn qsort_r(base: *mut ::kernel::sys::raw::c_void, nmemb: usize,
                   size: usize, thunk: *mut ::kernel::sys::raw::c_void,
                   compar:
                       ::core::option::Option<unsafe extern "C" fn(arg1:
                                                                       *mut ::kernel::sys::raw::c_void,
                                                                   arg2:
                                                                       *const ::kernel::sys::raw::c_void,
                                                                   arg3:
                                                                       *const ::kernel::sys::raw::c_void)
                                                  ->
                                                      ::kernel::sys::raw::c_int>);
}
extern "C" {
    pub fn random() -> u_long;
}
extern "C" {
    pub fn scanc(arg1: u_int, arg2: *const u_char, arg3: *const u_char,
                 arg4: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn srandom(arg1: u_long);
}
extern "C" {
    pub fn strcasecmp(arg1: *const ::kernel::sys::raw::c_char,
                      arg2: *const ::kernel::sys::raw::c_char)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn strcat(arg1: *mut ::kernel::sys::raw::c_char,
                  arg2: *const ::kernel::sys::raw::c_char)
     -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strchr(arg1: *const ::kernel::sys::raw::c_char,
                  arg2: ::kernel::sys::raw::c_int)
     -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strcmp(arg1: *const ::kernel::sys::raw::c_char,
                  arg2: *const ::kernel::sys::raw::c_char)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn strcpy(arg1: *mut ::kernel::sys::raw::c_char,
                  arg2: *const ::kernel::sys::raw::c_char)
     -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strcspn(arg1: *const ::kernel::sys::raw::c_char,
                   arg2: *const ::kernel::sys::raw::c_char) -> usize;
}
extern "C" {
    pub fn strdup(arg1: *const ::kernel::sys::raw::c_char,
                  arg2: *mut malloc_type) -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strncat(arg1: *mut ::kernel::sys::raw::c_char,
                   arg2: *const ::kernel::sys::raw::c_char, arg3: usize)
     -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strndup(arg1: *const ::kernel::sys::raw::c_char, arg2: usize,
                   arg3: *mut malloc_type) -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strlcat(arg1: *mut ::kernel::sys::raw::c_char,
                   arg2: *const ::kernel::sys::raw::c_char, arg3: usize)
     -> usize;
}
extern "C" {
    pub fn strlcpy(arg1: *mut ::kernel::sys::raw::c_char,
                   arg2: *const ::kernel::sys::raw::c_char, arg3: usize)
     -> usize;
}
extern "C" {
    pub fn strlen(arg1: *const ::kernel::sys::raw::c_char) -> usize;
}
extern "C" {
    pub fn strncasecmp(arg1: *const ::kernel::sys::raw::c_char,
                       arg2: *const ::kernel::sys::raw::c_char, arg3: usize)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn strncmp(arg1: *const ::kernel::sys::raw::c_char,
                   arg2: *const ::kernel::sys::raw::c_char, arg3: usize)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn strncpy(arg1: *mut ::kernel::sys::raw::c_char,
                   arg2: *const ::kernel::sys::raw::c_char, arg3: usize)
     -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strnlen(arg1: *const ::kernel::sys::raw::c_char, arg2: usize)
     -> usize;
}
extern "C" {
    pub fn strrchr(arg1: *const ::kernel::sys::raw::c_char,
                   arg2: ::kernel::sys::raw::c_int)
     -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strsep(arg1: *mut *mut ::kernel::sys::raw::c_char,
                  delim: *const ::kernel::sys::raw::c_char)
     -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strspn(arg1: *const ::kernel::sys::raw::c_char,
                  arg2: *const ::kernel::sys::raw::c_char) -> usize;
}
extern "C" {
    pub fn strstr(arg1: *const ::kernel::sys::raw::c_char,
                  arg2: *const ::kernel::sys::raw::c_char)
     -> *mut ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn strvalid(arg1: *const ::kernel::sys::raw::c_char, arg2: usize)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "crc32_tab"]
    pub static mut crc32_tab: [u32; 0usize];
}
extern "C" {
    pub fn calculate_crc32c(crc32c: u32,
                            buffer: *const ::kernel::sys::raw::c_uchar,
                            length: ::kernel::sys::raw::c_uint) -> u32;
}
extern "C" {
    pub fn sse42_crc32c(arg1: u32, arg2: *const ::kernel::sys::raw::c_uchar,
                        arg3: ::kernel::sys::raw::c_uint) -> u32;
}
extern "C" {
    pub fn consinit();
}
extern "C" {
    pub fn cpu_initclocks();
}
extern "C" {
    pub fn cpu_initclocks_bsp();
}
extern "C" {
    pub fn cpu_initclocks_ap();
}
extern "C" {
    pub fn usrinfoinit();
}
extern "C" {
    pub fn kern_reboot(arg1: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn shutdown_nice(arg1: ::kernel::sys::raw::c_int);
}
pub type timeout_t =
    ::core::option::Option<unsafe extern "C" fn(arg1:
                                                    *mut ::kernel::sys::raw::c_void)>;
extern "C" {
    pub fn callout_handle_init(arg1: *mut callout_handle);
}
extern "C" {
    pub fn timeout(arg1: timeout_t, arg2: *mut ::kernel::sys::raw::c_void,
                   arg3: ::kernel::sys::raw::c_int) -> callout_handle;
}
extern "C" {
    pub fn untimeout(arg1: timeout_t, arg2: *mut ::kernel::sys::raw::c_void,
                     arg3: callout_handle);
}
extern "C" {
    pub fn _sleep(chan: *mut ::kernel::sys::raw::c_void,
                  lock: *mut lock_object, pri: ::kernel::sys::raw::c_int,
                  wmesg: *const ::kernel::sys::raw::c_char, sbt: sbintime_t,
                  pr: sbintime_t, flags: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn msleep_spin_sbt(chan: *mut ::kernel::sys::raw::c_void,
                           mtx: *mut mtx,
                           wmesg: *const ::kernel::sys::raw::c_char,
                           sbt: sbintime_t, pr: sbintime_t,
                           flags: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn pause_sbt(wmesg: *const ::kernel::sys::raw::c_char,
                     sbt: sbintime_t, pr: sbintime_t,
                     flags: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn wakeup(chan: *mut ::kernel::sys::raw::c_void);
}
extern "C" {
    pub fn wakeup_one(chan: *mut ::kernel::sys::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cdev {
    _unused: [u8; 0],
}
extern "C" {
    pub fn dev2udev(x: *mut cdev) -> dev_t;
}
extern "C" {
    pub fn devtoname(cdev: *mut cdev) -> *const ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn devfs_iosize_max() -> usize;
}
extern "C" {
    pub fn iosize_max() -> usize;
}
extern "C" {
    pub fn poll_no_poll(events: ::kernel::sys::raw::c_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn DELAY(usec: ::kernel::sys::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct root_hold_token {
    _unused: [u8; 0],
}
extern "C" {
    pub fn root_mount_hold(identifier: *const ::kernel::sys::raw::c_char)
     -> *mut root_hold_token;
}
extern "C" {
    pub fn root_mount_rel(h: *mut root_hold_token);
}
extern "C" {
    pub fn root_mounted() -> ::kernel::sys::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct unrhdr {
    _unused: [u8; 0],
}
extern "C" {
    pub fn new_unrhdr(low: ::kernel::sys::raw::c_int,
                      high: ::kernel::sys::raw::c_int, mutex: *mut mtx)
     -> *mut unrhdr;
}
extern "C" {
    pub fn init_unrhdr(uh: *mut unrhdr, low: ::kernel::sys::raw::c_int,
                       high: ::kernel::sys::raw::c_int, mutex: *mut mtx);
}
extern "C" {
    pub fn delete_unrhdr(uh: *mut unrhdr);
}
extern "C" {
    pub fn clear_unrhdr(uh: *mut unrhdr);
}
extern "C" {
    pub fn clean_unrhdr(uh: *mut unrhdr);
}
extern "C" {
    pub fn clean_unrhdrl(uh: *mut unrhdr);
}
extern "C" {
    pub fn alloc_unr(uh: *mut unrhdr) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn alloc_unr_specific(uh: *mut unrhdr, item: u_int)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn alloc_unrl(uh: *mut unrhdr) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn free_unr(uh: *mut unrhdr, item: u_int);
}
extern "C" {
    pub fn intr_prof_stack_use(td: *mut thread, frame: *mut trapframe);
}
extern "C" {
    pub fn counted_warning(counter: *mut ::kernel::sys::raw::c_uint,
                           msg: *const ::kernel::sys::raw::c_char);
}
extern "C" {
    pub fn _gone_in(major: ::kernel::sys::raw::c_int,
                    msg: *const ::kernel::sys::raw::c_char);
}
extern "C" {
    pub fn _gone_in_dev(dev: *mut device, major: ::kernel::sys::raw::c_int,
                        msg: *const ::kernel::sys::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct pti_frame {
    pub pti_rdx: register_t,
    pub pti_rax: register_t,
    pub pti_err: register_t,
    pub pti_rip: register_t,
    pub pti_cs: register_t,
    pub pti_rflags: register_t,
    pub pti_rsp: register_t,
    pub pti_ss: register_t,
}
#[test]
fn bindgen_test_layout_pti_frame() {
    assert_eq!(::core::mem::size_of::<pti_frame>() , 64usize , concat ! (
               "Size of: " , stringify ! ( pti_frame ) ));
    assert_eq! (::core::mem::align_of::<pti_frame>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pti_frame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pti_frame ) ) . pti_rdx as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pti_frame ) , "::" ,
                stringify ! ( pti_rdx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pti_frame ) ) . pti_rax as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( pti_frame ) , "::" ,
                stringify ! ( pti_rax ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pti_frame ) ) . pti_err as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( pti_frame ) , "::" ,
                stringify ! ( pti_err ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pti_frame ) ) . pti_rip as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( pti_frame ) , "::" ,
                stringify ! ( pti_rip ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pti_frame ) ) . pti_cs as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( pti_frame ) , "::" ,
                stringify ! ( pti_cs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pti_frame ) ) . pti_rflags as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( pti_frame ) , "::" ,
                stringify ! ( pti_rflags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pti_frame ) ) . pti_rsp as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( pti_frame ) , "::" ,
                stringify ! ( pti_rsp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pti_frame ) ) . pti_ss as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( pti_frame ) , "::" ,
                stringify ! ( pti_ss ) ));
}
impl Clone for pti_frame {
    fn clone(&self) -> Self { *self }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct segment_descriptor {
    pub _bitfield_1: [u32; 3usize],
    pub __bindgen_align: [u8; 0usize],
}
#[test]
fn bindgen_test_layout_segment_descriptor() {
    assert_eq!(::core::mem::size_of::<segment_descriptor>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( segment_descriptor ) ));
    assert_eq! (::core::mem::align_of::<segment_descriptor>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( segment_descriptor ) ));
}
impl Clone for segment_descriptor {
    fn clone(&self) -> Self { *self }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct user_segment_descriptor {
    pub _bitfield_1: [u32; 3usize],
    pub __bindgen_align: [u8; 0usize],
}
#[test]
fn bindgen_test_layout_user_segment_descriptor() {
    assert_eq!(::core::mem::size_of::<user_segment_descriptor>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( user_segment_descriptor ) ));
    assert_eq! (::core::mem::align_of::<user_segment_descriptor>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( user_segment_descriptor ) ));
}
impl Clone for user_segment_descriptor {
    fn clone(&self) -> Self { *self }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct gate_descriptor {
    pub _bitfield_1: [u64; 3usize],
    pub __bindgen_align: [u8; 0usize],
}
#[test]
fn bindgen_test_layout_gate_descriptor() {
    assert_eq!(::core::mem::size_of::<gate_descriptor>() , 16usize , concat !
               ( "Size of: " , stringify ! ( gate_descriptor ) ));
    assert_eq! (::core::mem::align_of::<gate_descriptor>() , 1usize , concat !
                ( "Alignment of " , stringify ! ( gate_descriptor ) ));
}
impl Clone for gate_descriptor {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union descriptor {
    pub sd: user_segment_descriptor,
    pub gd: gate_descriptor,
    _bindgen_union_align: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_descriptor() {
    assert_eq!(::core::mem::size_of::<descriptor>() , 16usize , concat ! (
               "Size of: " , stringify ! ( descriptor ) ));
    assert_eq! (::core::mem::align_of::<descriptor>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( descriptor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const descriptor ) ) . sd as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( descriptor ) , "::" ,
                stringify ! ( sd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const descriptor ) ) . gd as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( descriptor ) , "::" ,
                stringify ! ( gd ) ));
}
impl Clone for descriptor {
    fn clone(&self) -> Self { *self }
}
impl Default for descriptor {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for descriptor {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f , "descriptor {{ union }}")
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct system_segment_descriptor {
    pub _bitfield_1: [u64; 3usize],
    pub __bindgen_align: [u8; 0usize],
}
#[test]
fn bindgen_test_layout_system_segment_descriptor() {
    assert_eq!(::core::mem::size_of::<system_segment_descriptor>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( system_segment_descriptor ) ));
    assert_eq! (::core::mem::align_of::<system_segment_descriptor>() , 1usize
                , concat ! (
                "Alignment of " , stringify ! ( system_segment_descriptor )
                ));
}
impl Clone for system_segment_descriptor {
    fn clone(&self) -> Self { *self }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct soft_segment_descriptor {
    pub ssd_base: ::kernel::sys::raw::c_ulong,
    pub ssd_limit: ::kernel::sys::raw::c_ulong,
    pub _bitfield_1: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_soft_segment_descriptor() {
    assert_eq!(::core::mem::size_of::<soft_segment_descriptor>() , 18usize ,
               concat ! (
               "Size of: " , stringify ! ( soft_segment_descriptor ) ));
    assert_eq! (::core::mem::align_of::<soft_segment_descriptor>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( soft_segment_descriptor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const soft_segment_descriptor ) ) . ssd_base as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( soft_segment_descriptor
                ) , "::" , stringify ! ( ssd_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const soft_segment_descriptor ) ) . ssd_limit
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( soft_segment_descriptor
                ) , "::" , stringify ! ( ssd_limit ) ));
}
impl Clone for soft_segment_descriptor {
    fn clone(&self) -> Self { *self }
}
impl soft_segment_descriptor {
    #[inline]
    pub fn ssd_type(&self) -> ::kernel::sys::raw::c_ulong {
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        let mask = 31u64 as u16;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::core::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_ssd_type(&mut self, val: ::kernel::sys::raw::c_ulong) {
        let mask = 31u64 as u16;
        let val = val as u64 as u16;
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn ssd_dpl(&self) -> ::kernel::sys::raw::c_ulong {
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        let mask = 96u64 as u16;
        let val = (unit_field_val & mask) >> 5usize;
        unsafe { ::core::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_ssd_dpl(&mut self, val: ::kernel::sys::raw::c_ulong) {
        let mask = 96u64 as u16;
        let val = val as u64 as u16;
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 5usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn ssd_p(&self) -> ::kernel::sys::raw::c_ulong {
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        let mask = 128u64 as u16;
        let val = (unit_field_val & mask) >> 7usize;
        unsafe { ::core::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_ssd_p(&mut self, val: ::kernel::sys::raw::c_ulong) {
        let mask = 128u64 as u16;
        let val = val as u64 as u16;
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 7usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn ssd_long(&self) -> ::kernel::sys::raw::c_ulong {
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        let mask = 256u64 as u16;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::core::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_ssd_long(&mut self, val: ::kernel::sys::raw::c_ulong) {
        let mask = 256u64 as u16;
        let val = val as u64 as u16;
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn ssd_def32(&self) -> ::kernel::sys::raw::c_ulong {
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        let mask = 512u64 as u16;
        let val = (unit_field_val & mask) >> 9usize;
        unsafe { ::core::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_ssd_def32(&mut self, val: ::kernel::sys::raw::c_ulong) {
        let mask = 512u64 as u16;
        let val = val as u64 as u16;
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 9usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn ssd_gran(&self) -> ::kernel::sys::raw::c_ulong {
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        let mask = 1024u64 as u16;
        let val = (unit_field_val & mask) >> 10usize;
        unsafe { ::core::mem::transmute(val as u64) }
    }
    #[inline]
    pub fn set_ssd_gran(&mut self, val: ::kernel::sys::raw::c_ulong) {
        let mask = 1024u64 as u16;
        let val = val as u64 as u16;
        let mut unit_field_val: u16 = unsafe { ::core::mem::uninitialized() };
        unsafe {
            ::core::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                 *const u8,
                                             &mut unit_field_val as *mut u16
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 10usize) & mask;
        unsafe {
            ::core::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                 *const u8,
                                             &mut self._bitfield_1 as *mut _
                                                 as *mut u8,
                                             ::core::mem::size_of::<u16>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(ssd_type: ::kernel::sys::raw::c_ulong,
                          ssd_dpl: ::kernel::sys::raw::c_ulong,
                          ssd_p: ::kernel::sys::raw::c_ulong,
                          ssd_long: ::kernel::sys::raw::c_ulong,
                          ssd_def32: ::kernel::sys::raw::c_ulong,
                          ssd_gran: ::kernel::sys::raw::c_ulong) -> u16 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({ 0 } |
                                      ((ssd_type as u64 as u16) << 0usize) &
                                          (31u64 as u16))
                             } |
                                 ((ssd_dpl as u64 as u16) << 5usize) &
                                     (96u64 as u16))
                        } |
                            ((ssd_p as u64 as u16) << 7usize) &
                                (128u64 as u16))
                   } | ((ssd_long as u64 as u16) << 8usize) & (256u64 as u16))
              } | ((ssd_def32 as u64 as u16) << 9usize) & (512u64 as u16))
         } | ((ssd_gran as u64 as u16) << 10usize) & (1024u64 as u16))
    }
}
extern "C" {
    #[link_name = "gdt"]
    pub static mut gdt: [user_segment_descriptor; 0usize];
}
extern "C" {
    #[link_name = "gdt_segs"]
    pub static mut gdt_segs: [soft_segment_descriptor; 0usize];
}
extern "C" {
    #[link_name = "idt"]
    pub static mut idt: *mut gate_descriptor;
}
extern "C" {
    #[link_name = "r_gdt"]
    pub static mut r_gdt: region_descriptor;
}
extern "C" {
    #[link_name = "r_idt"]
    pub static mut r_idt: region_descriptor;
}
extern "C" {
    pub fn lgdt(rdp: *mut region_descriptor);
}
extern "C" {
    pub fn sdtossd(sdp: *mut user_segment_descriptor,
                   ssdp: *mut soft_segment_descriptor);
}
extern "C" {
    pub fn ssdtosd(ssdp: *mut soft_segment_descriptor,
                   sdp: *mut user_segment_descriptor);
}
extern "C" {
    pub fn ssdtosyssd(ssdp: *mut soft_segment_descriptor,
                      sdp: *mut system_segment_descriptor);
}
extern "C" {
    pub fn update_gdt_gsbase(td: *mut thread, base: u32);
}
extern "C" {
    pub fn update_gdt_fsbase(td: *mut thread, base: u32);
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct cpu_ops {
    pub cpu_init: ::core::option::Option<unsafe extern "C" fn()>,
    pub cpu_resume: ::core::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_cpu_ops() {
    assert_eq!(::core::mem::size_of::<cpu_ops>() , 16usize , concat ! (
               "Size of: " , stringify ! ( cpu_ops ) ));
    assert_eq! (::core::mem::align_of::<cpu_ops>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( cpu_ops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cpu_ops ) ) . cpu_init as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cpu_ops ) , "::" ,
                stringify ! ( cpu_init ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cpu_ops ) ) . cpu_resume as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( cpu_ops ) , "::" ,
                stringify ! ( cpu_resume ) ));
}
impl Clone for cpu_ops {
    fn clone(&self) -> Self { *self }
}
impl Default for cpu_ops {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
extern "C" {
    #[link_name = "cpu_ops"]
    pub static mut cpu_ops: cpu_ops;
}
extern "C" {
    #[link_name = "brwsection"]
    pub static mut brwsection: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "btext"]
    pub static mut btext: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "_end"]
    pub static mut _end: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "etext"]
    pub static mut etext: [::kernel::sys::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "vmm_resume_p"]
    pub static mut vmm_resume_p:
               ::core::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub fn cpu_halt();
}
extern "C" {
    pub fn cpu_reset();
}
extern "C" {
    pub fn fork_trampoline();
}
extern "C" {
    pub fn swi_vm(arg1: *mut ::kernel::sys::raw::c_void);
}
#[repr(C)]
pub struct buf_ring {
    pub br_prod_head: u32,
    pub br_prod_tail: u32,
    pub br_prod_size: ::kernel::sys::raw::c_int,
    pub br_prod_mask: ::kernel::sys::raw::c_int,
    pub br_drops: u64,
    pub __bindgen_padding_0: [u32; 10usize],
    pub br_cons_head: u32,
    pub br_cons_tail: u32,
    pub br_cons_size: ::kernel::sys::raw::c_int,
    pub br_cons_mask: ::kernel::sys::raw::c_int,
    pub __bindgen_padding_1: [u64; 6usize],
    pub br_ring: __IncompleteArrayField<*mut ::kernel::sys::raw::c_void>,
}
#[test]
fn bindgen_test_layout_buf_ring() {
    assert_eq!(::core::mem::size_of::<buf_ring>() , 128usize , concat ! (
               "Size of: " , stringify ! ( buf_ring ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_prod_head as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_prod_head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_prod_tail as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_prod_tail ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_prod_size as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_prod_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_prod_mask as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_prod_mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_drops as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_drops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_cons_head as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_cons_head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_cons_tail as * const _
                as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_cons_tail ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_cons_size as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_cons_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_cons_mask as * const _
                as usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_cons_mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const buf_ring ) ) . br_ring as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( buf_ring ) , "::" ,
                stringify ! ( br_ring ) ));
}
impl Default for buf_ring {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for buf_ring {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f ,
               "buf_ring {{ br_prod_head: {:?}, br_prod_tail: {:?}, br_prod_size: {:?}, br_prod_mask: {:?}, br_drops: {:?}, br_cons_head: {:?}, br_cons_tail: {:?}, br_cons_size: {:?}, br_cons_mask: {:?}, br_ring: {:?} }}"
               , self . br_prod_head , self . br_prod_tail , self .
               br_prod_size , self . br_prod_mask , self . br_drops , self .
               br_cons_head , self . br_cons_tail , self . br_cons_size , self
               . br_cons_mask , self . br_ring)
    }
}
extern "C" {
    pub fn buf_ring_alloc(count: ::kernel::sys::raw::c_int,
                          type_: *mut malloc_type,
                          flags: ::kernel::sys::raw::c_int, arg1: *mut mtx)
     -> *mut buf_ring;
}
extern "C" {
    pub fn buf_ring_free(br: *mut buf_ring, type_: *mut malloc_type);
}
pub type bus_addr_t = u64;
pub type bus_size_t = u64;
pub type bus_space_tag_t = u64;
pub type bus_space_handle_t = u64;
pub type bus_dmasync_op_t = ::kernel::sys::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bus_dma_tag {
    _unused: [u8; 0],
}
pub type bus_dma_tag_t = *mut bus_dma_tag;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bus_dmamap {
    _unused: [u8; 0],
}
pub type bus_dmamap_t = *mut bus_dmamap;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum bus_dma_lock_op_t { BUS_DMA_LOCK = 1, BUS_DMA_UNLOCK = 2, }
pub type bus_dma_lock_t =
    ::core::option::Option<unsafe extern "C" fn(arg1:
                                                    *mut ::kernel::sys::raw::c_void,
                                                arg2: bus_dma_lock_op_t)>;
/// @brief Interface information structure.
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct u_businfo {
    /// < @brief interface version
    pub ub_version: ::kernel::sys::raw::c_int,
    /// < @brief generation count
    pub ub_generation: ::kernel::sys::raw::c_int,
}
#[test]
fn bindgen_test_layout_u_businfo() {
    assert_eq!(::core::mem::size_of::<u_businfo>() , 8usize , concat ! (
               "Size of: " , stringify ! ( u_businfo ) ));
    assert_eq! (::core::mem::align_of::<u_businfo>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( u_businfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_businfo ) ) . ub_version as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( u_businfo ) , "::" ,
                stringify ! ( ub_version ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_businfo ) ) . ub_generation as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( u_businfo ) , "::" ,
                stringify ! ( ub_generation ) ));
}
impl Clone for u_businfo {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
/// @brief State of the device.
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum device_state {
    DS_NOTPRESENT = 10,
    DS_ALIVE = 20,
    DS_ATTACHING = 25,
    DS_ATTACHED = 30,
    DS_BUSY = 40,
}
pub use self::device_state as device_state_t;
/// @brief Device information exported to userspace.
#[repr(C)]
#[derive(Copy)]
pub struct u_device {
    pub dv_handle: usize,
    pub dv_parent: usize,
    /// < @brief Name of device in tree.
    pub dv_name: [::kernel::sys::raw::c_char; 32usize],
    /// < @brief Driver description
    pub dv_desc: [::kernel::sys::raw::c_char; 32usize],
    /// < @brief Driver name
    pub dv_drivername: [::kernel::sys::raw::c_char; 32usize],
    /// < @brief Plug and play info
    pub dv_pnpinfo: [::kernel::sys::raw::c_char; 128usize],
    /// < @brief Where is the device?
    pub dv_location: [::kernel::sys::raw::c_char; 128usize],
    /// < @brief API Flags for device
    pub dv_devflags: u32,
    /// < @brief flags for dev state
    pub dv_flags: u16,
    /// < @brief State of attachment
    pub dv_state: device_state_t,
}
#[test]
fn bindgen_test_layout_u_device() {
    assert_eq!(::core::mem::size_of::<u_device>() , 384usize , concat ! (
               "Size of: " , stringify ! ( u_device ) ));
    assert_eq! (::core::mem::align_of::<u_device>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( u_device ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_handle as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_handle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_parent as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_parent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_name as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_desc as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_desc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_drivername as * const _
                as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_drivername ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_pnpinfo as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_pnpinfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_location as * const _
                as usize } , 240usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_location ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_devflags as * const _
                as usize } , 368usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_devflags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_flags as * const _ as
                usize } , 372usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const u_device ) ) . dv_state as * const _ as
                usize } , 376usize , concat ! (
                "Alignment of field: " , stringify ! ( u_device ) , "::" ,
                stringify ! ( dv_state ) ));
}
impl Clone for u_device {
    fn clone(&self) -> Self { *self }
}
impl Default for u_device {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for u_device {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f ,
               "u_device {{ dv_handle: {:?}, dv_parent: {:?}, dv_name: [{}], dv_desc: [{}], dv_drivername: [{}], dv_pnpinfo: [{}], dv_location: [{}], dv_devflags: {:?}, dv_flags: {:?}, dv_state: {:?} }}"
               , self . dv_handle , self . dv_parent , self . dv_name . iter (
                ) . enumerate (  ) . map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ) , self . dv_desc . iter (  ) . enumerate (  ) .
               map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ) , self . dv_drivername . iter (  ) . enumerate (
               ) . map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ) , self . dv_pnpinfo . iter (  ) . enumerate (  )
               . map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ) , self . dv_location . iter (  ) . enumerate (  )
               . map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ) , self . dv_devflags , self . dv_flags , self .
               dv_state)
    }
}
/// @brief Device request structure used for ioctl's.
///
/// Used for ioctl's on /dev/devctl2.  All device ioctl's
/// must have parameter definitions which begin with dr_name.
#[repr(C)]
#[derive(Debug, Copy)]
pub struct devreq_buffer {
    pub buffer: *mut ::kernel::sys::raw::c_void,
    pub length: usize,
}
#[test]
fn bindgen_test_layout_devreq_buffer() {
    assert_eq!(::core::mem::size_of::<devreq_buffer>() , 16usize , concat ! (
               "Size of: " , stringify ! ( devreq_buffer ) ));
    assert_eq! (::core::mem::align_of::<devreq_buffer>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( devreq_buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const devreq_buffer ) ) . buffer as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( devreq_buffer ) , "::"
                , stringify ! ( buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const devreq_buffer ) ) . length as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( devreq_buffer ) , "::"
                , stringify ! ( length ) ));
}
impl Clone for devreq_buffer {
    fn clone(&self) -> Self { *self }
}
impl Default for devreq_buffer {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct devreq {
    pub dr_name: [::kernel::sys::raw::c_char; 128usize],
    pub dr_flags: ::kernel::sys::raw::c_int,
    pub dr_dru: devreq__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union devreq__bindgen_ty_1 {
    pub dru_buffer: devreq_buffer,
    pub dru_data: *mut ::kernel::sys::raw::c_void,
    _bindgen_union_align: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_devreq__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<devreq__bindgen_ty_1>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( devreq__bindgen_ty_1 )
               ));
    assert_eq! (::core::mem::align_of::<devreq__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( devreq__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const devreq__bindgen_ty_1 ) ) . dru_buffer as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( devreq__bindgen_ty_1 )
                , "::" , stringify ! ( dru_buffer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const devreq__bindgen_ty_1 ) ) . dru_data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( devreq__bindgen_ty_1 )
                , "::" , stringify ! ( dru_data ) ));
}
impl Clone for devreq__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for devreq__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for devreq__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f , "devreq__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_devreq() {
    assert_eq!(::core::mem::size_of::<devreq>() , 152usize , concat ! (
               "Size of: " , stringify ! ( devreq ) ));
    assert_eq! (::core::mem::align_of::<devreq>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( devreq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const devreq ) ) . dr_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( devreq ) , "::" ,
                stringify ! ( dr_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const devreq ) ) . dr_flags as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( devreq ) , "::" ,
                stringify ! ( dr_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const devreq ) ) . dr_dru as * const _ as usize
                } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( devreq ) , "::" ,
                stringify ! ( dr_dru ) ));
}
impl Clone for devreq {
    fn clone(&self) -> Self { *self }
}
impl Default for devreq {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for devreq {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f , "devreq {{ dr_name: [{}], dr_flags: {:?}, dr_dru: {:?} }}"
               , self . dr_name . iter (  ) . enumerate (  ) . map (
               | ( i , v ) | format ! (
               "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: <
               String > (  ) , self . dr_flags , self . dr_dru)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lock_list_entry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct lock_class {
    pub lc_name: *const ::kernel::sys::raw::c_char,
    pub lc_flags: u_int,
    pub lc_assert: ::core::option::Option<unsafe extern "C" fn(lock:
                                                                   *const lock_object,
                                                               what:
                                                                   ::kernel::sys::raw::c_int)>,
    pub lc_ddb_show: ::core::option::Option<unsafe extern "C" fn(lock:
                                                                     *const lock_object)>,
    pub lc_lock: ::core::option::Option<unsafe extern "C" fn(lock:
                                                                 *mut lock_object,
                                                             how: usize)>,
    pub lc_owner: ::core::option::Option<unsafe extern "C" fn(lock:
                                                                  *const lock_object,
                                                              owner:
                                                                  *mut *mut thread)
                                             -> ::kernel::sys::raw::c_int>,
    pub lc_unlock: ::core::option::Option<unsafe extern "C" fn(lock:
                                                                   *mut lock_object)
                                              -> usize>,
}
#[test]
fn bindgen_test_layout_lock_class() {
    assert_eq!(::core::mem::size_of::<lock_class>() , 56usize , concat ! (
               "Size of: " , stringify ! ( lock_class ) ));
    assert_eq! (::core::mem::align_of::<lock_class>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( lock_class ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_class ) ) . lc_name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_class ) , "::" ,
                stringify ! ( lc_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_class ) ) . lc_flags as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_class ) , "::" ,
                stringify ! ( lc_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_class ) ) . lc_assert as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_class ) , "::" ,
                stringify ! ( lc_assert ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_class ) ) . lc_ddb_show as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_class ) , "::" ,
                stringify ! ( lc_ddb_show ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_class ) ) . lc_lock as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_class ) , "::" ,
                stringify ! ( lc_lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_class ) ) . lc_owner as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_class ) , "::" ,
                stringify ! ( lc_owner ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_class ) ) . lc_unlock as * const _
                as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_class ) , "::" ,
                stringify ! ( lc_unlock ) ));
}
impl Clone for lock_class {
    fn clone(&self) -> Self { *self }
}
impl Default for lock_class {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
extern "C" {
    #[link_name = "lock_class_mtx_sleep"]
    pub static mut lock_class_mtx_sleep: lock_class;
}
extern "C" {
    #[link_name = "lock_class_mtx_spin"]
    pub static mut lock_class_mtx_spin: lock_class;
}
extern "C" {
    #[link_name = "lock_class_sx"]
    pub static mut lock_class_sx: lock_class;
}
extern "C" {
    #[link_name = "lock_class_rw"]
    pub static mut lock_class_rw: lock_class;
}
extern "C" {
    #[link_name = "lock_class_rm"]
    pub static mut lock_class_rm: lock_class;
}
extern "C" {
    #[link_name = "lock_class_rm_sleepable"]
    pub static mut lock_class_rm_sleepable: lock_class;
}
extern "C" {
    #[link_name = "lock_class_lockmgr"]
    pub static mut lock_class_lockmgr: lock_class;
}
extern "C" {
    #[link_name = "lock_classes"]
    pub static mut lock_classes: [*mut lock_class; 0usize];
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct lock_delay_config {
    pub base: u_int,
    pub max: u_int,
}
#[test]
fn bindgen_test_layout_lock_delay_config() {
    assert_eq!(::core::mem::size_of::<lock_delay_config>() , 8usize , concat !
               ( "Size of: " , stringify ! ( lock_delay_config ) ));
    assert_eq! (::core::mem::align_of::<lock_delay_config>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( lock_delay_config ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_delay_config ) ) . base as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_delay_config ) ,
                "::" , stringify ! ( base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_delay_config ) ) . max as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_delay_config ) ,
                "::" , stringify ! ( max ) ));
}
impl Clone for lock_delay_config {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct lock_delay_arg {
    pub config: *mut lock_delay_config,
    pub delay: u_int,
    pub spin_cnt: u_int,
}
#[test]
fn bindgen_test_layout_lock_delay_arg() {
    assert_eq!(::core::mem::size_of::<lock_delay_arg>() , 16usize , concat ! (
               "Size of: " , stringify ! ( lock_delay_arg ) ));
    assert_eq! (::core::mem::align_of::<lock_delay_arg>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( lock_delay_arg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_delay_arg ) ) . config as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_delay_arg ) , "::"
                , stringify ! ( config ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_delay_arg ) ) . delay as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_delay_arg ) , "::"
                , stringify ! ( delay ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lock_delay_arg ) ) . spin_cnt as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( lock_delay_arg ) , "::"
                , stringify ! ( spin_cnt ) ));
}
impl Clone for lock_delay_arg {
    fn clone(&self) -> Self { *self }
}
impl Default for lock_delay_arg {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
extern "C" {
    pub fn lock_init(arg1: *mut lock_object, arg2: *mut lock_class,
                     arg3: *const ::kernel::sys::raw::c_char,
                     arg4: *const ::kernel::sys::raw::c_char,
                     arg5: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn lock_destroy(arg1: *mut lock_object);
}
extern "C" {
    pub fn lock_delay(arg1: *mut lock_delay_arg);
}
extern "C" {
    pub fn lock_delay_default_init(arg1: *mut lock_delay_config);
}
extern "C" {
    pub fn spinlock_enter();
}
extern "C" {
    pub fn spinlock_exit();
}
extern "C" {
    pub fn witness_init(arg1: *mut lock_object,
                        arg2: *const ::kernel::sys::raw::c_char);
}
extern "C" {
    pub fn witness_destroy(arg1: *mut lock_object);
}
extern "C" {
    pub fn witness_defineorder(arg1: *mut lock_object, arg2: *mut lock_object)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn witness_checkorder(arg1: *mut lock_object,
                              arg2: ::kernel::sys::raw::c_int,
                              arg3: *const ::kernel::sys::raw::c_char,
                              arg4: ::kernel::sys::raw::c_int,
                              arg5: *mut lock_object);
}
extern "C" {
    pub fn witness_lock(arg1: *mut lock_object,
                        arg2: ::kernel::sys::raw::c_int,
                        arg3: *const ::kernel::sys::raw::c_char,
                        arg4: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn witness_upgrade(arg1: *mut lock_object,
                           arg2: ::kernel::sys::raw::c_int,
                           arg3: *const ::kernel::sys::raw::c_char,
                           arg4: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn witness_downgrade(arg1: *mut lock_object,
                             arg2: ::kernel::sys::raw::c_int,
                             arg3: *const ::kernel::sys::raw::c_char,
                             arg4: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn witness_unlock(arg1: *mut lock_object,
                          arg2: ::kernel::sys::raw::c_int,
                          arg3: *const ::kernel::sys::raw::c_char,
                          arg4: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn witness_save(arg1: *mut lock_object,
                        arg2: *mut *const ::kernel::sys::raw::c_char,
                        arg3: *mut ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn witness_restore(arg1: *mut lock_object,
                           arg2: *const ::kernel::sys::raw::c_char,
                           arg3: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn witness_list_locks(arg1: *mut *mut lock_list_entry,
                              arg2:
                                  ::core::option::Option<unsafe extern "C" fn(arg1:
                                                                                  *const ::kernel::sys::raw::c_char, ...)
                                                             ->
                                                                 ::kernel::sys::raw::c_int>)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn witness_warn(arg1: ::kernel::sys::raw::c_int,
                        arg2: *mut lock_object,
                        arg3: *const ::kernel::sys::raw::c_char, ...)
     -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn witness_assert(arg1: *const lock_object,
                          arg2: ::kernel::sys::raw::c_int,
                          arg3: *const ::kernel::sys::raw::c_char,
                          arg4: ::kernel::sys::raw::c_int);
}
extern "C" {
    pub fn witness_display_spinlock(arg1: *mut lock_object, arg2: *mut thread,
                                    arg3:
                                        ::core::option::Option<unsafe extern "C" fn(arg1:
                                                                                        *const ::kernel::sys::raw::c_char, ...)
                                                                   ->
                                                                       ::kernel::sys::raw::c_int>);
}
extern "C" {
    pub fn witness_line(arg1: *mut lock_object) -> ::kernel::sys::raw::c_int;
}
extern "C" {
    pub fn witness_norelease(arg1: *mut lock_object);
}
extern "C" {
    pub fn witness_releaseok(arg1: *mut lock_object);
}
extern "C" {
    pub fn witness_file(arg1: *mut lock_object)
     -> *const ::kernel::sys::raw::c_char;
}
extern "C" {
    pub fn witness_thread_exit(arg1: *mut thread);
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct bitset {
    pub __bits: [::kernel::sys::raw::c_long; 1usize],
}
#[test]
fn bindgen_test_layout_bitset() {
    assert_eq!(::core::mem::size_of::<bitset>() , 8usize , concat ! (
               "Size of: " , stringify ! ( bitset ) ));
    assert_eq! (::core::mem::align_of::<bitset>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( bitset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const bitset ) ) . __bits as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( bitset ) , "::" ,
                stringify ! ( __bits ) ));
}
impl Clone for bitset {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct _cpuset {
    pub __bits: [::kernel::sys::raw::c_long; 4usize],
}
#[test]
fn bindgen_test_layout__cpuset() {
    assert_eq!(::core::mem::size_of::<_cpuset>() , 32usize , concat ! (
               "Size of: " , stringify ! ( _cpuset ) ));
    assert_eq! (::core::mem::align_of::<_cpuset>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _cpuset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _cpuset ) ) . __bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _cpuset ) , "::" ,
                stringify ! ( __bits ) ));
}
impl Clone for _cpuset {
    fn clone(&self) -> Self { *self }
}
pub type cpuset_t = _cpuset;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ktr_entry {
    pub ktr_timestamp: u_int64_t,
    pub ktr_cpu: ::kernel::sys::raw::c_int,
    pub ktr_line: ::kernel::sys::raw::c_int,
    pub ktr_file: *const ::kernel::sys::raw::c_char,
    pub ktr_desc: *const ::kernel::sys::raw::c_char,
    pub ktr_thread: *mut thread,
    pub ktr_parms: [u_long; 6usize],
}
#[test]
fn bindgen_test_layout_ktr_entry() {
    assert_eq!(::core::mem::size_of::<ktr_entry>() , 88usize , concat ! (
               "Size of: " , stringify ! ( ktr_entry ) ));
    assert_eq! (::core::mem::align_of::<ktr_entry>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ktr_entry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ktr_entry ) ) . ktr_timestamp as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ktr_entry ) , "::" ,
                stringify ! ( ktr_timestamp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ktr_entry ) ) . ktr_cpu as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ktr_entry ) , "::" ,
                stringify ! ( ktr_cpu ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ktr_entry ) ) . ktr_line as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( ktr_entry ) , "::" ,
                stringify ! ( ktr_line ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ktr_entry ) ) . ktr_file as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ktr_entry ) , "::" ,
                stringify ! ( ktr_file ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ktr_entry ) ) . ktr_desc as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( ktr_entry ) , "::" ,
                stringify ! ( ktr_desc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ktr_entry ) ) . ktr_thread as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( ktr_entry ) , "::" ,
                stringify ! ( ktr_thread ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ktr_entry ) ) . ktr_parms as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( ktr_entry ) , "::" ,
                stringify ! ( ktr_parms ) ));
}
impl Clone for ktr_entry {
    fn clone(&self) -> Self { *self }
}
impl Default for ktr_entry {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
extern "C" {
    #[link_name = "ktr_cpumask"]
    pub static mut ktr_cpumask: cpuset_t;
}
extern "C" {
    #[link_name = "ktr_mask"]
    pub static mut ktr_mask: u64;
}
extern "C" {
    #[link_name = "ktr_entries"]
    pub static mut ktr_entries: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "ktr_verbose"]
    pub static mut ktr_verbose: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "ktr_idx"]
    pub static mut ktr_idx: ::kernel::sys::raw::c_int;
}
extern "C" {
    #[link_name = "ktr_buf"]
    pub static mut ktr_buf: *mut ktr_entry;
}
#[repr(C)]
#[derive(Copy)]
pub struct mtx_padalign {
    pub lock_object: lock_object,
    pub mtx_lock: usize,
    pub __bindgen_padding_0: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_mtx_padalign() {
    assert_eq!(::core::mem::size_of::<mtx_padalign>() , 64usize , concat ! (
               "Size of: " , stringify ! ( mtx_padalign ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mtx_padalign ) ) . lock_object as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( mtx_padalign ) , "::" ,
                stringify ! ( lock_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const mtx_padalign ) ) . mtx_lock as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( mtx_padalign ) , "::" ,
                stringify ! ( mtx_lock ) ));
}
impl Clone for mtx_padalign {
    fn clone(&self) -> Self { *self }
}
impl Default for mtx_padalign {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for mtx_padalign {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f , "mtx_padalign {{ lock_object: {:?}, mtx_lock: {:?} }}" ,
               self . lock_object , self . mtx_lock)
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct sx {
    pub lock_object: lock_object,
    pub sx_lock: usize,
}
#[test]
fn bindgen_test_layout_sx() {
    assert_eq!(::core::mem::size_of::<sx>() , 32usize , concat ! (
               "Size of: " , stringify ! ( sx ) ));
    assert_eq! (::core::mem::align_of::<sx>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( sx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sx ) ) . lock_object as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( sx ) , "::" , stringify
                ! ( lock_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const sx ) ) . sx_lock as * const _ as usize }
                , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( sx ) , "::" , stringify
                ! ( sx_lock ) ));
}
impl Clone for sx {
    fn clone(&self) -> Self { *self }
}
impl Default for sx {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rmpriolist {
    pub lh_first: *mut rm_priotracker,
}
#[test]
fn bindgen_test_layout_rmpriolist() {
    assert_eq!(::core::mem::size_of::<rmpriolist>() , 8usize , concat ! (
               "Size of: " , stringify ! ( rmpriolist ) ));
    assert_eq! (::core::mem::align_of::<rmpriolist>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rmpriolist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmpriolist ) ) . lh_first as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmpriolist ) , "::" ,
                stringify ! ( lh_first ) ));
}
impl Clone for rmpriolist {
    fn clone(&self) -> Self { *self }
}
impl Default for rmpriolist {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rm_queue {
    pub rmq_next: *mut rm_queue,
    pub rmq_prev: *mut rm_queue,
}
#[test]
fn bindgen_test_layout_rm_queue() {
    assert_eq!(::core::mem::size_of::<rm_queue>() , 16usize , concat ! (
               "Size of: " , stringify ! ( rm_queue ) ));
    assert_eq! (::core::mem::align_of::<rm_queue>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rm_queue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rm_queue ) ) . rmq_next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rm_queue ) , "::" ,
                stringify ! ( rmq_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rm_queue ) ) . rmq_prev as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rm_queue ) , "::" ,
                stringify ! ( rmq_prev ) ));
}
impl Clone for rm_queue {
    fn clone(&self) -> Self { *self }
}
impl Default for rm_queue {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub struct rmlock {
    pub lock_object: lock_object,
    pub rm_writecpus: cpuset_t,
    pub rm_activeReaders: rmlock__bindgen_ty_1,
    pub _rm_lock: rmlock__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rmlock__bindgen_ty_1 {
    pub lh_first: *mut rm_priotracker,
}
#[test]
fn bindgen_test_layout_rmlock__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<rmlock__bindgen_ty_1>() , 8usize ,
               concat ! ( "Size of: " , stringify ! ( rmlock__bindgen_ty_1 )
               ));
    assert_eq! (::core::mem::align_of::<rmlock__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rmlock__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmlock__bindgen_ty_1 ) ) . lh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmlock__bindgen_ty_1 )
                , "::" , stringify ! ( lh_first ) ));
}
impl Clone for rmlock__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rmlock__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Copy)]
pub union rmlock__bindgen_ty_2 {
    pub _rm_wlock_object: lock_object,
    pub _rm_lock_mtx: mtx,
    pub _rm_lock_sx: sx,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_rmlock__bindgen_ty_2() {
    assert_eq!(::core::mem::size_of::<rmlock__bindgen_ty_2>() , 32usize ,
               concat ! ( "Size of: " , stringify ! ( rmlock__bindgen_ty_2 )
               ));
    assert_eq! (::core::mem::align_of::<rmlock__bindgen_ty_2>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rmlock__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmlock__bindgen_ty_2 ) ) .
                _rm_wlock_object as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmlock__bindgen_ty_2 )
                , "::" , stringify ! ( _rm_wlock_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmlock__bindgen_ty_2 ) ) . _rm_lock_mtx
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmlock__bindgen_ty_2 )
                , "::" , stringify ! ( _rm_lock_mtx ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmlock__bindgen_ty_2 ) ) . _rm_lock_sx as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmlock__bindgen_ty_2 )
                , "::" , stringify ! ( _rm_lock_sx ) ));
}
impl Clone for rmlock__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl Default for rmlock__bindgen_ty_2 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for rmlock__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f , "rmlock__bindgen_ty_2 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_rmlock() {
    assert_eq!(::core::mem::size_of::<rmlock>() , 96usize , concat ! (
               "Size of: " , stringify ! ( rmlock ) ));
    assert_eq! (::core::mem::align_of::<rmlock>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rmlock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmlock ) ) . lock_object as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rmlock ) , "::" ,
                stringify ! ( lock_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmlock ) ) . rm_writecpus as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rmlock ) , "::" ,
                stringify ! ( rm_writecpus ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmlock ) ) . rm_activeReaders as * const
                _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rmlock ) , "::" ,
                stringify ! ( rm_activeReaders ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rmlock ) ) . _rm_lock as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( rmlock ) , "::" ,
                stringify ! ( _rm_lock ) ));
}
impl Clone for rmlock {
    fn clone(&self) -> Self { *self }
}
impl Default for rmlock {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
impl ::kernel::fmt::Debug for rmlock {
    fn fmt(&self, f: &mut ::kernel::fmt::Formatter) -> ::kernel::fmt::Result {
        write!(f ,
               "rmlock {{ lock_object: {:?}, rm_writecpus: {:?}, rm_activeReaders: {:?}, _rm_lock: {:?} }}"
               , self . lock_object , self . rm_writecpus , self .
               rm_activeReaders , self . _rm_lock)
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rm_priotracker {
    pub rmp_cpuQueue: rm_queue,
    pub rmp_rmlock: *mut rmlock,
    pub rmp_thread: *mut thread,
    pub rmp_flags: ::kernel::sys::raw::c_int,
    pub rmp_qentry: rm_priotracker__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rm_priotracker__bindgen_ty_1 {
    pub le_next: *mut rm_priotracker,
    pub le_prev: *mut *mut rm_priotracker,
}
#[test]
fn bindgen_test_layout_rm_priotracker__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<rm_priotracker__bindgen_ty_1>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( rm_priotracker__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<rm_priotracker__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( rm_priotracker__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rm_priotracker__bindgen_ty_1 ) ) .
                le_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rm_priotracker__bindgen_ty_1 ) , "::" , stringify ! ( le_next
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rm_priotracker__bindgen_ty_1 ) ) .
                le_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                rm_priotracker__bindgen_ty_1 ) , "::" , stringify ! ( le_prev
                ) ));
}
impl Clone for rm_priotracker__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rm_priotracker__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_rm_priotracker() {
    assert_eq!(::core::mem::size_of::<rm_priotracker>() , 56usize , concat ! (
               "Size of: " , stringify ! ( rm_priotracker ) ));
    assert_eq! (::core::mem::align_of::<rm_priotracker>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( rm_priotracker ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rm_priotracker ) ) . rmp_cpuQueue as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rm_priotracker ) , "::"
                , stringify ! ( rmp_cpuQueue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rm_priotracker ) ) . rmp_rmlock as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rm_priotracker ) , "::"
                , stringify ! ( rmp_rmlock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rm_priotracker ) ) . rmp_thread as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rm_priotracker ) , "::"
                , stringify ! ( rmp_thread ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rm_priotracker ) ) . rmp_flags as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rm_priotracker ) , "::"
                , stringify ! ( rmp_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rm_priotracker ) ) . rmp_qentry as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( rm_priotracker ) , "::"
                , stringify ! ( rmp_qentry ) ));
}
impl Clone for rm_priotracker {
    fn clone(&self) -> Self { *self }
}
impl Default for rm_priotracker {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rusage {
    pub ru_utime: timeval,
    pub ru_stime: timeval,
    pub ru_maxrss: ::kernel::sys::raw::c_long,
    pub ru_ixrss: ::kernel::sys::raw::c_long,
    pub ru_idrss: ::kernel::sys::raw::c_long,
    pub ru_isrss: ::kernel::sys::raw::c_long,
    pub ru_minflt: ::kernel::sys::raw::c_long,
    pub ru_majflt: ::kernel::sys::raw::c_long,
    pub ru_nswap: ::kernel::sys::raw::c_long,
    pub ru_inblock: ::kernel::sys::raw::c_long,
    pub ru_oublock: ::kernel::sys::raw::c_long,
    pub ru_msgsnd: ::kernel::sys::raw::c_long,
    pub ru_msgrcv: ::kernel::sys::raw::c_long,
    pub ru_nsignals: ::kernel::sys::raw::c_long,
    pub ru_nvcsw: ::kernel::sys::raw::c_long,
    pub ru_nivcsw: ::kernel::sys::raw::c_long,
}
#[test]
fn bindgen_test_layout_rusage() {
    assert_eq!(::core::mem::size_of::<rusage>() , 144usize , concat ! (
               "Size of: " , stringify ! ( rusage ) ));
    assert_eq! (::core::mem::align_of::<rusage>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rusage ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_utime as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_utime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_stime as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_stime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_maxrss as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_maxrss ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_ixrss as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_ixrss ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_idrss as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_idrss ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_isrss as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_isrss ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_minflt as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_minflt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_majflt as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_majflt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_nswap as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_nswap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_inblock as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_inblock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_oublock as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_oublock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_msgsnd as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_msgsnd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_msgrcv as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_msgrcv ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_nsignals as * const _ as
                usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_nsignals ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_nvcsw as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_nvcsw ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rusage ) ) . ru_nivcsw as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( rusage ) , "::" ,
                stringify ! ( ru_nivcsw ) ));
}
impl Clone for rusage {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct __wrusage {
    pub wru_self: rusage,
    pub wru_children: rusage,
}
#[test]
fn bindgen_test_layout___wrusage() {
    assert_eq!(::core::mem::size_of::<__wrusage>() , 288usize , concat ! (
               "Size of: " , stringify ! ( __wrusage ) ));
    assert_eq! (::core::mem::align_of::<__wrusage>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __wrusage ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __wrusage ) ) . wru_self as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __wrusage ) , "::" ,
                stringify ! ( wru_self ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __wrusage ) ) . wru_children as * const _
                as usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( __wrusage ) , "::" ,
                stringify ! ( wru_children ) ));
}
impl Clone for __wrusage {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rlimit {
    pub rlim_cur: rlim_t,
    pub rlim_max: rlim_t,
}
#[test]
fn bindgen_test_layout_rlimit() {
    assert_eq!(::core::mem::size_of::<rlimit>() , 16usize , concat ! (
               "Size of: " , stringify ! ( rlimit ) ));
    assert_eq! (::core::mem::align_of::<rlimit>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rlimit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rlimit ) ) . rlim_cur as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rlimit ) , "::" ,
                stringify ! ( rlim_cur ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rlimit ) ) . rlim_max as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rlimit ) , "::" ,
                stringify ! ( rlim_max ) ));
}
impl Clone for rlimit {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct orlimit {
    pub rlim_cur: __int32_t,
    pub rlim_max: __int32_t,
}
#[test]
fn bindgen_test_layout_orlimit() {
    assert_eq!(::core::mem::size_of::<orlimit>() , 8usize , concat ! (
               "Size of: " , stringify ! ( orlimit ) ));
    assert_eq! (::core::mem::align_of::<orlimit>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( orlimit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const orlimit ) ) . rlim_cur as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( orlimit ) , "::" ,
                stringify ! ( rlim_cur ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const orlimit ) ) . rlim_max as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( orlimit ) , "::" ,
                stringify ! ( rlim_max ) ));
}
impl Clone for orlimit {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct loadavg {
    pub ldavg: [__fixpt_t; 3usize],
    pub fscale: ::kernel::sys::raw::c_long,
}
#[test]
fn bindgen_test_layout_loadavg() {
    assert_eq!(::core::mem::size_of::<loadavg>() , 24usize , concat ! (
               "Size of: " , stringify ! ( loadavg ) ));
    assert_eq! (::core::mem::align_of::<loadavg>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( loadavg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const loadavg ) ) . ldavg as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( loadavg ) , "::" ,
                stringify ! ( ldavg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const loadavg ) ) . fscale as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( loadavg ) , "::" ,
                stringify ! ( fscale ) ));
}
impl Clone for loadavg {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "averunnable"]
    pub static mut averunnable: loadavg;
}
extern "C" {
    pub fn read_cpu_time(cp_time: *mut ::kernel::sys::raw::c_long);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcb {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "__start_set_pcpu"]
    pub static mut __start_set_pcpu: *mut usize;
}
extern "C" {
    #[link_name = "__stop_set_pcpu"]
    pub static mut __stop_set_pcpu: *mut usize;
}
extern "C" {
    #[link_name = "dpcpu_off"]
    pub static mut dpcpu_off: [usize; 0usize];
}
#[repr(C)]
#[derive(Copy)]
pub struct pcpu {
    pub pc_curthread: *mut thread,
    pub pc_idlethread: *mut thread,
    pub pc_fpcurthread: *mut thread,
    pub pc_deadthread: *mut thread,
    pub pc_curpcb: *mut pcb,
    pub pc_switchtime: u64,
    pub pc_switchticks: ::kernel::sys::raw::c_int,
    pub pc_cpuid: u_int,
    pub pc_allcpu: pcpu__bindgen_ty_1,
    pub pc_spinlocks: *mut lock_list_entry,
    pub pc_cp_time: [::kernel::sys::raw::c_long; 5usize],
    pub pc_device: *mut device,
    pub pc_netisr: *mut ::kernel::sys::raw::c_void,
    pub pc_unused1: ::kernel::sys::raw::c_int,
    pub pc_domain: ::kernel::sys::raw::c_int,
    pub pc_rm_queue: rm_queue,
    pub pc_dynamic: usize,
    pub pc_early_dummy_counter: u64,
    pub __bindgen_padding_0: [u8; 88usize],
    pub pc_monitorbuf: [::kernel::sys::raw::c_char; 128usize],
    pub pc_prvspace: *mut pcpu,
    pub pc_curpmap: *mut pmap,
    pub pc_tssp: *mut amd64tss,
    pub pc_commontssp: *mut amd64tss,
    pub pc_kcr3: u64,
    pub pc_ucr3: u64,
    pub pc_saved_ucr3: u64,
    pub pc_rsp0: register_t,
    pub pc_scratch_rsp: register_t,
    pub pc_scratch_rax: register_t,
    pub pc_apic_id: u_int,
    pub pc_acpi_id: u_int,
    pub pc_fs32p: *mut user_segment_descriptor,
    pub pc_gs32p: *mut user_segment_descriptor,
    pub pc_ldt: *mut system_segment_descriptor,
    pub pc_tss: *mut system_segment_descriptor,
    pub pc_pm_save_cnt: u64,
    pub pc_cmci_mask: u_int,
    pub pc_dbreg: [u64; 16usize],
    pub pc_pti_stack: [u64; 16usize],
    pub pc_pti_rsp0: register_t,
    pub pc_dbreg_cmd: ::kernel::sys::raw::c_int,
    pub pc_vcpu_id: u_int,
    pub pc_pcid_next: u32,
    pub pc_pcid_gen: u32,
    pub pc_smp_tlb_done: u32,
    pub pc_ibpb_set: u32,
    pub __pad: [::kernel::sys::raw::c_char; 216usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pcpu__bindgen_ty_1 {
    pub stqe_next: *mut pcpu,
}
#[test]
fn bindgen_test_layout_pcpu__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<pcpu__bindgen_ty_1>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pcpu__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<pcpu__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pcpu__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu__bindgen_ty_1 ) ) . stqe_next as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu__bindgen_ty_1 ) ,
                "::" , stringify ! ( stqe_next ) ));
}
impl Clone for pcpu__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for pcpu__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::core::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_pcpu() {
    assert_eq!(::core::mem::size_of::<pcpu>() , 1024usize , concat ! (
               "Size of: " , stringify ! ( pcpu ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_curthread as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_curthread ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_idlethread as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_idlethread ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_fpcurthread as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_fpcurthread ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_deadthread as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_deadthread ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_curpcb as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_curpcb ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_switchtime as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_switchtime ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_switchticks as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_switchticks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_cpuid as * const _ as usize
                } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_cpuid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_allcpu as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_allcpu ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_spinlocks as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_spinlocks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_cp_time as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_cp_time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_device as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_device ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_netisr as * const _ as
                usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_netisr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_unused1 as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_unused1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_domain as * const _ as
                usize } , 132usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_domain ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_rm_queue as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_rm_queue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_dynamic as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_dynamic ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_early_dummy_counter as *
                const _ as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_early_dummy_counter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_monitorbuf as * const _ as
                usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_monitorbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_prvspace as * const _ as
                usize } , 384usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_prvspace ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_curpmap as * const _ as
                usize } , 392usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_curpmap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_tssp as * const _ as usize
                } , 400usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_tssp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_commontssp as * const _ as
                usize } , 408usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_commontssp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_kcr3 as * const _ as usize
                } , 416usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_kcr3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_ucr3 as * const _ as usize
                } , 424usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_ucr3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_saved_ucr3 as * const _ as
                usize } , 432usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_saved_ucr3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_rsp0 as * const _ as usize
                } , 440usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_rsp0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_scratch_rsp as * const _ as
                usize } , 448usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_scratch_rsp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_scratch_rax as * const _ as
                usize } , 456usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_scratch_rax ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_apic_id as * const _ as
                usize } , 464usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_apic_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_acpi_id as * const _ as
                usize } , 468usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_acpi_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_fs32p as * const _ as usize
                } , 472usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_fs32p ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_gs32p as * const _ as usize
                } , 480usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_gs32p ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_ldt as * const _ as usize }
                , 488usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_ldt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_tss as * const _ as usize }
                , 496usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_tss ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_pm_save_cnt as * const _ as
                usize } , 504usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_pm_save_cnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pcpu ) ) . pc_cmci_mask as * const _ as
                usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( pcpu ) , "::" ,
                stringify ! ( pc_cmci_mask ) ));
